{"CARS 2\n                         \n                         \n                          WRITTEN BY\n                         \n                          BEN QUEEN\n                         \n                         \n                         \n          A sleek British sports car talks directly to us in a\n          pixilated, garbled video. He's OUT OF BREATH. Crates are\n          visible behind him. We're in the shadowy bowels of a steel\n          room.\n                         \n                          LELAND TURBO\n           This is Agent Leland Turbo. I have\n           a flash transmission for Agent Finn\n           McMissile.\n                         \n          SUPERIMPOSE OVER BLACK: WALT DISNEY PICTURES PRESENTS\n                         \n                          LELAND TURBO\n           Finn. My cover's been compromised.\n           Everything's gone pear-shaped.\n                         \n          SUPERIMPOSE OVER BLACK: A PIXAR ANIMATION STUDIOS FILM\n                         \n                          LELAND TURBO\n           You won't believe what I've found\n           out here.\n                         \n          He angles our camera view, reveals a PORTHOLE through which\n          we can see flames rising in the distance.\n                         \n                          LELAND TURBO\n           This is bigger than anything we've\n           ever seen. And no one even knows it\n           exists. Finn, I need backup. But\n           don't call the cavalry - it could\n           blow the operation. And be careful.\n           It's not safe out here!\n                         \n          ANGRY VOICES O.S. Time for Turbo to go.\n                         \n                          LELAND TURBO\n           Transmitting my grids now. Good\n           luck!\n                         \n          Coordinates appear: 40 6.80' N - 172 23.84' W\n                         \n          TITLE CARD: CARS 2\n                         \n                         \n          EXT. SOMEWHERE IN THE NORTH PACIFIC - NIGHT\n                         \n          A TINY CRAB BOAT (CRABBY) crests over massive swells.\n                         \n                          CRABBY\n           Alright buddy, we're here. Right\n           where you paid me to bring you.\n           Question is, why?\n                         \n          A metallic blue sports car, circa the `60s, emerges from the\n           2.\n                         \n                         \n          shadows. Cagey, smooth, he'd turn heads driving through any\n          intersection in the world. Meet FINN MCMISSILE.\n                         \n                          FINN\n           I'm looking for a car.\n                         \n                          CRABBY\n           A car? Hey pal, you can't get any\n           further away from land than out\n           here.\n                         \n                          FINN\n           Exactly where I want to be.\n                         \n                          CRABBY\n           Well I got news for you, buddy.\n           There's nobody out here but us.\n                         \n          Suddenly, a HORN -- a COMBAT SHIP, the size of most cruise\n          ships. FINN quickly backs into the shadows, out of sight.\n                         \n                          COMBAT SHIP\n           What are you doing out here?\n                         \n                          CRABBY\n           What does it look like, genius? I'm\n           crabbing!\n                         \n                          COMBAT SHIP\n           Well turn around and go back where\n           you came from.\n                         \n                          CRABBY\n           Yeah? And who's gonna make me?\n                         \n          A laser sight hits Crabby between the eyes.\n                         \n                          CRABBY\n           Alright, alright! Don't get your\n           prop in a twist.\n           (as he turns to leave)\n           What a jerk. Sorry, buddy. Looks\n           like it's the end of the line.\n           Buddy?\n                         \n          ON CRABBY'S DECK: Finn is gone.\n                          CUT TO:\n                         \n          FINN - He HANGS off the side of COMBAT SHIP, clandestine.\n                         \n          We're with Finn as the ship continues on, cuts through the\n          darkness with purpose. Suddenly small flames appear, perhaps\n          a knot or so away. Then WHOOSH!!! A flame rises above Finn,\n          the ship. It illuminates an OIL DERRICK.\n           3.\n                         \n                         \n          THWAP! Finn fires a GRAPPLING HOOK to the derrick and SWINGS\n          toward it. He's going to SLAM into the side with brute force\n                         WHEN ---\n                         \n          --- HIS TIRES sprout a magnetic exoskeleton. He STICKS to the\n          derrick and now DRIVES VERTICALLY UP UP UP...\n                         \n          From this vantage point, hundreds of derricks appear.\n                         \n          EXT. PLATFORM - OIL DERRICK - MOMENTS LATER\n                         \n          Finn approaches a loading bay from above, hides. He watches\n          as GREMLINS, PACERS and assorted other cars scurry about.\n                         \n           FINN (INTO RADIO)\n           Leland Turbo, this is Finn\n           McMissile. I'm at the rally point.\n           Over.\n                         \n          No response.\n                         \n           FINN (INTO RADIO)\n           Leland, it's Finn. Please respond.\n           Over.\n                         \n          AN ACCESS DOOR OPENS LOUDLY below. A boxy, monacle-wearing\n          German car enters. This is PROFESSOR OTTO ZUNDAPP.\n                         \n                          PROFESSOR ZUNDAPP\n           (in German and English)\n           Too many cars here. Out of my way!\n                         \n                          FINN\n           Professor Zundapp?\n                         \n           PACER (O.S.)\n           Here it is, Professor.\n                         \n          Zundapp approaches a NOSY PACER who idles next to a CRATE.\n                         \n                          NOSY PACER\n           You wanted to see this before we\n           load it?\n                         \n                          PROFESSOR ZUNDAPP\n           Ah, yes. Very carefully...\n                         \n          A forklift opens the crate -- inside is a TV CAMERA, packed\n          carefully in foam. Finn SNAPS PHOTOS FURIOUSLY.\n                         \n                          NOSY PACER\n           Oh. A TV camera. What does it\n           actually do?\n           4.\n                         \n                         \n                          PROFESSOR ZUNDAPP\n           This camera is extremely dangerous.\n                         \n                          FINN\n                          (TO HIMSELF)\n           What are you up to now, Professor?\n                         \n          Finn, angling for a better view, FIRES SUSPENSION WIRES ---\n                         \n          --- which sail clear to the other side of the derrick ---\n                         \n          --- THOK! They hook tightly onto a steel girder.\n                         \n          Finn slides out ONTO THE WIRE like an acrobat, then expels\n          another cross-wire for support.\n                         \n                          PROFESSOR ZUNDAPP\n           This is valuable equipment. Make\n           sure it is properly secured for the\n           voyage.\n                         \n                          NOSY PACER\n           You got it.\n                         \n          Finn LOWERS HIMSELF. He snaps more pictures.\n                         \n           GREM (O.S.)\n           Hey, Professor Z!\n                         \n          Zundapp turns as a CRANE LOWERS A CAR-SIZED CRATE. GREM and\n          ACER, an orange Gremlin and a green Pacer, flank it.\n                         \n                          GREM\n           This is one of those British spies\n           we told you about.\n                         \n                          ACER\n           Yeah. This one we caught sticking\n           his bumper where it didn't belong.\n                         \n          Finn PRODUCES SEMI-AUTOMATIC GUNS from his side, readies\n          himself for a tag-team spy fight with his buddy Leland.\n                         \n                          PROFESSOR ZUNDAPP\n           Agent Leland Turbo.\n                         \n          The crate is lifted, revealing a CRUSHED, CUBED Leland Turbo.\n                         \n          Finn's eyes go wide. Suddenly --- WHOOOSHHH! Another derrick\n          flame rises behind him, casts a Finn-shaped SHADOW over the\n          Professor. He looks up.\n           5.\n                         \n                         \n                          PROFESSOR ZUNDAPP\n           It's Finn McMissile! He's seen the\n           camera! Kill him!!\n                         \n          Finn UNLOADS with bullets as he starts to retreat --- He\n                         STOPS:\n                         \n          BAD GUY CARS are waiting for him on the catwalk where he just\n          came from - BLOWTORCHES ready.\n                         \n          Finn, stuck in midair, notices an angry CRANE. Finn GRINS,\n          having just found his escape.\n                         \n          THWAPTHWAPTHWAP!!! Finn releases three of his four cables,\n          swinging, Indiana Jones-style on the last one TOWARD THE\n                         CRANE ---\n                         \n          --- where he lands on its BOOM, drives UP and LAUNCHES OFF IT\n          where he LANDS - MOVING - onto another deck!\n                         \n          Finn now DRIVES, spraying oil and screeching around corners.\n          A GREMLIN in pursuit hits the oil patch, loses control ---\n                         \n          --- and PLUMMETS OFF the side of the rig!\n                         \n          The Gremlin FALLS... it's like an eternity...\n                         \n          He smashes into the water and breaks into a million pieces.\n                         \n          ON FINN - Now set upon by 20 or 30 MORE pursuing cars. He has\n          nowhere to go but UP UP UP a ramp toward the helipad. He\n          spies some GASOLINE BARRELS, fires a SINGLE BULLET which cuts\n          through its leather straps, sending barrels DOWN the ramp,\n          PAST FINN ---\n                         \n          --- PAST the pursuing CARS ---\n                         \n          --- to the bottom where they EXPLODE in a CHAIN REACTION back\n          UP THE RAMP, taking out at least 15 CARS!\n                         \n          ON THE HELIPAD - Finn blasts into view, pulls to a stop. No\n          more road. Nowhere else to go.\n                         \n          The 20 BAD GUY CARS that are still in pursuit surround him,\n          fire up their blowtorches. About to pounce.\n                         \n          Finn GRINS. The second time we've seen this grin. It means\n          he's got something cooking.\n                         \n          Finn's REVERSE LIGHTS appear. He DRIVES BACKWARD off the edge\n          of the helipad to the SHOCK of the other cars.\n                         \n          Finn falls. He turns himself so he's grill first, cleanly\n          cutting into the water.\n           6.\n                         \n                         \n          He EMERGES, now sprouting HYDROFOIL and speeds away.\n                         \n                          GREM\n                          (NONPLUSSED)\n           Get to the boats.\n                         \n          THE BOATS - an army of combat ships quickly DROP into the sea\n          and CHURN WATER with unprecedented fury as they quickly make\n          up the distance between them and Finn, FIRING BULLETS as they\n          do so.\n                         \n                          ACER\n           He's getting away!\n                         \n                          COMBAT SHIP\n           Not for long.\n                         \n          The LEAD COMBAT SHIP quietly drops a TORPEDO into the water.\n          It skips along, connecting with Finn in his rear and\n          EXPLODING with such force that water skyrockets into the\n          night clouds.\n                         \n          UNDERWATER - McMissile SINKS. Then, he blinks. He GRINS.\n          We're starting to like this grin and what follows it. He now\n          CONVERTS into a submarine. From his trunk he releases four\n          DECOY tires which float to the surface like body parts.\n                         \n          ON THE DERRICK - Professor Zundapp watches it all from far\n          away.\n                         \n           GREM (OVER RADIO)\n           He's dead, Professor.\n                         \n                          PROFESSOR ZUNDAPP\n           Wunderbar. With Finn McMissile\n           gone, who can stop us now?\n                         \n          EXT. RADIATOR SPRINGS - DAY\n                         \n          TOW MATER, a rusty tow truck, putters into view.\n                         \n                          MATER\n           Mater. Tow Mater, that's who... is\n           here to help you!\n                         \n          He approaches a broken-down sedan on the side of the road. He\n          drives around to the front, catching OTIS' face for the first\n          time.\n                         \n                          MATER\n           Hey, Otis!\n           7.\n                         \n                         \n                          OTIS\n           Hey, Mater. Gosh, I'm so sorry. I\n           thought I could make it this time,\n           but...\n           (he tries to start his\n           engine, stalls)\n           Smooth like pudding, huh? Ah, who\n           am I kidding? I'll always be a\n           lemon.\n                         \n          Mater hooks his friend and starts towing him.\n                         \n                          MATER\n           Well dadgum, you're leaking oil\n           again. Must be your gaskets. Hey,\n           look on the bright side: This is\n           your tenth tow this month, so that\n           means it's on the house.\n                         \n                          OTIS\n           You're the only one that's nice to\n           lemons like me, Mater.\n                         \n                          MATER\n           Don't sweat it. These things happen\n           to everybody, Otis.\n                         \n                          OTIS\n           But you never leak oil.\n                         \n                          MATER\n           Yeah, but I ain't perfect. Don't\n           tell nobody, but I think my rust is\n           starting to show through.\n                         \n          Mater and Otis drive past THE RADIATOR SPRINGS WELCOME SIGN.\n          It has been amended to say: \"Home of Lightning McQueen.\"\n                         \n                          OTIS\n           Hey, is Lightning McQueen back yet?\n                         \n                          MATER\n           Not yet.\n                         \n                          OTIS\n           He must be crazy-excited about\n           winning his fourth Piston Cup.\n           Four! Wow!\n           8.\n                         \n                         \n                          MATER\n           Yeah, we're so dadgum proud of him.\n           But I sure wish he'd hurry up and\n           get back `cause we got a whole\n           summer's worth of best friend fun\n           to make up for. Just me and --\n                         \n          Ahead of them, a half-mile off, a RED RACE CAR is visible.\n                         \n                          MATER\n           --- McQueen!\n                         \n          Mater FLOORS IT, dragging poor Otis behind him.\n                         \n                          OTIS\n           Uh, Mater? I'm in no hurry. You\n           don't need to go so fast!\n                         \n          Boom! They hit a bump. Otis catches air.\n                         \n          EXT. RADIATOR SPRINGS - DAY\n                         \n          Lightning McQueen is surrounded by his hometown friends.\n                         \n                          LUIGI\n           Oh, Lightning. Welcome home.\n                         \n                          FLO\n           Good to have you back, honey.\n                         \n                          FILLMORE\n           Congratulations, man.\n                         \n                          SARGE\n           Welcome home, soldier.\n                         \n                          SHERIFF\n           The place wasn't the same without\n           you, son.\n                         \n                          LIZZIE\n           What? Did he go somewhere?\n                         \n                          MCQUEEN\n           It's good to be home, everybody.\n                         \n           MATER (O.S.)\n           McQueen!\n                         \n          They all turn around, see Mater speeding into town, with Otis\n          swerving behind him.\n                         \n                          MCQUEEN\n           Mater!\n           9.\n                         \n                         \n                          MATER\n           McQueen!\n                         \n          Mater skids into main street and in one swift motion,\n          slingshots Otis forward ---\n                         \n                          OTIS\n           Woaahhhhh!\n                         \n          --- right through Ramone's front door ---\n                         \n          INT. RAMONE'S - CONTINUOUS\n                         \n          --- where he lands perfectly on the hydraulic lift. Ramone\n          lifts him up, routine.\n                         \n                          RAMONE\n           Hey. How far'd you make it this\n           time, Otis?\n                         \n                          OTIS\n           Halfway to the county line.\n                         \n                          RAMONE\n           Not bad, man.\n                         \n                          OTIS\n           I know, I can't believe it either!\n                         \n          EXT. RADIATOR SPRINGS - CONTINUOUS\n                         \n                          MATER\n           McQueen, welcome back!\n                         \n                          MCQUEEN\n           Mater, it's so good to see you.\n                         \n                          MATER\n           You too, buddy.\n                         \n          Mater and McQueen do an ELABORATE TIRE BUMP (fist bump\n          style).\n                         \n                          MATER\n           Oh, man. You ain't gonna believe\n           the things I got planned for us.\n                         \n          Everyone watches as the tire bump continues.\n                         \n                          MACK\n           (to Lizzie, an aside)\n           These best friend greetings get\n           longer every year.\n           10.\n                         \n                         \n                          MATER\n                          (TO MCQUEEN)\n           You ready to have some serious fun?\n                         \n                          MCQUEEN\n           Well, actually I've got something\n           to show you first.\n                         \n          INT. RADIATOR SPRINGS MUSEUM - DAY\n                         \n          CLOSE ON THE PISTON CUP. It has now changed, been adorned\n          with a small likeness of Doc. It says \"Hudson Hornet Piston\n          Cup.\"\n                         \n                          MATER\n           Wow. I can't believe they renamed\n           the Piston Cup after our very own\n           Doc Hudson.\n                         \n          McQueen and Mater are alone, the museum closed to the public.\n          McQueen approaches a \"Hudson Hornet\" wall with Doc's three\n          Piston cups, framed articles, other racing ephemera.\n                         \n                          MCQUEEN\n           I know Doc said these things were\n           just old cups, but to have someone\n           else win it just didn't feel right,\n           you know?\n                         \n                          MATER\n           Well, Doc would've been real proud\n           of you. That's for sure.\n                         \n          McQueen takes this in.\n                         \n          EXT. RADIATOR SPRINGS - LATER\n                         \n          McQueen and Mater exit the Doc Hudson Museum.\n                         \n                          MCQUEEN\n           Alright, pal. I've been waiting all\n           summer for this. What've you got\n           planned?\n                         \n                          MATER\n           You sure you can handle it?\n                         \n                          MCQUEEN\n           Come on, you know who you're\n           talking to? This is Lightning\n           McQueen. I can handle anything.\n           11.\n                         \n                         \n          EXT. RADIATOR SPRINGS - DAY\n                         \n          Mater and McQueen roll on an old train track, their tires\n          off. They're on their rims.\n                         \n                          MCQUEEN\n           Uh.... Mater?!\n                         \n                          MATER\n           Just remember, your brakes ain't\n           gonna work on these!\n                         \n          As they head INTO A DARK TUNNEL ---\n                         \n           MCQUEEN (O.S.)\n           Mater!\n                         \n           MATER (O.S.)\n           Relax, these train tracks ain't\n           been used in years!\n                         \n          From inside the tunnel a loud TRAIN HORN. The two friends\n          emerge, going as fast as they can on train tracks, uphill,\n          with no tires.\n                         \n                          MCQUEEN\n           Come on, come on! Faster, faster!\n                         \n          Moments later a harmless GALLOPING GOOSE appears, oversized\n          horn visible, cackling and laughing at his prank.\n                         \n          EXT. FIELD - OUTSIDE RADIATOR SPRINGS - LATER\n                         \n          An ENORMOUS EARTH MOVER sleeps. McQueen and Mater sneak up.\n                         \n                          MATER\n           This is gonna be good!\n                         \n          They blow their horns and he TIPS OVER, tractor-tipping\n          style. They LAUGH at the gag, but soon realize the earth\n          mover's GIANT EXHAUST PIPE is directly above them.\n                         \n                          MATER\n           Uh-oh. This ain't gonna be good.\n                         \n          The exhaust pipe BELCHES. McQueen and Mater are BLASTED out\n          of view.\n                         \n          INT. RADIATOR SPRINGS - DUSK\n                         \n          The sun sets. McQueen and Mater roll into town. McQueen looks\n          exhausted. Mater is still full of energy.\n           12.\n                         \n                         \n                          MATER\n           Boy, this was the best day ever!\n           And my favorite souvenir?\n                         \n          Mater proudly shows off a dent.\n                         \n                          MATER\n           This new dent!\n                         \n                          MCQUEEN\n           Boy, Mater. Today was, uh...\n                         \n                          MATER\n           Shoot, that was nothing. Wait til\n           you see what I got planned for\n           tonight.\n                         \n                          MCQUEEN\n           Mater, Mater. Whoa. I was kind of\n           thinking of just a quiet dinner.\n                         \n                          MATER\n           That's exactly what I was thinking.\n                         \n                          MCQUEEN\n           No, I... I meant with Sally, Mater.\n                         \n                          MATER\n           Even better! You, me and Miss Sally\n           going out for supper.\n                         \n          McQueen pulls around in front of Mater, stops.\n                         \n                          MCQUEEN\n           Mater, I meant it would be just me\n           and Sally.\n                         \n                          MATER\n           Oh.\n                         \n                          MCQUEEN\n           It's just for tonight. We'll do\n           whatever you want tomorrow.\n                         \n                          MATER\n                          (DISAPPOINTED)\n           Okay.\n                         \n                          MCQUEEN\n           Thanks for understanding.\n                         \n                          MATER\n           Yeah, sure. Y'all go on and have\n           fun now.\n           13.\n                         \n                         \n                          MCQUEEN\n           Alright, then. See ya soon, amigo!\n                         \n          McQueen drives off. Mater watches him go.\n                         \n          EXT. THE WHEEL WELL - NIGHT\n                         \n          It's been converted into a white-tablecloth restaurant, with\n          cars dining al fresco and a hopping gastropub inside.\n                         \n          MCQUEEN AND SALLY have a prime table with a view of Radiator\n          Springs and the starry night sky.\n                         \n                          SALLY\n           This is so nice.\n                         \n                          MCQUEEN\n           I can't tell you how good it is to\n           be here alone. Just the two of us.\n           Finally, you and me ---\n                         \n           MATER (O.S.)\n           Good evening.\n                         \n          Mater is at their table, dressed as a waiter.\n                         \n                          MATER\n           My name is Mater and I'll be your\n           waiter.\n                          (TO HIMSELF)\n           Mater the waiter. That's funny\n           right there.\n                         \n                          MCQUEEN\n           Mater, you work here?\n                         \n                          MATER\n           Well yeah I work here. What'd you\n           think, I just snuck in here when\n           nobody was looking and pretended to\n           be your waiter, just so I could\n           hang out with you?\n                         \n          McQueen and Sally exchange a look.\n                         \n                          MCQUEEN\n           Oh, yeah. How ridiculous would that\n           be?\n                         \n                          MATER\n           Now, can I start you two lovebirds\n           off with a couple drinks?\n           14.\n                         \n                         \n                          MCQUEEN\n           Yes. I'll have my usual.\n                         \n                          SALLY\n           You know what? I'm going to have\n           that too.\n                         \n          Mater blinks.\n                         \n                          MATER\n           Uh, right. Your usual.\n                          CUT TO:\n                         \n          INSIDE AT THE BAR - Fillmore and Sarge watch as Guido mixes\n          drinks, ala \"Cocktail.\" Mater arrives.\n                         \n                          MATER\n           Guido! What's McQueen's usual?\n                         \n                          GUIDO\n           (in Italian, subtitled)\n           How should I know?\n                         \n                          MATER\n           Perfect! Give me two of `em.\n                         \n                          SARGE\n           Quiet! My program's on.\n                         \n           MEL DORADO (O.S.)\n           Tonight on \"The Mel Dorado Show\"!\n                         \n          ON THE BAR TV - \"THE MEL DORADO SHOW,\" a cable talk show,\n          begins with file footage of MILES AXLEROD, a sleek SUV.\n                         \n           MEL DORADO (ON TV)\n           His story gripped the world! Oil\n           billionaire Miles Axlerod, in an\n           attempt to become the first car to\n           circumnavigate the globe without\n           GPS, ironically ran out of gas and\n           found himself trapped in the wild!\n                         \n          We see images of newspaper headlines, search crews.\n                         \n           MEL DORADO (ON TV)\n           Feared dead, he emerged 36 days\n           later, running on a fuel he'd\n           distilled himself from the natural\n           elements! Since then he's sold his\n           oil fortune, converted himself from\n           a gas-guzzler into an electric car,\n           and has devoted his life to finding\n           a renewable, clean-burning fuel!\n           15.\n                         \n                         \n          Images of oil derricks torn down": null, " Miles Axlerod getting\n          converted to electric": null, " lab scientists testing chemicals.\n                         \n           MEL DORADO (ON TV)\n           Now he claims to have done it with\n           his Allinol.\n                         \n          Images of fields, rivers, vegetables, and mountains all\n          combining to form the Allinol logo.\n                         \n           MEL DORADO (ON TV)\n           And to show the world what his new\n           superfuel can do, he's created a\n           racing competition like no other,\n           inviting the greatest champions\n           from around the globe to battle in\n           the first ever World Grand Prix.\n           Welcome Sir Miles Axlerod.\n                         \n          SIR MILES AXLEROD arrives, parks across from Mel's desk.\n                         \n           MILES AXLEROD (ON TV)\n           Thank you, Mel. It is very good to\n           be here. Now listen to me: Big Oil.\n           It costs a fortune. Pollution is\n           getting worse. I mean, come on.\n           It's a fossil fuel. Fossil. As in\n           dead dinosaurs. And we all know\n           what happened to them. Alternative\n           energy is the future. Trust me,\n           Mel, after seeing Allinol in action\n           at the World Grand Prix, nobody\n           will ever go back to gasoline\n           again.\n                         \n                          MATER\n                          (TO FILLMORE)\n           What happened to the dinosaurs,\n           now?\n                         \n           MEL DORADO (ON TV)\n           And on satellite, a World Grand\n           Prix competitor and one of the\n           fastest cars in the world,\n           Francesco Bernoulli.\n                         \n          Across the screen: LIVE FROM ROME, ITALY. We meet Formula\n          race car FRANCESCO BERNOULLI.\n                         \n           FRANCESCO (ON TV)\n           It is an honor, Signore Dorado. For\n           you.\n           16.\n                         \n                         \n           MEL DORADO (ON TV)\n           Miles, why not invite Lightning\n           McQueen?\n                         \n          Mater, collecting his drinks, looks up, half-intrigued.\n                         \n           MILES AXLEROD (ON TV)\n           Of course we invited him. But\n           apparently after a very long racing\n           season he is taking some time off\n           to rest.\n                         \n           FRANCESCO (ON TV)\n           Lightning McQueen would not have a\n           chance against Francesco!\n                         \n          Mater doesn't like this.\n                         \n           FRANCESCO (ON TV)\n           I can go over 300 kilometers an\n           hour! In miles that is like, uh...\n           way faster than McQueen.\n                         \n           MEL DORADO (ON TV)\n           Let's go to the phones. Baltimore,\n           Maryland, you're on the air.\n                         \n           CALLER (ON TV)\n           Am I on? Hello?\n                         \n           MEL DORADO (ON TV)\n           You're on. Go ahead.\n                         \n           CALLER (ON TV)\n           Hello?\n                         \n           MEL DORADO (ON TV)\n           Go ahead, caller.\n                         \n          Dial tone.\n                         \n           MEL DORADO (ON TV)\n           Let's go to Radiator Springs.\n           You're on, caller.\n                         \n           MATER'S VOICE (ON TV)\n           Yeah, that Italian feller you got\n           on there can't talk that way about\n           Lightning McQueen. He's the bestest\n           race car in the whole wide world.\n                         \n          Fillmore and Sarge look around. Mater is visible in the back\n          of the bar on an office phone.\n           17.\n                         \n                         \n                          SARGE\n           Uh-oh...\n                         \n           FRANCESCO (ON TV)\n           If he is, how you say \"the bestest\n           race car,\" then why must he rest,\n           eh?\n                         \n           MATER'S VOICE (ON TV)\n           Cause he knows what's important.\n           Every now and then he prefers just\n           to slow down, enjoy life.\n                         \n           FRANCESCO (ON TV)\n           Ah, you heard it! Lightning McQueen\n           prefers to be slow! Of course, this\n           is not news to Francesco. When I\n           want to go to sleep I watch one of\n           his races. After two laps I am out\n           cold.\n                         \n          Audible RXNS from the bar. A crowd has been forming ever\n          since Mater started talking.\n                         \n           MATER'S VOICE (ON TV)\n           That ain't what I meant.\n                          CUT TO:\n                         \n          MCQUEEN AND SALLY - They hear the commotion inside.\n                         \n                          MCQUEEN\n           Hey, what's going on over there?\n           CUT BACK TO:\n                         \n          THE BAR - Sally and McQueen push through the crowd, see that\n          they're watching Francesco on the television.\n                         \n                          MCQUEEN\n                          (TO SALLY)\n           Oh, it's that Italian Formula car.\n           His name is ---\n                         \n                          SALLY\n           Francesco Bernoulli. No wonder\n           there's a crowd.\n                         \n          When Sally says his name, she enunciates each part, as if\n          Italian were her mother's tongue.\n                         \n                          MCQUEEN\n           Wait, why do you know his name? And\n           don't say it like that. It's three\n           syllables, not ten.\n           18.\n                         \n                         \n                          SALLY\n           What? He's nice to look at. You\n           know, open-wheeled and all.\n                         \n                          MCQUEEN\n           What's wrong with fenders? I\n           thought you like my fenders.\n                         \n           MATER'S VOICE (ON TV)\n           Well let me tell you something else\n           there, Mr. San Francisco ---\n                         \n                          MCQUEEN\n           Mater?\n                         \n           MATER'S VOICE (ON TV)\n           McQueen could drive circles around\n           you.\n                         \n           FRANCESCO (ON TV)\n           Driving in circles is all he can\n           do, no?\n                         \n           MATER'S VOICE (ON TV)\n           No! I mean yes. I mean he could\n           beat you anywhere, anytime, any\n           track.\n                         \n          On McQueen - he looks at Guido who gives a nod over to ---\n                         \n          --- Mater, turned away from the crowd, still on the phone.\n                         \n           FRANCESCO (ON TV)\n           Mel, can we move on? Francesco\n           needs a caller who can provide a\n           little more intellectual\n           stimulation. Like a dump truck.\n                         \n          ON MCQUEEN. He doesn't like this at all.\n                         \n                          MATER\n           Ha ha! That shows what you know.\n           Dump trucks is dumb.\n                         \n          Suddenly, Mater is YANKED from the booth and replaced by\n          McQueen.\n                         \n           MCQUEEN (INTO PHONE)\n           Yeah, hi, this is Lightning\n           McQueen. Look, I don't appreciate\n           my best friend being insulted like\n           that.\n           19.\n                         \n                         \n           FRANCESCO (ON TV)\n           McQueen! That was your best friend?\n           This is the difference between you\n           and Francesco. Francesco knows how\n           good he is. He does not need to\n           surround himself with tow trucks to\n           prove it.\n                         \n                          MCQUEEN\n           Those are strong words from a car\n           that is so fragile.\n                         \n           FRANCESCO (ON TV)\n           Fragilé!? He calls Francesco\n           fragilé? Not so fast, McQueen!\n                         \n                          MCQUEEN\n           \"Not so fast.\" What is that, your\n           new motto?\n                         \n          Francesco goes ballistic in Italian. They cut his mic.\n                         \n           MILES AXLEROD (ON TV)\n           Well, this sounds like something\n           that needs to be settled on the\n           race course. What do you say,\n           Lightning McQueen? We've still got\n           room for one more racer.\n                         \n                          MCQUEEN\n           Well, I would love to. The only\n           thing is my crew's off for the\n           season so ---\n                         \n          A sound O.S. McQueen turns to see Fillmore, Sarge and Luigi\n          flank a tablecloth which is hanging off the bar. Ramone backs\n          away, having spray painted \"TEAM LIGHTNING MCQUEEN\" on it.\n          Guido quickly uncorks three wine bottles.\n                         \n                          GUIDO\n           Pit stop.\n                         \n          McQueen turns back to the phone.\n                         \n                          MCQUEEN\n           You know what? They just got back.\n           Deal me in, baby. Ka-chow!\n                         \n          The place ERUPTS IN CHEERS.\n                         \n          MOMENTS LATER - General excitement as McQueen exits the phone\n          booth where Sally waits. Off her look:\n           20.\n                         \n                         \n                          MCQUEEN\n           I know, I know. I just got back.\n           But we won't be long and ---\n                         \n                          SALLY\n           Oh, no, don't worry about me. I've\n           got enough to do here. Mater's\n           going to have a blast though.\n           (off McQueen's silence)\n           You're bringing Mater, right? You\n           never bring him to any of your\n           races.\n                         \n          McQueen turns to the bar where Mater privately tries their\n          drinks, hates it, spits it back in the glass.\n                         \n                          SALLY\n           Just let him sit in the pits, give\n           him a headset. C'mon, it'll be a\n           thrill of a lifetime for him.\n                         \n          Mater arrives.\n                         \n                          MATER\n           Your drinks, sir.\n                         \n                          MCQUEEN\n           Mater.\n                         \n                          MATER\n           I didn't taste it!\n                         \n                          MCQUEEN\n           How'd you like to come and see the\n           world with me?\n                         \n                          MATER\n           You mean it?\n                         \n                          MCQUEEN\n           You got me into this thing. You're\n           coming along.\n                         \n                         BEGIN MONTAGE:\n                         \n          - McQueen is given a new paint job and headlights by Ramone.\n          Mater, now sporting a \"Team McQueen\" emblem, seems psyched as\n          well.\n                         \n          - An airport DEPARTURES SIGN advertises the next flight:\n          Tokyo, Japan.\n                         \n          - Mater waves goodbye with his hook alongside McQueen, Guido,\n          Luigi, Fillmore and Sarge as ---\n           21.\n                         \n                         \n          --- the rest of Radiator Springs watches them board a plane.\n          Red bawls.\n                         \n          - IN THE JET, LATER. McQueen and Mater are the only ones\n          awake, watch an insane Japanese game show.\n                         \n          - JAPAN AT NIGHT. A stylish Tokyo cityscape of neon, glamour,\n          scrolling billboards, vending machines and high-tech\n          skyscrapers.\n                         \n          - INSIDE A SOUVENIR SHOP loaded with McQueen toys: Mater and\n          McQueen enter. A tourist sees McQueen and faints.\n                         \n          - A KABUKI THEATER. Team McQueen watches a methodical dance.\n          Mater, dressed in Kabuki makeup, arrives. He looks insane.\n                         \n          - A SUMO MATCH - Two SUZUKI SAMURAI CARS wrestle over a\n          parking space. Mater, now in his element, cheers.\n                         \n          The MONTAGE ENDS on this high note as we CUT TO ---\n                         \n          EXT. MUSEUM - TOKYO - NIGHT\n                         \n          ---- TEAM MCQUEEN, as they roll up the red carpet. Press is\n          held at bay behind ropes. WORLD GRAND PRIX and ALLINOL logos\n          are strategically placed for maximum press exposure. RACERS\n          are interviewed by press behind the red-carpet ropes.\n                         \n          INT. TOKYO MUSEUM - NIGHT\n                         \n          Team McQueen enters via a second floor landing which\n          overlooks a massive indoor party in a converted museum. As\n          they roll down a ramp to the party, they are awed.\n                         \n                          LUIGI\n           Guido, look! Ferraris and tires!\n           Let's go!\n                         \n                          MCQUEEN\n                          (IMPRESSED)\n           Hey, look at this. Okay now Mater,\n           remember: best behavior.\n                         \n                          MATER\n           You got it, buddy. Hey, what's\n           that?\n                         \n          He sees something, peels away.\n                         \n                          MCQUEEN\n           Mater!\n                         \n                          LEWIS HAMILTON\n           Hey, McQueen, over here!\n           22.\n                         \n                         \n          It's fellow racers JEFF GORVETTE and LEWIS HAMILTON. McQueen\n          now has no choice but to let Mater go.\n                         \n                          MCQUEEN\n           Hey, Jeff. Lewis!\n                          CUT TO:\n                         \n          MATER as he approaches a GLASS-ENCLOSED ROCK GARDEN where a\n          pitty RAKES rocks with precision. He knocks on the glass with\n          his hook.\n                         \n                          MATER\n           Hey! You done good! You got all the\n           leaves!\n                         \n          People turn at the noise he's making.\n           CUT BACK TO:\n                         \n          MCQUEEN, JEFF and LEWIS.\n                         \n                          JEFF GORVETTE\n           Check out that tow truck.\n                         \n                          LEWIS HAMILTON\n           I wonder who that guy's with?\n                         \n                          MCQUEEN\n           Will you guys excuse me just for\n           one little second?\n                         \n          He zips over to Mater's side, quickly pulls him out of sight.\n                         \n                          MCQUEEN\n           Mater, listen. This isn't Radiator\n           Springs.\n                         \n                          MATER\n           You're just realizing that? Boy,\n           that jet-lag really done a number\n           on you.\n                         \n                          MCQUEEN\n           Mater, look -- things are different\n           over here. Which means maybe you\n           should, you know, act a little\n           different too.\n                         \n                          MATER\n           Different than what?\n                         \n                          MCQUEEN\n           Well, just... help me out here,\n           buddy. I ---\n           23.\n                         \n                         \n                          MATER\n           You need help? Shoot, why didn't\n           you just say so? That's what a tow\n           truck does. Hey, looky there, it's\n           Mr. San Francisco!\n                         \n          FRANCESCO is visible across the room, holding court.\n                         \n                          MATER\n           I'll introduce you.\n                         \n                          MCQUEEN\n           Mater, no.\n                         \n                          MATER\n           (already on his way)\n           Look at me -- I'm helping you\n           already!\n                         \n          On FRANCESCO - MOMENTS LATER. Mater approaches, giddy.\n                         \n                          MATER\n           Hey Mr. San Francisco, I'd like you\n           to meet ---\n                         \n                          FRANCESCO\n           Lightning McQueen! Buona sera.\n                         \n                          MCQUEEN\n           Nice to meet you, Francesco.\n                         \n                          FRANCESCO\n           Yeah, nice to meet you too. You are\n           very good-looking. Not as good as I\n           thought, but you're good.\n                         \n                          MATER\n                          (TO FRANCESCO)\n           Excuse me. Can I get a picture with\n           you?\n                         \n                          FRANCESCO\n           Anything for McQueen's friend.\n                         \n          As Mater poses for a photo with Francesco:\n                         \n                          MATER\n           Miss Sally is gonna flip when she\n           sees this. She's Lightning\n           McQueen's girlfriend.\n                         \n                          FRANCESCO\n           Oooh.\n           24.\n                         \n                         \n                          MATER\n           She's a big fan of yours.\n                         \n                          FRANCESCO\n           Hey, she has good taste.\n                         \n                          MCQUEEN\n           Mater's prone to exaggeration. I\n           wouldn't say she's a \"big\" fan.\n                         \n                          MATER\n           You're right. She's a huge fan. She\n           goes on and on about your open\n           wheels here.\n                         \n                          MCQUEEN\n           Mentioning it once doesn't qualify\n           as going \"on and on.\"\n                         \n                          FRANCESCO\n           Francesco is familiar with this\n           reaction to Francesco. Women\n           respect a car that has nothing to\n           hide.\n                         \n                          MCQUEEN\n           Yeah, uh...\n                         \n                          FRANCESCO\n           Let us have a toast.\n                         \n          McQueen doesn't like where this is going, covers.\n                         \n                          MCQUEEN\n           Let's.\n                         \n                          FRANCESCO\n           (raising a drink)\n           I dedicate my win tomorrow... to\n           Miss Sally.\n                         \n                          MCQUEEN\n           Oh, sorry. I already dedicated MY\n           win tomorrow to her. So if we both\n           do it, it's really not so special.\n           Besides, I don't have a drink.\n                         \n                          MATER\n           I'll go get you one. You mind if I\n           borrow a few bucks for one of them\n           drinks?\n           25.\n                         \n                         \n                          MCQUEEN\n           (could kill him)\n           They're free, Mater.\n                         \n                          MATER\n           Free? Well, shoot, what am I doing\n           here?\n                         \n          Mater ZIPS OFF.\n                         \n                          MCQUEEN\n           I should probably go keep an eye on\n           him. See you at the race.\n                         \n          McQueen starts to leave.\n                         \n                          FRANCESCO\n           Yes, you will see Francesco. But\n           not like this.\n                         \n          Francesco does a 180, so his rear end now faces McQueen.\n                         \n                          FRANCESCO\n           You will see him like this, as he\n           drives away from you.\n                         \n          Francesco wears a bumper sticker that says \"Ciao, McQueen!\"\n                         \n                          MCQUEEN\n           That's cute. So you had one of\n           those made up for all the racers?\n                         \n                          FRANCESCO\n           No.\n                         \n                          MCQUEEN\n           Okay.\n                         \n          He rolls off.\n                         \n                          MCQUEEN\n           He is so getting beat tomorrow.\n                         \n          INT. PARTY - MOMENTS LATER\n                         \n          Lights caress the main stage where a crowd has formed.\n                         \n                          VOICE\n           Ladies and gentlecars... Sir Miles\n           Axlerod!\n                         \n          MILES AXLEROD drives through an infinity fountain, appears.\n           26.\n                         \n                         \n                          MILES AXLEROD\n           It is my absolute honor to\n           introduce to you the competitors in\n           the first-ever World Grand Prix.\n           From Brazil. Number eight...\n                         \n          ON FINN MCMISSILE. He appears from the shadows, keeps a\n          careful distance from the stage. He ZEROES HIS GAZE ON ---\n                         \n          --- THE WORLD GRAND PRIX TV CAMERAS which roll, catching\n          Miles Axlerod's speech for publicity and posterity.\n                         \n          Finn's ONBOARD COMPUTER ANALYZES each one, compares to the\n          photos we saw him snap on the oil platform. Each one is \"NOT\n          A MATCH.\" His view is suddenly disrupted by A BEAUTIFUL\n          SPORTS CAR. She approaches Finn. Meet HOLLEY SHIFTWELL.\n                         \n                          HOLLEY\n           A Volkswagen Karmann Ghia has no\n           radiator.\n                         \n                          FINN\n           That's because it's air-cooled.\n                         \n                          HOLLEY\n           I'm Agent Shiftwell, Holley\n           Shiftwell from the Tokyo Station. I\n           have a message from London.\n                         \n                          FINN\n           Not here.\n                          (LOUDLY)\n           You must try the canapes on the\n           mezzanine!\n                         \n          He moves her onto an elevator. The doors close on them.\n                         \n          IN THE ELEVATOR, GOING UP.\n                         \n                          FINN\n           So the lab boys analyzed the photo\n           I sent? What did they learn about\n           the camera?\n                         \n                          HOLLEY\n           It appears to be a standard\n           television camera. They said if you\n           could get closer photos next time,\n           that would be great.\n                         \n                          FINN\n           This was London's message?\n           27.\n                         \n                         \n                          HOLLEY\n           Oh -- no, no. No sir. Um, the oil\n           platforms you were on? Turns out\n           they're sitting on the biggest oil\n           reserve in the world.\n                         \n                          FINN\n           How did we miss that?\n                         \n                          HOLLEY\n           They'd been scrambling everyone's\n           satellites. The Americans actually\n           discovered it just before you did.\n           They placed an agent on that\n           platform, under deep cover. He was\n           able to get a photo of the car\n           who's running the entire operation.\n                         \n          The doors OPEN and they exit onto the Mezzanine.\n                         \n                          FINN\n           Who is it? Has anyone seen the\n           photo yet?\n                         \n                          HOLLEY\n           No, not yet. The American is here\n           tonight to pass it to you. He'll\n           signal you when he's ready.\n                         \n                          FINN\n                          GOOD ---\n                         \n          Finn suddenly STOPS COLD.\n                         \n                          FINN\n           Oh no.\n                         \n          Professor Zundapp is visible below them. He talks with a few\n          Pacers and Gremlins. Finn quickly retreats into the shadows.\n          Holley follows suit.\n                         \n                          HOLLEY\n           What is it?\n                         \n                          FINN\n           Change of plan. You're meeting the\n           American.\n                         \n                          HOLLEY\n           What, me?\n           28.\n                         \n                         \n                          FINN\n           Those thugs down there were on the\n           oil platform. If they see me, the\n           whole mission is compromised.\n                         \n                          HOLLEY\n           No, no. I'm technical, you see. I'm\n           in Diagnostics. I'm not a field\n           agent.\n                         \n                          FINN\n           You are now.\n                          CUT TO:\n                         \n          MATER as he grabs a drink, keeps moving.\n                         \n                          MATER\n           I'll take one of them.\n                         \n          He snatches it, drops it in the back where we now see a large\n          assortment of drinks balanced.\n                         \n                          MATER\n           Never know which one McQueen'll\n           have a hankering for.\n                         \n          He approaches a sushi bar.\n                         \n                          MATER\n           Hey, what you got here that's free?\n           How about that pistachio ice cream?\n                         \n          He refers to wasabi, of course.\n                         \n                          SUSHI CHEF\n           No, no. Wasabi.\n                         \n                          MATER\n           Oh, same ol', same ol'. What's up\n           with you? That looks delicious.\n                         \n          The chef starts to carve a small scoop aside for Mater.\n                         \n                          MATER\n           Uh, a little more, please.\n           It is free, right?\n           (the chef adds more)\n           Keep it coming. A little more. Come\n           on, let's go, it's free! You're\n           getting there... Scoop scoop!\n                         \n          The chef gives in. Scoops a baseball-sized ball out.\n           29.\n                         \n                         \n                          MATER\n           There you go. Now THAT's a scoop of\n           ice cream.\n                         \n                          SUSHI CHEF\n           (in Japanese, subtitles)\n           My condolences.\n           CUT BACK TO:\n                         \n          MILES AXLEROD - He's now nearly done with his intros.\n                         \n                          MILES AXLEROD\n           ... and now, our last competitor ---\n           Number 95, Lightning McQueen!\n                         \n          MCQUEEN approaches the microphone, flashes his headlights.\n                         \n                          MCQUEEN\n           Thank you so much for having us,\n           Sir Axlerod. I really look forward\n           to racing. This is a great\n           opportunity.\n                         \n                          MILES AXLEROD\n           Oh, the pleasure is all ours,\n           Lightning. You and your team bring\n           excellence and professionalism to\n           this competition.\n                         \n          As if on cue, Mater arrives with a piercing scream of pain.\n          Everyone turns as he charges head first toward the stage,\n          making a bee-line for that FOUNTAIN.\n                         \n                          MATER\n           Somebody get me water!\n                         \n          He laps up water from the fountain like a diabetic cat.\n                         \n                          MATER\n                          (LAPPING WATER)\n           Sweet relief...\n                         \n          Miles Axlerod is shocked. The crowd can't believe it.\n          Francesco cackles. Mater, now sated, approaches the mic.\n                         \n                          MATER\n           (to the crowd)\n           Whatever you do, do not eat the\n           free pistachio ice cream. It has\n           turned!\n                         \n                          MCQUEEN\n           Sir Axlerod, I can explain. This is\n           Mater.\n           30.\n                         \n                         \n                          MILES AXLEROD\n           I know him. This is the bloke that\n           called into the television show.\n                          (TO MATER)\n           You're the one I have to thank.\n                         \n                          MATER\n           No, thank you. This trip's been\n           amazing.\n                         \n                          MILES AXLEROD\n                          (TO MCQUEEN)\n           He's a little excited, isn't he?\n                         \n          TILT DOWN to reveal a pool of oil beneath Mater.\n                         \n                          MCQUEEN\n           Mater!\n                         \n                          MATER\n           But wait, I... oh, shoot.\n                         \n          McQueen quickly pulls Mater aside, out of earshot of Miles\n          Axlerod and the others. McQueen is beside himself.\n                         \n                          MCQUEEN\n           Mater, you have to get a hold of\n           yourself. You're making a scene.\n                         \n                          MATER\n           But I never leak oil. Never.\n                         \n                          MCQUEEN\n           Go take care of yourself right now.\n                         \n          Mater drives off.\n                         \n          ON MATER - MOMENTS LATER\n                         \n          He drives through the party, frantic.\n                         \n                          MATER\n           Coming through! Excuse me, leakin'\n           oil. Where's the bathroom? Thank\n           you. I gotta go!\n                         \n          Someone points Mater down a hallway. He whips around the\n                         CORNER ---\n                         \n          --- and STOPS. Finds himself in front of TWO BATHROOM DOORS,\n          neither of which clearly indicate MALE or FEMALE.\n           31.\n                         \n                         \n                          MATER\n                          (CONFUSED)\n           What the...\n                         \n          Mater chooses one, drives inside. A SHRIEK is heard and Mater\n          zips out.\n                         \n                          MATER\n           Sorry ladies!\n                         \n          He heads into the other door ---\n                          CUT TO:\n                         \n          INT. MEN'S ROOM - NIGHT\n                         \n          Mater rolls in, still `holding it in' like a kid.\n                         \n                          MATER\n           I never leak I never leak I never\n           leak...\n                         \n          He sees someone leaving a stall. He heads in.\n                         \n          IN THE STALL - Mater enters, looks up.\n                         \n                          MATER\n           Wowee...\n                         \n          The stall is a complicated apparatus with buttons and lights.\n          High-tech Japanese. It suddenly GRABS MATER, hoists him up as\n          if he's going to get an oil change.\n                         \n                          MATER\n           What in the---\n                         \n          A Japanese style cartoon CARICATURE appears on a TV MONITOR,\n          followed by images of waterfalls and rivers.\n                         \n                          MATER\n                          (GIGGLING)\n           Hey, that tickles.\n                         \n          The caricature starts talking in Japanese. Suddenly WATER\n          FIRES UP underneath Mater's undercarriage, goosing him. He\n          freaks out.\n                         \n          OUTSIDE THE STALL - With Mater's yells audible we see a\n          GREMLIN enter, furtive. Suddenly, inexplicably, his frame\n          BREAKS APART like an egg, revealing an AMERICAN MUSCLE CAR\n          underneath. The pieces of the Gremlin disappear under him,\n          clearly his disguise. This is ROD REDLINE - American Agent.\n           32.\n                         \n                         \n                          ROD REDLINE\n           Okay, McMissile. I'm here. It's\n           time for the drop.\n                         \n          INT. PARTY - SAME\n                         \n          HOLLEY, rolls along by herself. Nervous. DING! Her rearview\n          monitor springs to life.\n                         \n           HOLLEY (INTO RADIO)\n           The American has activated his\n           tracking beacon.\n                         \n           FINN (OVER RADIO)\n           Roger that. Move in.\n                         \n          INT. BATHROOM - SAME\n                         \n          Rod Redline, waiting at a sink, feels a presence behind him.\n                         \n          GREM and ACER have entered, hesitate briefly when they see\n          Rod Redline.\n                         \n          Rod Redline, careful, slides a gun out of his tire. He is\n          suddenly CHARGED by the AMCs --- Rod SPINS AROUND and gets a\n          shot off but is SLAMMED HEAD FIRST. A TIGHT, CLOSE-QUARTERS\n          FIGHT begins ---\n                         \n          IN THE STALL - Mater, still TRAPPED, is now being SCRUBBED as\n          if in a car wash. He is helpless.\n                         \n          OUTSIDE THE STALL - Rod is being pulverized. Just when he\n          scrambles away from one car, the other one takes over.\n                         \n          IN THE STALL - Mater is mercifully released, but when he\n          backs out ---\n                         \n          --- Rod Redline is THROWN INTO MATER'S STALL DOOR, crunching\n          it and sending Mater ---\n                         \n          --- BACK INTO THE CLUTCHES of the insane toilet.\n                         \n          INT. PARTY - SAME\n                         \n          Holley isolates the tracking beacon's location in the party.\n                         \n                          HOLLEY\n           Oh, you've got to be joking.\n                         \n                          FINN\n           What's the problem, Shiftwell?\n                         \n                          HOLLEY\n           He's in the loo.\n           33.\n                         \n                         \n                          FINN\n           So go in!\n                         \n                          HOLLEY\n           I can't just go into the men's loo.\n                         \n                          FINN\n           Time is of the essence, Shiftwell.\n                         \n          INT. BATHROOM - OUTSIDE THE STALL\n                         \n          Rod Redline is in bad shape. He backs away, betrays a look of\n          concern. He's in trouble here.\n                         \n          ACER burns rubber, ready to finish him off. Just as he shifts\n          into DRIVE ---\n                         \n          --- MATER'S STALL DOOR KICKS OPEN, knocking ACER out. Mater\n          jumps out, face-to-face GREM.\n                         \n                          MATER\n           (out of breath)\n           Whatever you do, I would not go in\n           there.\n                         \n          The door SWINGS shut, revealing the pulverized Acer.\n                         \n                          MATER\n           A Gremlin and a Pacer!\n                         \n          Rod Redline, now behind Mater and sensing an opportunity\n          here, quickly produces A SMALL DEVICE.\n                         \n                          MATER\n           (to Grem and Acer)\n           No offense to your makes and\n           models, but you guys break down\n           harder than my cousin Betsy after\n           she got left at the ---\n                         \n          Rod Redline, surreptitiously attaches the device to Mater's\n          undercarriage.\n                         \n                          MATER\n           (as he's goosed)\n           --- altar!\n                         \n          He spins around, sees Rod Redline for the first time.\n                         \n                          MATER\n           Are you okay?\n                         \n                          ROD REDLINE\n           I'm fine.\n           34.\n                         \n                         \n                          GREM\n           Hey. Tow truck.\n                         \n          Mater turns back to Grem and Acer.\n                         \n                          GREM\n           We'd like to get to our private\n           business here, if you don't mind.\n                         \n                          MATER\n           Oh, yeah. Don't let me get in the\n           way of your \"private business.\"\n           Oh! A little advice: When you hear\n           her giggle and see that waterfall,\n           you best press that green button.\n                         \n                          GREM\n           Thank you.\n                         \n                          MATER\n           It's to adjust the temperature.\n                         \n                          ACER\n           Got it.\n                         \n                          MATER\n           Remember it's in Celsius, not\n           Fahrenheit.\n                         \n           GREM AND ACER\n           Get outta here!\n                         \n                          MATER\n           Alright then.\n                         \n          Mater exits, leaving Rod Redline to a now even angrier Grem\n          and Acer.\n                         \n          EXT. BATHROOM - MOMENTS LATER\n                         \n          Holley arrives at the door. She takes a breath, is about to\n          enter when Mater EXITS.\n                         \n                          MATER\n           Excuse me, ma'am.\n                         \n          He passes her, expelling some exhaust in the process.\n          Holley's rearview tracking confirms that the device is on\n          him.\n                         \n                          MATER\n                          (TO HIMSELF)\n           Dadgum pistachio ice cream.\n           35.\n                         \n                         \n           HOLLEY (INTO RADIO)\n           This cannot be him.\n                         \n           FINN (OVER RADIO)\n           Is he American?\n                         \n                          MATER\n           (driving off, to himself)\n           Look out, ladies. Mater's fittin'\n           to get funky!\n                         \n           HOLLEY (INTO RADIO)\n           Extremely.\n                         \n           FINN (OVER RADIO)\n           Then it's him.\n                         \n          It's settled. Holley takes one more nervous breath, quickly\n          closes the distance between her and Mater, cuts him off. He\n          is forced to STOP.\n                         \n                          HOLLEY\n           Hello.\n                         \n                          MATER\n           Well, hello.\n                         \n                          HOLLEY\n           A Volkswagen Karmann Ghia has no\n           radiator.\n                         \n                          MATER\n           Well of course it doesn't. That's\n           `cause it's air-cooled!\n                         \n                          HOLLEY\n                          (RELIEVED)\n           Perfect. I'm from the Tokyo Station\n                          OF THE---\n                         \n                          MATER\n           Course, Karmann Ghia's weren't the\n           only ones. Besides the Beetles you\n           had your Type-3 Squarebacks, with\n           the pancake motors...\n                         \n                          HOLLEY\n           Yeah. Okay, I get it---\n                         \n                          MATER\n           ... And before both of them,\n           there's the Type-2 buses - my buddy\n           Fillmore's one of them.\n           36.\n                         \n                         \n                          HOLLEY\n           Listen! We should find somewhere\n           more private.\n                         \n                          MATER\n           Uh, gee. Don't you think that's a\n           little, uh ---\n                         \n                          HOLLEY\n                          (NERVOUS ENERGY)\n           You're right. Impossible to know\n           which areas here are compromised.\n           So, when can I see you again?\n                         \n                          MATER\n           Well, let's see. Tomorrow I'll be\n           out there at the races.\n                         \n                          HOLLEY\n           Got it. We'll rendezvous then.\n                         \n          INT. PARTY - MOMENTS LATER\n                         \n          Mater returns to his team, lost in thought.\n                         \n                          MCQUEEN\n           There you are. Where have you been?\n                         \n                          MATER\n           What's a rendezvous?\n                         \n                          LUIGI\n           It's like a date.\n                         \n                          MATER\n           A date?!\n                         \n                          MCQUEEN\n           Mater, what's going on?\n                         \n                          MATER\n           Well, what's going on is I've got\n           me a date tomorrow.\n                         \n          Guido makes a crack in Italian.\n                         \n                          LUIGI\n           Guido don't believe you.\n                         \n                          MATER\n           Well, believe it. My new girlfriend\n           just said so. Hey, there she is.\n                         \n          Mater points out Holley, who's within earshot.\n           37.\n                         \n                         \n                          MATER\n                          (YELLING)\n           Hey! Hey lady!\n                         \n          Holley, caught in plain view, DRIVES OFF.\n                         \n                          MATER\n           See ya tomorrow!\n                         \n          Guido makes another crack in Italian.\n                         \n                          LUIGI\n           Guido still don't believe you.\n                         \n          EXT. SHIPYARD - THE DOCKS - TOKYO NIGHT\n                         \n          An industrial dock, outside of the city proper.\n                         \n          INT. SHIPYARD - NIGHT\n                         \n          Rod Redline dangles from a car magnet. He's been beaten up,\n          clings to consciousness.\n                         \n           GREM (O.S.)\n           I gotta admit ---\n                         \n          Grem, Acer, and a bunch of nasty looking troublemakers look\n          up at Rod amidst crates and shipping containers.\n                         \n                          GREM\n           --- you tricked us real good.\n                         \n                          ACER\n           And we don't like being tricked.\n                         \n          Rod Redline laughs to himself.\n                         \n                          ACER\n           Hey, what's so funny?\n                         \n                          ROD REDLINE\n           Well, you know, I was just wearing\n           a disguise. You guys are stuck\n           looking like that.\n                         \n          This doesn't help him. They DROP HIM onto a TREADMILL, lock\n          him down. A container is wheeled forward and Rod is plied\n          with Allinol brand gasoline.\n                         \n                          ROD REDLINE\n           Allinol? Thanks, fellas. I hear\n           this stuff is good for you.\n           38.\n                         \n                         \n           PROFESSOR ZUNDAPP (O.S.)\n           So you think.\n                         \n          The Professor emerges from the darkness, behind Rod.\n                         \n                          PROFESSOR ZUNDAPP\n           Allinol by itself is good for you.\n                         \n          Zundapp hits a button and the TREADMILL starts Rod's wheels\n          spinning at a high rate of speed.\n                         \n                          PROFESSOR ZUNDAPP\n           But after microscopic examination,\n           I have found that it has one small\n           weakness. When hit with an\n           electromagnetic pulse, it becomes\n           extremely dangerous.\n                         \n                          GREM\n                          SMILE ---\n                         \n          Grem pushes a World Grand Prix CAMERA - the same one that\n          was in the box back at the oil derrick. He points it at Rod\n          Redline.\n                         \n                          GREM\n           --- for the camera.\n                         \n                          ROD REDLINE\n           Is that all you want? I got a whole\n           act.\n                         \n                          PROFESSOR ZUNDAPP\n           You were very interested in this\n           camera on the oil platform. Now you\n           will witness what it really does.\n                         \n                          ROD REDLINE\n           Whatever you say, Professor.\n                         \n          Acer pushes a TV MONITOR toward Rod. On it, surveillance\n          footage from the party. Clearly, they were watching and\n          recording him there.\n                         \n                          ACER\n           You talked up a lot of cars last\n           night. Which one's your associate?\n                         \n                          ROD REDLINE\n           Your mother. Oh no, I'm sorry. It\n           was your sister. You know, I can't\n           tell them apart these days.\n           39.\n                         \n                         \n                          GREM\n                          (HAD ENOUGH)\n           Could I start it now, Professor?\n                         \n                          PROFESSOR ZUNDAPP\n           Fifty percent power.\n           (to Rod Redline)\n           This camera is actually an\n           electromagnetic pulse emitter.\n                         \n                          ACER\n           (re: a girl on the TV)\n           What about her? Did you give it to\n           her?\n                         \n                          PROFESSOR ZUNDAPP\n           The Allinol is now heating to a\n           boil, dramatically expanding,\n           causing the engine block to crack\n           under the stress, forcing oil into\n           the combustion chamber.\n                         \n          Rod Redline's engine starts to CRACK and BREAK.\n                         \n                          ACER\n           (re: a guy on the TV)\n           How about him? You talk to him?\n                         \n                          ROD REDLINE\n           (to Professor Zundapp)\n           What do I care? I can replace an\n           engine block.\n                         \n                          PROFESSOR ZUNDAPP\n           You may be able to, but after full\n           impact of the pulse, unfortunately,\n           there will be nothing to replace.\n                         \n                          ACER\n           How about him? Does he have it?\n                         \n          The monitor reveals MATER, rolling out of the bathroom and\n          down the hall.\n                         \n          Rod Redline, seeing this, does the world's most subtle double\n          take. We caught it, but there's no way anyone else in the\n          room could have ---\n                         \n                          PROFESSOR ZUNDAPP\n           That's him. He's the one.\n                         \n                          GREM\n           Roger that, Professor Z.\n           40.\n                         \n                         \n                          ROD REDLINE\n           No!\n                         \n          As Grem turns up the machine even MORE, the Professor makes a\n          call.\n                         \n           PROFESSOR ZUNDAPP (INTO PHONE)\n           Yes sir. We believe the infiltrator\n           has passed along sensitive\n           information.\n           (beat, listening)\n           I will take care of it before any\n           damage can be done.\n                         \n          The Professor hangs up, turns to the room.\n                         \n                          PROFESSOR ZUNDAPP\n           The project is still on schedule.\n           You will find this second agent ---\n                         \n          Zundapp kicks the camera's power into the RED.\n                         \n                          PROFESSOR ZUNDAPP\n           --- and kill him.\n                         \n          On the MONITOR - With Mater's frozen image on the screen we\n          see Rod EXPLODE in the reflection.\n                         \n          EXT. JAPAN - DAY\n                         \n          Over television pre-roll of Japan:\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           Japan. Land of the rising sun.\n           Where ancient tradition meets\n           modern technology. Welcome to the\n           inaugural running of the World\n           Grand Prix.\n                         \n          ON OUR ANNOUNCERS as they introduce themselves:\n                         \n                          BRENT MUSTANGBURGER\n           I'm Brent Mustangburger, here with\n           racing legends Darrell Cartrip and\n           David Hobbscap. There's never been\n           a competition like this before.\n                         \n          SHOTS OF THE PITS as the racers fuel up.\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           First, Allinol, making its debut\n           tonight as the required fuel for\n           all these great champions.\n                          (MORE)\n           41.\n                         \n           BRENT MUSTANGBURGER (V.O.) (CONT'D)\n           Second, the course itself, and it's\n           like nothing we've ever seen.\n           David, how exactly does this\n           competition work?\n                         \n           DAVID HOBBSCAP (V.O.)\n           Well, Brent, all three of these\n           street courses are classic round-\n           the-house racetracks.\n                         \n          OUTLINES OF THREE RACE COURSES are shown. They're labeled\n          Japan, Italy and England, and are different in shape and\n          size.\n                         \n           DAVID HOBBSCAP (V.O.)\n           This means that the LMP and Formula\n           cars should break out of the gate\n           in spectacular fashion.\n                         \n          SHOTS OF THE RACERS as they weave up the track, practicing.\n                         \n           DAVID HOBBSCAP (V.O.)\n           Look for Francesco Bernoulli in\n           particular to lead early.\n                         \n          SHOTS OF Francesco, featured in an inset.\n                         \n           DAVID HOBBSCAP (V.O.)\n           And with a series of technical\n           turns throughout ---\n                         \n          MORE SHOTS of the course, now highlighting the tech turns.\n                         \n           DAVID HOBBSCAP (V.O.)\n           GT and Touring cars like Spain's\n           Miguel Camino should make up some\n           ground but I doubt it'll be enough\n           to stop Francesco from absolutely\n           running away with it.\n                         \n           DARRELL CARTRIP (V.O.)\n           Woah, now just hold your\n           horsepower. You're forgetting the\n           most important factor here. That\n           early dirt track section of the\n           course! The dirt is supposed to be\n           the great equalizer in this race.\n                         \n          GRAPHICS OF THE COURSES now isolate a stretch after the first\n          couple turns, label it \"DIRT SECTIONS.\"\n           42.\n                         \n                         \n           BRENT MUSTANGBURGER (V.O.)\n           French Rally car Raoul ÇaRoule is\n           counting on a big boost headed\n           through there.\n                         \n           DARRELL CARTRIP (V.O.)\n           And don't forget Lightning McQueen!\n           His mentor, the Hudson Hornet, was\n           one of the greatest dirt track\n           racers of all time. In my opinion,\n           McQueen is the best all-around\n           racer in this competition.\n                         \n          BACK IN THE STUDIO\n                         \n                          DAVID HOBBSCAP\n           Really, Darrell, I think you need\n           to clean your windshield. You're\n           clearly not seeing this for what it\n           is: Francesco's race to lose.\n                         \n          EXT. STARTING LINE - DAY\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           It's time to find out. The racers\n           are locking into the grid ---\n                         \n          Engines rev as everyone gets ready to go. Everyone's bright\n          eyed and alert except for McQueen who we find in the back of\n          the grid. He CLOSES his eyes.\n                         \n                          MCQUEEN\n                          (TO HIMSELF)\n           Speed. I am speed.\n                         \n          A LAUGH O.S. McQueen opens his eyes. Francesco is next to him\n          on the grid.\n                         \n                          FRANCESCO\n           Really? You are \"speed\"? Then\n           Francesco is triple speed.\n           (closes his eyes)\n           Francesco. Is. Triple speed.\n           Francesco likes this, McQueen. It's\n           really getting him into the zone!\n                         \n                          MCQUEEN\n           He is so getting beat today.\n                         \n          The starting lights click down from RED to YELLOW to GREEN.\n          The race begins. Francesco quickly grabs the lead. He's\n          pulling away within seconds.\n           43.\n                         \n                         \n          ON PIT ROW - We TRACK PAST as the various Crew Chiefs on\n          their crash carts bark orders to their racers. We end on Team\n          McQueen. No Crew Chief, just a solid looking team.\n                         \n                          SARGE\n           His suspension stats look good.\n                         \n                          LUIGI\n           Tire pressure is excellent.\n                         \n                          FILLMORE\n           He's got plenty of fuel.\n                         \n                          MATER\n           And he's awesome!\n                          CUT TO:\n                         \n          The same view of Mater but now THROUGH A TELESCOPIC DISPLAY.\n          Reveal Finn and Holley watching from high above in a downtown\n          office building, behind reflective glass.\n                         \n                          HOLLEY\n           Why is he in the pits? He's so\n           exposed.\n                         \n                          FINN\n           It's his cover. One of the best\n           I've seen, too. Look at the detail\n           on that rust. It must have cost him\n           a fortune.\n                         \n                          HOLLEY\n           But why hasn't he contacted us yet?\n                         \n                          FINN\n           There's probably heat on him. Be\n           patient.\n                         \n                          HOLLEY\n           Right, of course. He'll signal us\n           when he can.\n                         \n                          FINN\n           And then we find out who's behind\n           all this.\n                         \n          ON THE TRACK - VARIOUS SHOTS OF THE RACE through Tokyo as\n          Francesco extends his lead and McQueen attempts to make up\n          ground.\n           44.\n                         \n                         \n          IN MCQUEEN'S PIT - Mater watches the monitors, sees them\n          approaching the dirt section.\n                         \n                          MATER\n           McQueen! It's time to make your\n           move. Get on the outside and show\n           'em what Doc done taught you.\n                         \n           MCQUEEN (OVER RADIO)\n           Ten four, Mater.\n                         \n          ON THE TRACK - Francesco hits the dirt section and loses all\n          control. He SLAMS to a halt, his tires getting no traction.\n                         \n           DAVID HOBBSCAP (V.O.)\n           Francesco is brought to a\n           screeching halt!\n                         \n          MCQUEEN skids into view, turning right to go left, passing\n          Francesco, followed by other cars ---\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           Lightning McQueen is the first to\n           take advantage. And just like that,\n           folks, Francesco's lead is left in\n           the dust.\n                         \n                          MCQUEEN\n           Nice call, Mater. Keep it up!\n                         \n          McQueen now leads the pack, zooming out of the dirt now\n          starting to relax.\n                         \n           DARRELL CARTRIP (V.O.)\n           Who-hoo! Man, McQueen looks happier\n           than a rollbar at a demolition\n           derby!\n                         \n          ON PAVED ROAD AGAIN - MOMENTS LATER\n                         \n          The field of cars thunders into a tunnel.\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           Everyone's jostling for position as\n           we hit the asphalt again.\n                         \n          Francesco crests the hill, in last place. He bites down,\n          determined, then CHASES.\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           Francesco lost a lot of momentum in\n           the dirt. He's got some serious\n           work ahead of him if he wants to\n           get back in this race.\n           45.\n                         \n                         \n          VARIOUS SHOTS OF TOKYO as the racers move through the Rainbow\n          Bridge. Bit by bit, Francesco ekes his way toward the front,\n          toward Lightning McQueen as we CUT TO ---\n                         \n          --- A ROOFTOP, and a VIEW THROUGH THE WGP CAMERA LENS. Grem\n          and Acer are manning this one. They focus it on the racers as\n          they approach.\n                         \n           PROFESSOR ZUNDAPP (OVER RADIO)\n           It is time.\n                         \n                          GREM\n           Roger that.\n                         \n          ON THE TRACK - A racer (Miguel Camino) suddenly PLUMES WITH\n          SMOKE and skids out.\n                         \n           DARRELL CARTRIP (V.O.)\n           Oh! Miguel Camino has blown an\n           engine!\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           Very unusual, Darrell. He's been so\n           consistent all year.\n                         \n          Camino quickly pits, passing McQueen's pit where Mater is\n          visible.\n                         \n          ON GREM AND ACER, watching from above.\n                         \n                          GREM\n           You gotta be kidding me.\n                         \n                          ACER\n           What is it?\n                         \n                          GREM\n           It's that tow truck from the\n           bathroom.\n                         \n                          ACER\n           The one from the bathroom?\n                         \n                          GREM\n           Yeah, the one the American Agent\n           passed the device to.\n                         \n                          ACER\n           What about him?\n                         \n                          GREM\n           What about him? He's in the pits!\n           46.\n                         \n                         \n                          ACER\n           Not for long.\n                         \n          Acer exits, with purpose.\n                         \n          ON FINN AND HOLLEY, still in their office hideaway. Holley's\n          onboard computer flashes an ALERT.\n                         \n                          HOLLEY\n           Hold on. I think I've got\n           something.\n                         \n                          FINN\n           What is it?\n                         \n                          HOLLEY\n           The Pacer from the party last\n           night.\n                         \n          She's spotted Acer, moving swiftly forward.\n                         \n                          HOLLEY\n           Cross-referencing with the photos\n           from the oil derricks... Yep. His\n           VIN numbers match.\n                         \n                          FINN\n           Anyone with him? He won't be alone.\n                         \n                          HOLLEY\n           Conducting analysis on the target.\n                         \n          The computer finds more and more bad guy Pacers and Gremlins\n          are in the crowd.\n                         \n                          HOLLEY\n           He's not the only one here.\n           Three... five... they're\n           everywhere. And they're all closing\n           in on... oh no.\n                         \n          We PAN OVER to see it's MATER.\n                         \n                          HOLLEY\n           Finn? Finn, where are you?\n                         \n          She turns. He's GONE, leaving only an open window.\n                         \n           FINN (OVER RADIO)\n           Get him out of the pits now!\n                         \n          IN MCQUEEN'S PIT. A car WHIPS BY O.S.\n           47.\n                         \n                         \n                          MATER\n           Wow! Some of them fellers is really\n           loud.\n                         \n           HOLLEY (OVER MATER'S RADIO)\n           Can you hear me? Over.\n                         \n                          MATER\n           Uh, what?\n                         \n           HOLLEY (OVER MATER'S RADIO)\n           Get out of the pit now. Do you hear\n           me?\n                         \n          Mater realizes this girl has somehow broken into his radio.\n                         \n           MATER (INTO RADIO)\n           Hey, I know you. You're that girl\n           from the party last night. You\n           wanna do our date right now?\n                         \n          ON THE TRACK - McQueen boxes out Francesco, holds his slim\n          lead, but barely.\n                         \n                          MCQUEEN\n           Guys, a little too much chatter.\n           Let's keep this line clear.\n                         \n          BOOM! A racer behind McQueen suddenly expels black smoke,\n          skids out of control.\n                         \n          ON GREM - laughing. That was clearly his handiwork.\n                         \n          IN MCQUEEN'S PIT - SAME\n                         \n           HOLLEY (ON MATER'S RADIO)\n           There's no time for messing about.\n           You've got to get out of the pits.\n                         \n                          MATER\n           Is there gonna be cable where you\n           is so I can watch the rest of the\n           race?\n                         \n          ON HOLLEY - Watching from the downtown building.\n                         \n           HOLLEY (INTO RADIO)\n           You're running out of time!\n                         \n           FINN (OVER RADIO)\n           They're coming, Shiftwell.\n                         \n           HOLLEY (INTO RADIO)\n           Yes, I know.\n           48.\n                         \n                         \n           FINN (OVER RADIO)\n           Get him out of there.\n                         \n                          HOLLEY\n                          (TO FINN)\n           I'm trying.\n                          (TO MATER)\n           Get out now!\n                         \n          We CUT BACK TO ---\n                         \n          --- MATER. He gives in, exits the pit.\n                         \n                          MATER\n           Well, all right but I usually like\n           to have a proper detailing done\n           before I meet a lady friend.\n                         \n          He moves toward the back PIT DOOR, is about to open it.\n                         \n          OUTSIDE THE PITS - ACER and another Pacer approach McQueen's\n          pit door on the other side. Ready to pounce. The doors OPEN,\n                         REVEALING ---\n                         \n          --- Finn, holding a fire extinguisher.\n                         \n                          ACER\n           Finn McMissile? But you're dead!\n                         \n                          FINN\n           Then this shouldn't hurt at all.\n                         \n          He empties the extinguisher in their eyes, speeds past. They\n          try and follow, but have been blinded. One of them crashes\n          right into a COP.\n                         \n          ON FINN - Already on the move, along a side street.\n                         \n                          FINN\n           Miss Shiftwell?\n                         \n          ON HOLLEY - Tracking everything on a grid map. Mater looks\n          like Pac Man, weaving through the streets as bad guys close\n          in all around him.\n                         \n                          HOLLEY\n           I've got him in the back alleys\n           east of the garages. Multiple\n           assailants are closing in quickly.\n                         \n           FINN (OVER RADIO)\n           Keep him moving. I'm on my way.\n                         \n          ON MATER - He turns a corner, sees a flower shop.\n           49.\n                         \n                         \n                          MATER\n           Hey, new lady friend? You like\n           flowers?\n                         \n          ON THE TRACK - McQueen, hearing this, is taken aback.\n                         \n                          MCQUEEN\n           What?\n                         \n          ON MATER - Slowing at the flower shop.\n                         \n           HOLLEY (OVER RADIO)\n           No! Don't go 'in' anywhere. Just\n           keep moving.\n                         \n                          MATER\n           Stay outside. Gotcha.\n                         \n          ON THE TRACK\n                         \n                          MCQUEEN\n           Outside?\n                         \n          McQueen drifts outside allowing Francesco to slip past!\n                         \n                          FRANCESCO\n           Grazie and arrivaderci!\n                         \n           DARRELL CARTRIP (V.O.)\n           I cannot believe what I just saw,\n           Brent. That was a bonehead move.\n           You don't open up the inside like\n           that!\n                         \n          IN THE BACK ALLEYS - As Mater moves on he's followed by\n          Pacers and Gremlins. Suddenly ---\n                         \n          --- CABLES whip in front of them, pulling over flower vending\n          machines and sending the shop's owners into a frenzy. They\n          direct their attention to the AMCs, who try and explain.\n                         \n          ON FINN, admiring his handiwork as he appears. Just as he\n          turns to leave he's BROADSIDED and pushed INTO A DARK ALLEY.\n                         \n          IN THE ALLEY - Finn finds himself boxed by two Pacers and\n          pushed toward ---\n                         \n          --- ACER, who now holds a FLAME THROWER.\n                         \n                          ACER\n           This time I'm gonna make sure you\n           stay dead.\n                         \n          He hits the flame. WHOOOSSSH!!\n           50.\n                         \n                         \n          ON ANOTHER STREET - Mater clicks along, still looking for\n          Holley. Just as he passes the alley entrance where Finn\n          stares down death:\n                         \n           HOLLEY (OVER RADIO)\n           You're doing brilliantly. Now just\n           stay focused.\n                         \n                          MATER\n           What's that? You want me to head\n           toward that ruckus?\n                         \n          Mater turns INTO the alley.\n                         \n           HOLLEY (OVER RADIO)\n           No! Don't go down that street!\n                         \n          IN THE ALLEY - Finn, now nearly pushed completely into the\n          flame thrower, leaps into the air. He FIGHTS BACK, using his\n          wheels, axle, indeed his entire car frame as if he were\n          human, kicking and tossing and shooting his enemies.\n                         \n          Mater witnesses the whole thing.\n                         \n                          MATER\n           Wow! A live karate demonstration!\n                         \n          ON THE TRACK - McQueen, now playing catch-up again, scowls.\n                         \n                          MCQUEEN\n           Stop it, Mater. Just sign off.\n                         \n          IN THE BACK ALLEY - Finn polishes off the AMCs by firing a\n          bullet into a gas main line, causing an EXPLOSION that tosses\n          Acer through the air where he lands in a NOODLE SHOP'S SIGN.\n                         \n          ON THE TRACK - The end of the race is nigh ---\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           They're bumper to bumper as they\n           approach the finish line!\n                         \n          The Formula car gets there first.\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           Francesco's the winner, McQueen's\n           number two!\n                         \n          IN THE ALLEY - Finn heaves breaths, surveys his damage.\n                         \n                          MATER\n           That was cool! Hey, can I get your\n           autograph?\n           51.\n                         \n                         \n          Mater approaches when a MASS OF RACE FANS burst out a door,\n          momentarily blocking Mater's view of Finn. Once the fans have\n          past, Finn has disappeared.\n                         \n                          MATER\n           Hey, where'd he go?\n                         \n           HOLLEY (OVER RADIO)\n           Our rendezvous has been\n           jeopardized. Keep the device safe.\n           We'll be in touch.\n                         \n                          MATER\n           Dadgum, did I miss our date?\n                         \n          EXT. PRESS STAGE - LATER\n                         \n          Post race press conference. Francesco is center stage.\n                         \n                          DARRELL CARTRIP\n           Francesco, over here! Hey, what was\n           your strategy today?\n                         \n                          FRANCESCO\n           Strategia? Francesco needs no\n           strategy, it's very simple. You\n           start the race, wait for Lightning\n           McQueen to choke, pass him, then\n           win. Francesco always wins. It's\n           boring.\n                         \n          McQueen, waiting in the wings, rolls his eyes. He suddenly\n          notices something O.S.\n                         \n          McQueen's P.O.V. - It's MATER, appearing from a side street,\n          moving toward the pits, oblivious of the press conference.\n                         \n                          DARRELL CARTRIP\n                          (TO FRANCESCO)\n           I gotta tell you, dude. You were in\n           trouble for awhile. That dirt track\n           section had you crawling!\n                         \n          As McQueen SNEAKS AWAY ---\n                         \n                          FRANCESCO\n           To truly crush one's dream, you\n           must first raise their hopes very\n           high.\n                         \n          IN MCQUEEN'S PIT GARAGE - Mater looks around for everyone as\n          McQueen approaches.\n           52.\n                         \n                         \n                          MCQUEEN\n          Mater.\n                         \n                          MATER\n          Hey McQueen! What happened? Is the\n          race over? You won, right?\n                         \n                          MCQUEEN\n          Mater, why were you yelling things\n          at me while I was racing?\n                         \n                          MATER\n          Yelling? Oh, you thought... that's\n          funny right there. Nah, see that's\n          `cause I seen these two fellers\n          doing some sort of karate street\n          performance. It was nutso. One of\n          them even had a flamethrower ---\n                         \n                          MCQUEEN\n          A flamethrower? What are you\n          talking about? I don't understand.\n          Where were you?\n                         \n                          MATER\n          Going to meet my date.\n                         \n                          MCQUEEN\n          Your date?\n                         \n                          MATER\n          She started talking to me as a\n          voice in my head, telling me where\n          to go ---\n                         \n                          MCQUEEN\n          What?\n                         \n                          MATER\n          Wait a minute -- I didn't screw you\n          up, did I?\n                         \n                          MCQUEEN\n          I lost the race because of you!\n                         \n                          MATER\n          Well, I'm sorry. I didn't mean ---\n                         \n                          MCQUEEN\n          An imaginary girlfriend,\n          flamethrowers. This is exactly why\n          I don't bring you along to these\n          things.\n           53.\n                         \n                         \n                          MATER\n           Maybe if I, I don't know, talked to\n           somebody and explained what\n           happened I could help.\n                         \n                          MCQUEEN\n           I don't need your help. I don't\n           want your help.\n                         \n           PRESS (O.S.)\n           Hey, there he is!!\n                         \n          The press finds McQueen, swarms him. Mater is pushed\n          backwards as the questions fly again.\n                         \n                          PRESS\n           - McQueen, you had it in the bag!\n           - Yeah, what happened?\n                         \n                          MCQUEEN\n           I made a mistake. But I can assure\n           you, it won't happen again.\n                         \n          On Mater. He takes this badly.\n                         \n                          MCQUEEN\n           Look, guys. We know what the\n           problem is and we've taken care of\n           it.\n                          SMASH TO:\n                         \n          OVER FOOTAGE OF FRANCESCO and various other highlights:\n                         \n                          BRENT MUSTANGBURGER\n           Lightning McQueen loses in the last\n           lap to Francesco Bernoulli in the\n           first race of the World Grand Prix\n           and three, count em, three cars\n           flamed out leading some to suggest\n           that their fuel, Allinol, might be\n           to blame.\n                         \n          FOOTAGE OF MILES AXLEROD, speaking to an aggressive press. He\n          must SHOUT over the press.\n                         \n                          MILES AXLEROD\n           Allinol is safe! Alternative fuel\n           is safe! There is no way my fuel\n           caused these cars to flame out!\n           54.\n                         \n                         \n          IN THE TV STUDIO - Darrell, Brent and David talk to camera.\n                         \n                          DARRELL CARTRIP\n           Well the jury may still be out on\n           whether Allinol caused these\n           accidents, but one thing's for\n           sure: Lightning McQueen blew this\n           race.\n                         \n          Off a FROZEN IMAGE of McQueen crossing the finish line, a\n          look of severe consternation across his face ---\n                         \n                          BRENT MUSTANGBURGER\n           Team McQueen can't be happy right\n           now.\n                         \n          --- MATCH CUT TO ---\n                         \n          INT. AIRPORT - JAPAN - DAY\n                         \n          --- McQueen's SMILING FACE, on a Team McQueen poster.\n                         \n          REVERSE to reveal Mater looking at it, sadly. He drives on,\n          passing (but not noticing) ---\n                         \n          --- GREM and ACER.\n                         \n          AT THE SECURITY CHECK - MOMENTS LATER. Cars take off their\n          tires, move through the metal detector. Mater waits in line.\n          A SECURITY CAR approaches Mater.\n                         \n                          SECURITY CAR\n           (in Japanese and English)\n           Come with me please, sir.\n                         \n                          MATER\n           But I'm gonna miss my plane.\n                         \n          IN THE ADMIRAL'S LOUNGE - MOMENTS LATER. The Security Car\n          leads Mater inside.\n                         \n                          SECURITY CAR\n           Right this way.\n                         \n          As they move past us the Security Car covertly drops a BALL\n          BEARING which rolls into a corner. The ball bearing then\n          sprouts MECHANICAL LEGS, tripods itself and IRISES out,\n          revealing itself to be a tiny CAMERA.\n                         \n          IN THE MAIN ROOM - ADMIRAL'S LOUNGE - CONTINUOUS\n                         \n          Mater follows the Security Car in, nervous.\n           55.\n                         \n                         \n                          MATER\n           Doggone it. This is about my hook,\n           isn't it? I know I should've\n           checked it, but I can't really,\n           look -- it's attached to me.\n                         \n          ZWAPPPPPP!! The Security Car suddenly DECLOAKS himself,\n          reveals himself to be Finn McMissile!\n                         \n                          MATER\n           Hey, I know you. You're that feller\n           from the karate demonstration.\n                         \n                          FINN\n           I never properly introduced myself.\n           Finn McMissile. British\n           Intelligence.\n                         \n                          MATER\n           Tow Mater. Average intelligence.\n                         \n                          FINN\n           Who are you with? FBI, CIA?\n                         \n                          MATER\n           Let's just say I'm triple-A\n           affiliated. You know, I know some\n           karate. I don't wanna brag or\n           nothing, but I've got me a black\n           fan belt.\n                         \n          BEEP! Finn's rearview alarms. His camera has picked up Grem\n          and Acer. They've just entered the lounge, are right around\n          the corner.\n                         \n                          MATER\n           Hey, you wanna see some moves I\n           made up?\n                         \n                          FINN\n           You're being followed.\n                         \n          Finn quickly turns, fires a tiny GLASS CUTTING BEETLE at the\n          window. As Mater talks, oblivious, the beetle cuts out a\n          round hole.\n                         \n                          MATER\n           This first one I can reach into a\n           car's hood, pull out his battery,\n           and show it to him before he\n           stalls. I call it, \"What I\n           accidentally did to my friend Luigi\n           once.\"\n           56.\n                         \n                         \n          Mater does his best (worst) karate moves as Acer and Grem\n          turn the corner.\n                         \n                          GREM\n           There he is!\n                         \n          The glass drops away, leaving a car-sized hole.\n                         \n                          MATER\n           (eyes the clock)\n           Look, I probably ought to go. I'm\n           about to miss my flight.\n                         \n                          FINN\n           Don't worry.\n                         \n          Finn HOOKS Mater from behind. He YANKS HIM forward ---\n                         \n                          FINN\n           I've taken care of that. Hang on.\n                         \n          --- and LEAPS OUT THE WINDOW!\n                         \n          EXT. TARMAC - AIRPORT - JAPAN\n                         \n          Finn pulls Mater down HARD onto the tarmac, towing him away\n          from the terminal.\n                         \n                          MATER\n           This is First Class service. You\n           don't even have to go through the\n           terminal.\n                         \n          ACER and GREM appear, chasing them. Mater, who is facing\n          backward as he is being pulled along, faces them. They're\n          about a hundred yards back.\n                         \n                          MATER\n                          (TO FINN)\n           Your karate partners are back here.\n           They kinda look like they're trying\n           to catch up!\n                         \n                          FINN\n           Drive forward. Whatever you do,\n           don't stop.\n                         \n          Finn SKIDS around, whipping Mater in a 180 so that Mater is\n          now towing Finn.\n                         \n          Grem produces a ROCKET, lines up Finn as his target.\n           57.\n                         \n                         \n          Finn, without hesitation, fires a MINI ROLLING-JACK. The jack\n          DRIVES ITSELF toward Grem, anchors itself under his frame and\n          flips him like a turtle but not before Grem gets the rocket\n                         OFF ---\n                         \n          THE ROCKET - it flies toward Mater and Finn.\n                         \n          FINN aims and launches a MISSILE back.\n                         \n          THE ROCKET AND MISSILE COLLIDE IN MID-AIR, EXPLODE.\n                         \n                          MATER\n           (only hearing this)\n           Is everything okay back there?\n                         \n           SIDDELEY (O.S.)\n           Finn, it's Sid. I'm on approach.\n                         \n          A GULFSTREAM JET wings into view overhead. This is SIDDELEY.\n                         \n                          FINN\n           Roger that.\n                         \n          Mater looks up: ACER screeches into view up ahead, dragging a\n          long row of luggage carts in Mater's path, attempting to\n          create an accident.\n                         \n                          MATER\n                          (TO FINN)\n           You remember that whole thing about\n           me not stopping no matter what?\n                         \n          Just as it looks dire --- RATATATATATATAT!!! SIDDELEY\n          descends, hawklike, fires bullets and blows the luggage carts\n          sky-high. Mater and Finn burst through them, luggage now\n          raining down from above.\n                         \n                          MATER\n           I knew I should've done carry-on!\n                         \n                          FINN\n                          (TO SIDDELEY)\n           Thanks, old boy!\n                         \n          Siddeley LANDS HARD on the tarmac ahead of them. No time to\n          stop, he DROPS his back open, revealing HOLLEY.\n                         \n                          MATER\n           Hey, doggone it. It's my imaginary\n           girlfriend!\n                         \n                          HOLLEY\n           Come on! Get in here!\n           58.\n                         \n                         \n          Mater SPEEDS UP toward Siddeley's ramp, Holley.\n                         \n                          MATER\n                          (TO HOLLEY)\n           Boy I tell you what, you really do\n           want this first date, don't ya?\n           That's a no-quit attitude right\n           there.\n                         \n          Just as Mater's wheels touch the ramp, BULLETS PING around\n          him in a spray. Siddeley is HIT, a tire BLOWN. He yells in\n          pain.\n                         \n                          FINN\n           Hold on, Sid!\n                         \n          Siddeley peels off the runway onto the grass.\n                         \n          A gunfight ensues between Finn and Acer. Finn SHOOTS ACER'S\n          TIRE, blowing it and throwing him off-course.\n                         \n          Acer CAREENS out of control, drives up and THROUGH A JET ---\n                         \n          --- OUT THE OTHER SIDE where he lands in an oil tanker.\n                         \n          ON SIDDELEY - He's headed toward the edge of the tarmac,\n          where the grass and runway meet WATER. He HITS THE GAS, his\n          only hope.\n                         \n                          SIDDELEY\n           Finn, it's now or never!\n                         \n          Finn BRAKES, 180s and grabs the ramp just as Siddeley gets\n          air.\n                         \n                          SIDDELEY\n           Hold on!\n                         \n          Mater, the only thing not in the jet, dangles and recedes\n          from our view as Siddeley climbs toward the clouds. As he's\n          PULLED in through the back hatch:\n                         \n           MATER (V.O.)\n           By the time you read this, I will\n           be safely on an airplane, flying\n           home.\n                         \n          INT. LOBBY - HOTEL - TOKYO - DAY\n                         \n          CLOSE ON a handwritten (er, tire-written?) NOTE in childish\n          scrawl. We don't see all of it, only a bit. Mater's voice\n          O.S. begins the note with the first sentence, but we DISSOLVE\n          into McQueen's voice.\n           59.\n                         \n                         \n                          MCQUEEN\n           \"I'm so sorry for what I did. I\n           don't want to be the cause of you\n           losing any more races. I want you\n           to go prove to the world what I\n           already know - that you are the\n           greatest race car in the whole wide\n           world. Your best friend, Mater.\"\n                         \n          McQueen takes this in.\n                         \n                          MCQUEEN\n           I didn't really want him to leave.\n                         \n                          LUIGI\n           Wait, there's more here.\n                          (READS)\n           \"P.S. Please tell the hotel I\n           didn't mean to order that movie. I\n           thought it was just a preview and I\n           didn't realize I was paying for it.\n           P.P.S... That's funny right there --\n           PP.\"\n           (to the others)\n           There's a few more pages of P.S.'s\n           here.\n                         \n                          MCQUEEN\n                          (TURNING BACK)\n           Well, at least I know if he's at\n           home he'll be safe.\n                         \n          EXT. SKY - DAY\n                         \n          SIDDELEY breaks through some cloud cover, flies with purpose.\n                         \n          INT. JET - DAY\n                         \n          A well-appointed spy jet. Various computers line the walls.\n                         \n                          FINN\n           Now that's how I like to start the\n           day! You never feel more alive than\n           when you're almost dead.\n                         \n                          HOLLEY\n                          (SCANNING MATER)\n           I hope that device didn't fall off.\n                         \n                          MATER\n           That's the closest I ever been to\n           missing my flight! That was ---\n           60.\n                         \n                         \n          With a ROBOTIC ARM, Holley grabs the THE DEVICE that Rod\n          Redline hid under Mater. She yanks it out with a GOOSE.\n                         \n                          MATER\n                          (JUMPS)\n           Yow!\n                         \n                          HOLLEY\n           Still in one piece, great.\n                         \n          Holley drops the device into a mainframe computer. It starts\n          \"ANALYZING.\"\n                         \n                          MATER\n           I gotta go to a doctor. I keep\n           getting these sharp pains in my\n           undercarriage.\n                         \n                          HOLLEY\n           Downloading the photo now.\n                         \n                          MATER\n           Hey, lemme introduce you two.\n                          (TO HOLLEY)\n           This here is Finn McSomething-or-\n           other. He's a First Class VIP\n           airport whatchamacallit. And Finn,\n           this here's my date.\n                          (TO HOLLEY)\n           I never did get your name.\n                         \n                          HOLLEY\n           Oh yes, sorry. It's Shiftwell.\n           Holley Shiftwell.\n                         \n                          MATER\n                          (TO FINN)\n           It's Shiftwell. Holley ---\n                         \n          DING! The computer is done analyzing. The cabin lights dim.\n                         \n                          FINN\n           Finally. Time to see who's behind\n           all this.\n                         \n          AN IMAGE is blasted between the three of them. It's of a\n          photograph, a complicated melange of metallic parts stuck\n          together.\n                         \n                          HOLLEY\n           (to Mater, expectantly)\n           What is this?\n           61.\n                         \n                         \n                          MATER\n           Well, that's one of the worst\n           engines ever made. It's an old\n           aluminum V8 with a Lucas electrical\n           system and Whitworth bolts. Shoot,\n           them Whitworth bolts is a pain,\n           tell you what. Them ain't metric,\n           they ain't inches...\n                         \n                          HOLLEY\n           Yes, OK, right. But who's engine is\n           this, Mater?\n                         \n                          MATER\n           Well, it's kinda hard to tell from\n           this picture, ain't it?\n                         \n                          HOLLEY\n           But you're the one who took it.\n                         \n                          FINN\n           Holley.\n                         \n                          HOLLEY\n           Oh, right. Yes, of course. \"A good\n           agent gets what he can, then gets\n           out before he's killed.\" Sorry.\n                         \n                          MATER\n           Agent? You mean like insurance\n           agent, like,\n                          (SINGS)\n           `Like a good neighbor, Mater is\n           there'? Wait, you mean secret\n           agents. You guys is spies!\n                         \n                          FINN\n           Holley, in how many makes and\n           models did this type of engine\n           appear?\n                         \n          Holley has these stats in seconds. Kid's play.\n                         \n                          HOLLEY\n           It was standard in seven models\n           over a 12-year period. At least\n           35,000 cars were made with this\n           engine.\n                         \n          Mater MOVES HIS SEAT FORWARD, through one part of the\n          hologram so he's face-to-face with Holley.\n                         \n                          MATER\n           You're pretty.\n           62.\n                         \n                         \n                          HOLLEY\n                          (ANNOYED)\n           Yes, alright. Thank you.\n                         \n                          MATER\n           And so nice.\n                         \n                          HOLLEY\n           Just pay attention.\n                         \n          She moves the engine photo so it's now blocking Mater again.\n                         \n                          FINN\n           This seems like a dead end. If\n           there were something in the photo\n           that could narrow this down a bit\n           I'd be a lot happier.\n                         \n                          MATER\n           You might not be happy, but I bet\n           this feller is. See how he's had\n           most of his parts replaced? And see\n           all them boxes over there? Them's\n           all original parts. They ain't easy\n           to come by.\n                         \n                          HOLLEY\n           Rare parts.\n                         \n                          FINN\n           That's something we can track.\n                         \n                          HOLLEY\n           Exactly!\n                         \n          Holley drops her screen down.\n                         \n                          FINN\n           Well done, Mater! I would never\n           have seen that.\n                          (TO HOLLEY)\n           I know of a black-market parts\n           dealer in Paris, a treacherous\n           lowlife. But, he's the only car in\n           the world who can tell us whose\n           engine this is. Mater, what would\n           you say to setting up an informal\n           task force on this one?\n                         \n                          MATER\n           Wait, what?\n           63.\n                         \n                         \n                          FINN\n           You obviously have plenty of\n           experience in the field.\n                         \n                          MATER\n           Well yeah I live right next to one.\n           (thinks about it)\n           I don't know, Finn. I ain't exactly\n           been much help to anybody recently.\n                         \n                          FINN\n           You're helping me. Please, Mater.\n                         \n                          MATER\n           Well, okay. But you know I'm just a\n           tow truck, right?\n                         \n                          FINN\n           Right. And I'm just in the\n           import/export business. Siddeley?\n                         \n                          SIDDELEY\n           Yes, Finn?\n                         \n                          FINN\n           Paris. Tout de suite.\n                         \n                          MATER\n           Yeah, two of them sweets for me\n           too, Sid!\n                          (TO HOLLEY)\n           You know, I always wanted to be a\n           spy.\n                         \n                          HOLLEY\n                          (SMILING SWEETLY)\n           Really? Me too.\n                         \n                          SIDDELEY\n           Afterburners, sir?\n                         \n                          FINN\n           Is there any other way?\n                         \n          EXT. JET - MOVING\n                         \n          Siddeley HITS THE JUICE, they kick forward like a mule as we\n          CUT TO ---\n                         \n          A MONTAGE OF PARIS: Mater attempts to merge into roundabout\n          traffic": null, " mimes annoy tourists at the Eiffel Tower": null, " a painter\n          works his magic on an unattractive couple": null, " a couple kisses on\n          the most romantic spot in the world": null, " we might even catch\n          GASTOW'S RESTAURANT.\n           64.\n                         \n                         \n          The charming, low-key introduction ends with a SWEEPING VISTA\n          of Paris's center from far away as we CRANE DOWN INTO ---\n                         \n          EXT. STREET - DAY\n                         \n          --- a dirty street in the 1st Arrondissement. Finn and Holley\n          drive along together as Mater, playing \"spy,\" darts back and\n          forth behind them from doorway to dumpster, \"hiding out.\"\n          He's having a ball.\n                         \n                          FINN\n                          (TO HOLLEY)\n           Once we're inside, stay close.\n           Don't bother checking VIN numbers\n           for criminal records, they're all\n           dodgy here.\n                         \n                          HOLLEY\n           No VIN scans. Got it.\n                         \n                          FINN\n           Don't talk to anyone. Don't look at\n           anyone. And absolutely, positively\n           no idling. Are we clear?\n                         \n                          HOLLEY\n           Yes, right. No idling. Yes, sir.\n                         \n                          FINN\n           Mater?\n                         \n                          MATER\n           Yeah, Finn?\n                         \n                          FINN\n           We're not here to go shopping.\n                         \n          As Finn and Holley and Mater turn the corner...\n                         \n                          MATER\n           Shopping? What do you mean? Why\n           would I ---\n                         \n          Mater turns the corner and enters a massive Les Halles-\n          inspired Parisian market filled with car parts. A tow truck's\n          dream.\n                         \n                          MATER\n           Dadgum.\n                         \n                          MERCHANTS\n           - Parts for sale, Monsieur!\n           - Monsieur! Parts for sale!\n           65.\n                         \n                         \n          IN THE MARKET - MOMENTS LATER\n                         \n          Mater rolls along, impressed by the goods for sale.\n                         \n                          MATER\n           You gotta be kidding me - they've\n           got everything here. Look at them\n           hoods! I could use a hood.\n                         \n          Mater continues on though, heeding Finn's advice.\n                         \n                          MATER\n           Sorry fellers, I gotta go.\n                         \n          INT. ENCLOSED MARKETPLACE - DAY\n                         \n          Mater, now out of sight of Finn and Holley, passes a darkened\n          stall. He STOPS, peers in. There's someone in there.\n                         \n                          MATER\n           Excuse me. What are you selling?\n                         \n          It suddenly OPENS its headlights revealing... EYES!! In\n          French, the mutant car pitches his wares to Mater. Mater\n          FREAKS OUT, speeds off, TERRIFIED.\n                         \n          AROUND THE CORNER - FINN AND HOLLEY\n                         \n          A few car lengths ahead of Mater. They roll along, looking\n          for... Aha! Finn and Holley recede into the shadows.\n                         \n          In FINN'S SIDE MIRROR: TOMBER, a three-wheeled parts dealer,\n          argues with a French customer.\n                         \n                          FINN\n           There you are.\n                         \n          Mater suddenly turns the corner, sees Finn and Holley.\n                         \n                          MATER\n           Man, there are some great ---\n                         \n                          FINN\n           Mater, get back!\n                         \n          Too late. Tomber sees Mater, then notices FINN, reflected in\n          a hubcap. He BOLTS. Finn and Holley give chase.\n                         \n                          MATER\n           Hey, wait for me!\n                         \n          Tomber, skidding away, kicks a tent in Finn's way. Holley\n          quickly pivots RIGHT and disappears. Where did she go?\n           66.\n                         \n                         \n          Finn, hot in pursuit, leaps another obstacle and loses ground\n                         TO ---\n                         \n          --- Tomber who turns a corner and finds himself grill to\n          grill with HOLLEY. He whips to the left but TURNS OVER,\n          rolling sideways and CRASHING to a stop.\n                         \n          Holley ZAPS him with ELECTROSHOCKERS. Finn suddenly arrives,\n          stops her.\n                         \n                          FINN\n                          (TO HOLLEY)\n           Have you lost your mind?!\n                         \n                          HOLLEY\n           But I thought ---\n                         \n                          FINN\n           Mater! This chap needs a tow. Hook\n           him up.\n                         \n                          MATER\n           Sure thing.\n                          CUT TO:\n                         \n          MOMENTS LATER - Mater tows Tomber, following Finn and Holley.\n                         \n                          TOMBER\n           You rusty piece of junk, get your\n           dirty hook off me!\n                         \n          INT. A SMALL GARAGE - MOMENTS LATER\n                         \n          Finn throws open a door. Cars scatter like cockroaches.\n                         \n                          FINN\n           (to the cars)\n           Allez! Maintenant - vite!\n                         \n          Mater unhooks an angry Tomber who spits in French. Finn pulls\n          the door down. As it LATCHES TIGHT ---\n                         \n                          TOMBER\n                          (TO FINN)\n           Electroshock! Are you kidding me??\n                         \n                          FINN\n           Easy, Tomber. This is her first\n           field assignment - she didn't know\n           you were my informant.\n                         \n                          HOLLEY\n           Informant?\n           67.\n                         \n                         \n                          TOMBER\n           A rookie, eh? I never liked new car-\n           smell.\n                         \n          Holley FUMES with anger.\n                         \n                          FINN\n           Tomber was doing 20 to life in a\n           Moroccan impound the first time I\n           saved him, if I recall correctly.\n                         \n                          TOMBER\n           Speaking of recalls, you're getting\n           up there in mileage aren't you,\n           Finn?\n                         \n                          HOLLEY\n           Alright, we get it. You both know\n           each other, you're both old. So.\n                         \n          Holley shoots a HOLOGRAPHIC PHOTO of the engine in front of\n          Tomber.\n                         \n                          HOLLEY\n           There you go, informant. Inform us.\n                         \n          Tomber eyes the photo. He recoils, unimpressed.\n                         \n                          TOMBER\n           That is the worst motor ever made.\n                         \n          Suddenly, Tomber narrows his gaze.\n                         \n                          TOMBER\n           Wait. That oil filter... those\n           wheel bearings.\n                         \n                          FINN\n           Do those parts look familiar,\n           Tomber?\n                         \n                          TOMBER\n           They should. I sold them.\n                         \n                          HOLLEY\n           To whom?\n                         \n                          TOMBER\n           No idea. He's my best customer, but\n           he always does his business over\n           the phone. I was always wondering\n           why he needs so many parts. Now I\n           know.\n           68.\n                         \n                         \n                          MATER\n           Well, a lemon needs parts. Ain't\n           nothing truer than that.\n                         \n                          FINN\n           \"Lemon?\"\n                         \n                          MATER\n           Yeah, you know. Cars that don't\n           ever work right. Lemons is a tow\n           truck's bread and butter. Like them\n           Gremlins and Pacers we run into at\n           the party and the race and the\n           airport.\n                         \n                          FINN\n           Holley, pull up the pictures from\n           the oil platform. I want to know\n           what other type of cars were out\n           there.\n                         \n          Holley complies and suddenly PHOTOS OF CARS FROM THE OIL\n          PLATFORM hang suspended in the air in front of them.\n                         \n                          HOLLEY\n           Right. Let's see. There were Hugos.\n           And Trunkovs.\n                         \n                          FINN\n           Mater, are these cars considered\n           lemons?\n                         \n                          MATER\n           Is the Popemobile Catholic?\n                         \n                          HOLLEY\n           Finn. Everyone involved in this\n           plot is one of history's biggest\n           loser cars.\n                         \n          Holley refers to the ENGINE PHOTO, which now rises forward as\n          the prominent picture, perhaps the only one in view.\n                         \n                          FINN\n           And they're all taking their orders\n           from the car behind this engine.\n                         \n                          TOMBER\n           This explains it!\n                         \n                          FINN\n           What, Tomber?\n           69.\n                         \n                         \n                          TOMBER\n           Gremlin, Pacer, Hugo and Trunkovs\n           never get together. But they're\n           having a secret meeting in two\n           days.\n                         \n                          FINN\n           Where's this meeting taking place?\n                         \n                          TOMBER\n           Porto Corsa, Italy.\n                         \n                          MATER\n           That's where the next race is!\n                         \n                          FINN\n           Then there's a good chance our\n           mystery engine will be there too.\n                         \n                          TOMBER\n           Your chances are more than good. I\n           just sent him a new clutch assembly\n           yesterday... to Porto Corsa.\n                         \n                          FINN\n           Holley, contact Stephenson and have\n           him meet us at Gare de Lyon. Good\n           work.\n                         \n          EXT. FRENCH ALPS - NIGHT\n                         \n          STEPHENSON, a THREE-CAR LUXURY BULLET TRAIN speeds along a\n          snow-covered mountain in the dead of night, its halogen\n          headlight cutting through the darkness. It DIPS into a\n                         TUNNEL ---\n                         \n           MATER (O.S.)\n           Boy, I'll tell you what. That three-\n           wheeled feller had to be right\n           about a big meeting.\n                         \n          INT. SPY CAR - MOVING - NIGHT\n                         \n          Mater, Finn and Holley scroll through surveillance-style\n          photos of TRAFFIC on an Italian street. They're in the front\n          train car, which doubles as a luxury seating area and\n          intelligence command center.\n                         \n                          MATER\n           You never see this many lemons in\n           one town. Unless there's a swap\n           meet, or something.\n                          (TO HOLLEY)\n                          (MORE)\n           70.\n                         \n                          MATER (CONT'D)\n           Hey, how'd you get all them\n           pictures?\n                         \n                          HOLLEY\n           Well, I remotely reprogrammed Porto\n           Corsa's red light cameras to do\n           recognition scans.\n                         \n                          MATER\n           Wow, not only is you the prettiest\n           car I ever met, but you the\n           smartest too.\n                         \n                          HOLLEY\n           Thank you. I think.\n                         \n                          MATER\n           That's a familiar sight.\n                         \n          Mater refers to a photo of VICTOR HUGO, the HUGO Lemonhead,\n          being towed by an EASTERN EUROPEAN TOW TRUCK.\n                         \n                          MATER\n           A Hugo being towed. But he looks\n           absolutely perfect.\n                         \n                          FINN\n           Of course. They must be the heads\n           of the lemon families.\n                         \n                          MATER\n           Makes sense. If I was rich and\n           broke down every day, I'd hire me\n           to tow me around all the time too.\n                         \n                          FINN\n           We've got to infiltrate that\n           meeting. It's the only way to find\n           out who's behind all this.\n                         \n                          HOLLEY\n                          (EYEING MATER)\n           Hang on a minute.\n                         \n                          MATER\n           What?\n                         \n                          HOLLEY\n           Hold still.\n                         \n          Holley SNAPS Mater's picture, temporarily blinding him.\n                         \n                          MATER\n           Ahh!\n           71.\n                         \n                         \n          Holley turns back to her monitor. Mater's face appears on\n          screen. She quickly GRAFTS it over the Hugo's tow truck's.\n                         \n                          FINN\n           Good job, Miss Shiftwell.\n                         \n          Holley isn't sure what surprises her more: the compliment or\n          how pleased it makes her.\n                         \n                          HOLLEY\n           Thank you, Finn.\n                         \n                          MATER\n           Boy, I sure wish my friends could\n           see me now.\n                         \n          EXT. SMALL TOWN - ITALY - OUTSIDE PORTO CORSA - DAY\n                         \n          A quaint Italian piazza. A pristine MASERATI FOUNTAIN,\n          complete with ancient trident, looms in our view.\n                         \n          Luigi and Guido roll into view.\n                         \n                          LUIGI\n           Guido, your eyes do not deceive\n           you. We are in Italy. We are home!\n                         \n          Sarge, Fillmore and McQueen exit a WGP transport truck.\n                         \n                          FILLMORE\n           Hey, Luigi. Which way to the hotel,\n           man?\n                         \n                          LUIGI\n           What? No friends of mine will stay\n           in a hotel in my village. You will\n           stay with my --- Uncle Topolino!\n                         \n          UNCLE TOPOLINO, a distinguished 1937 Fiat Topolino, rolls\n          forward. He greets them warmly with affectionate Italian\n          salutations as word of Guido and Luigi's arrival spreads. The\n          square FILLS with family and friends.\n                         \n          EXT. PIAZZA - DUSK\n                         \n          A festive homecoming party. Lights strung across the square.\n          Music and dancing. Fillmore and Sarge are at a dining table.\n                         \n                          SARGE\n           How do they do it? These are the\n           same ingredients as back home, but\n           it tastes so good.\n           72.\n                         \n                         \n                          FILLMORE\n           It's organic, man.\n                         \n                          SARGE\n           Tree hugger.\n                         \n          LIGHTNING MCQUEEN rolls along the periphery of the square,\n          seems lost in thought.\n                         \n           UNCLE TOPOLINO (O.S.)\n           Race car.\n                         \n          Uncle Topolino beckons McQueen over.\n                         \n                          UNCLE TOPOLINO\n           You look so down, so low. Is like\n           you have flat tires.\n                         \n          MAMA TOPOLINO, a hefty Italian grandmother pipes up, a mile a\n          minute then drives off, now a car on a mission.\n                         \n                          UNCLE TOPOLINO\n           She said you look like you're\n           starving. That she's going to make\n           you a big meal, and fatten you up.\n                         \n                          MCQUEEN\n           No, Mama Topolino, please. You\n           don't need to make a fuss!\n                         \n          Too late. She's disappeared inside her kitchen.\n                         \n                          UNCLE TOPOLINO\n           Capisco. I understand. Is a\n           problem, yes? Between you and a\n           friend?\n                         \n                          MCQUEEN\n           How'd you know that?\n                         \n                          UNCLE TOPOLINO\n           A wise car hears one word and\n           understands two.\n                         \n          McQueen takes this in, impressed.\n                         \n                          UNCLE TOPOLINO\n           That, and Luigi told me. While Mama\n           cooks, come and take a stroll with\n           me.\n                         \n          They amble forward, Uncle Topolino setting the pace.\n           73.\n                         \n                         \n                          MCQUEEN\n           I brought my friend Mater along on\n           the trip. And I told him he needed\n           to act different, that we weren't\n           in Radiator Springs.\n                         \n                          UNCLE TOPOLINO\n           This Mater. He's a close friend?\n                         \n                          MCQUEEN\n           He's my best friend.\n                         \n                          UNCLE TOPOLINO\n           Then why would you ask him to be\n           someone else?\n                         \n          McQueen considers this - a realization.\n                         \n                          MCQUEEN\n           What did I do? I said some things\n           during our fight...\n                         \n                          UNCLE TOPOLINO\n           You know, back when Guido and Luigi\n           used to work for me, they would\n           fight over everything.\n                         \n          IN THE SQUARE - Guido dances with a girl. Luigi suddenly CUTS\n          IN. They begin to ARGUE.\n                         \n                          UNCLE TOPOLINO\n           They fight over what Ferrari was\n           the best Ferrari": null, " which one of\n           them look more like a Ferrari...\n           There were even some non-Ferrari\n           fights.\n                         \n          Guido now LIFTS Luigi, cuts BACK in.\n                         \n                          UNCLE TOPOLINO\n           So I tell them, va bene. It's okay\n           to fight. Everybody fights now and\n           then, especially best friends.\n                         \n          McQueen takes this in. Seems to take some small comfort.\n                         \n                          UNCLE TOPOLINO\n           But you gotta make up fast.\n                         \n          McQueen's comfort quickly evaporates.\n                         \n                          UNCLE TOPOLINO\n           No fight more important than\n           friendship.\n           74.\n                         \n                         \n          Guido and Luigi now dance together with the girl and her\n          friend who has just arrived. All having a great time. They\n          dance past us, crossing in front of MCQUEEN AND UNCLE\n          TOPOLINO. We STAY WITH them.\n                         \n                          UNCLE TOPOLINO\n           Chi trova un'amico, trova un\n           tesoro.\n                         \n                          MCQUEEN\n           What does that mean?\n                         \n                          MAMA TOPOLINO\n                          (ARRIVING)\n           Whoever find a friend, find a\n           treasure.\n                         \n          Mama Topolino drops a tray of food in front of McQueen.\n                         \n                          MAMA TOPOLINO\n           Now, mangia! Eat!\n                         \n          ON MCQUEEN, distant, taking all of this in, lost in thought\n          as, in the background, Uncle Topolino and Mama Topolino talk,\n          then argue, then make up (all in Italian) all while we stay\n          on McQueen's pensive face ---\n                         \n          INT. TRAIN TUNNEL - LATER\n                         \n          Stephenson glides along, all business.\n                         \n                          STEPHENSON\n           Finn, one hour to Porto Corsa.\n                         \n          INT. TRAIN - MOVING - LATER\n                         \n                          FINN\n           Thank you, Stephenson.\n                         \n          Finn watches as HOLLEY attaches a new EMERGENCY LIGHT on\n          Mater's roof. It looks exactly like his old one.\n                         \n                          HOLLEY\n           That should just about do it.\n                         \n                          FINN\n           Perfect.\n                         \n                          HOLLEY\n           So Mater, it's voice-activated. But\n           you know, everything's voice-\n           activated these days.\n           75.\n                         \n                         \n                          MATER\n           What? I thought you was supposed to\n           be making me a disguise.\n                         \n                          MATER'S COMPUTER\n           Voice recognized. Disguise Program\n           Initiated.\n                         \n          ZWWWWAT! A HOLOGRAPHIC disguise suddenly umbrellas out,\n          emitted from Mater's roof. It drops a clean cloaking image of\n          the EASTERN EUROPEAN TOW TRUCK over Mater.\n                         \n                          MATER\n           Cool! Hey, computer. Make me a\n           German truck!\n                         \n                          MATER'S COMPUTER\n           Request acknowledged.\n                         \n          ZWATTTT! Mater suddenly wears lederhosen and a German hat.\n                         \n                          MATER\n           Check it out. I'm wearing\n           Materhosen. Make me a monster\n           truck!\n                         \n                          MATER'S COMPUTER\n           Request acknowledged.\n                         \n          He's transformed into Dracula, complete with fangs.\n                         \n                          MATER\n                          (ALA DRACULA)\n           I vant to siphon your gas. Now make\n           me a taco truck!\n                         \n                          MATER'S COMPUTER\n           Request acknowledged.\n                         \n                          MATER\n           A funny car!\n                         \n                          MATER'S COMPUTER\n           Request acknowledged.\n                         \n          Finn suddenly pushes a button, stops the madness.\n                         \n                          FINN\n           The idea is to keep a low profile,\n           Mater.\n                         \n          Mater, chastened, moves on.\n           76.\n                         \n                         \n                          MATER\n           So I just go in, pretend to be this\n           truck.\n                         \n                          FINN\n           And leave the rest to us.\n                         \n                          HOLLEY\n           Now hold still.\n                         \n          Holley turns back to her work. The disguise's cloaking is\n          larger than Mater. As a result, Holley must dial it back to\n          fit his body. As she carefully calibrates the hologram:\n                         \n                          HOLLEY\n           I have to do the final fitting on\n           your disguise.\n                         \n          Holley STOPS. The 3D disguise is now flush with his frame,\n          but dents SHOW THROUGH.\n                         \n                          HOLLEY\n           Oh dear. That's no good.\n                         \n          She deploys A BONDO SPRAYER on a robotic arm, moves it toward\n          one of Mater's DENTS. Mater pulls away.\n                         \n                          MATER\n           Hey, what are you doing?\n                         \n                          HOLLEY\n           The disguise won't calibrate\n           effectively without a smooth\n           surface to graft onto.\n                         \n                          MATER\n           Oh. For a second there I thought\n           you was trying to fix my dents.\n                         \n                          HOLLEY\n           I was.\n                         \n                          MATER\n           Well then no thank you. I don't get\n           them dents buffed, pulled, filled\n           or painted by nobody. They're way\n           too valuable.\n                         \n                          HOLLEY\n           Your dents are valuable?\n                         \n                          MATER\n           I come by each one of them with my\n           best friend Lightning McQueen.\n                          (MORE)\n           77.\n                         \n                          MATER (CONT'D)\n           I don't fix these. I want to\n           remember these dents forever.\n                         \n                          HOLLEY\n           So you were being serious in Paris?\n           McQueen isn't just part of your\n           cover?\n                         \n                          FINN\n           Friendships can be dangerous in our\n           line of work, Mater.\n                         \n                          MATER\n           But my line of work is towing and\n           salvage.\n                         \n                          FINN\n           Right. And Miss Shiftwell's is\n           designing iPhone apps.\n                         \n                          MATER\n           No, I meant for real. I ---\n                         \n                          HOLLEY\n           It's okay. Say no more. I'll work\n           around the dent.\n                         \n                          FINN\n           In the meantime...\n                         \n          Finn hits a button. The walls transform into a MASSIVE\n          WEAPONS CACHE.\n                         \n                          FINN\n           You look a little light on weapons.\n                         \n          Off Mater's RXN ---\n                         \n          EXT. ALPS - DAWN\n                         \n          --- STEPHENSON EMERGES LOUDLY from a tunnel. He powers\n          forward, starts his descent into Italy ---\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           You are looking live at beautiful\n           Porto Corsa, Italy, on the Italian\n           Riviera. What a magnificent setting\n           for the second race of the World\n           Grand Prix.\n                         \n          EXT. PORTO CORSA, ITALY - DAY\n                         \n          Over sweeping helicopter BEAUTY SHOTS:\n           78.\n                         \n                         \n           DAVID HOBBSCAP (V.O.)\n           Well Brent, they call this place\n           \"The Gem of the Riviera,\" and it's\n           easy to see why.\n                         \n          A local fishing boat chugs through an idyllic waterway,\n          beneath bridges that connect hillside villas.\n                         \n           DAVID HOBBSCAP (V.O.)\n           With its secluded beaches and\n           opulent casinos, Porto Corsa truly\n           is a playground for the wealthy.\n                         \n          A long line of RICH-LOOKING YACHTS in the harbor.\n                         \n           DAVID HOBBSCAP (V.O.)\n           And everyone who's anyone is here\n           today.\n                         \n          Rich SPORTS CARS drive past pricey shops.\n                         \n           DAVID HOBBSCAP (V.O.)\n           From the ultra-rich and super-\n           famous, to world leaders and\n           important dignitaries.\n                         \n          THE POPEMOBILE, visible in a crowd, drives through town.\n                         \n           DARRELL CARTRIP (V.O.)\n           You aren't kidding, David. You\n           can't do a three-point turn around\n           here without bumping into some\n           celebrity!\n                         \n          HELICOPTER SHOT of the Casino.\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           Welcome everyone to the second race\n           of the World Grand Prix!\n                          CUT TO:\n                         \n          MUSTANGBURGER, HOBBSCAP and CARTRIP in the control booth.\n                         \n                          BRENT MUSTANGBURGER\n           The big news continues to be\n           Allinol. Sir Miles Axlerod spoke to\n           the press earlier today to answer\n           questions about its safety.\n                         \n          FOOTAGE OF THE PRESS CONFERENCE - Miles Axlerod, at a podium,\n          addresses the press throng. He looks a bit exasperated.\n           79.\n                         \n                         \n                          MILES AXLEROD\n           An independent panel of scientists\n           has determined that Allinol is\n           completely safe. Okay? Safe! There\n           it is.\n                         \n                          BRENT MUSTANGBURGER\n           So the race will go on, folks.\n                         \n          RACE GRAPHICS show Francesco with 10 points at the top of the\n          race standings.\n                         \n                          DARRELL CARTRIP\n           But the question everyone is\n           asking: Will the real Lightning\n           McQueen show up today?\n                         \n          ON THE TRACK - As the racers begin to get into position on\n          the grid.\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           Well, he better. Talk about a home-\n           track advantage. Francesco\n           Bernoulli grew up racing on this\n           course.\n                         \n           ITALIAN TRACK ANNOUNCER (V.O.)\n           Signore e signori, in the pole\n           position, numero uno...\n                         \n          The crowd is cheering already, knows who this is.\n                         \n           ITALIAN TRACK ANNOUNCER (V.O.)\n           ... Francescoooooo!\n                         \n          The Italian crowd roars and chants for their hometown hero.\n                         \n                          FRANCESCO\n           (to the crowd)\n           Bellissima! Thank you for your\n           support.\n                          (TO MCQUEEN)\n           And your big mistake, McQueen!\n                         \n          McQueen missed this comment. He approaches his grid position,\n          lost in thought.\n                         \n           ITALIAN TRACK ANNOUNCER (V.O.)\n           In the secondo position. Numero\n           novantacinque. Lightning McQueen!\n                         \n          Cheers (not so thunderous, obviously) from the crowd. McQueen\n          doesn't seem to notice.\n           80.\n                         \n                         \n          IN MCQUEEN'S PIT - His team exchanges looks, worried.\n                         \n                          LUIGI\n           McQueen? Is everything okay?\n                         \n                          FILLMORE\n           If you're worried about your fuel,\n           man, don't. It's perfectly safe.\n                         \n          BACK ON THE STARTING GRID\n                         \n                          MCQUEEN\n           No, guys, I just really wish Mater\n           were here.\n                         \n           FRANCESCO (O.S.)\n           Francesco understands, McQueen.\n                         \n          Francesco parks next to him, grinning.\n                         \n                          MCQUEEN\n           Oh, great. Here it comes. What've\n           you got, Francesco?\n                         \n                          FRANCESCO\n           For famous race cars like Francesco\n           and well... you, to be far away\n           from home is not easy.\n                         \n                          MCQUEEN\n           I think you forgot the insulting\n           part of that insult.\n                         \n                          FRANCESCO\n           Is no insult. When Francesco is\n           away from home, he misses his mama\n           just like you miss your tow truck\n           amico.\n                         \n                          MCQUEEN\n           Gee, I maybe misjudged you, because\n           that's exactly how I ---\n                         \n                          FRANCESCO\n           Of course, I am at home. And my\n           mama is right here.\n                         \n          Francesco refers to his MAMA who sits in a special box in the\n          crowd, cheering him on, blowing him kisses.\n                         \n                          FRANCESCO\n                          (YELLS)\n           Mama! Don't worry, Mama!\n                          (MORE)\n           81.\n                         \n                          FRANCESCO (CONT'D)\n           McQueen is very sad! I will beat\n           his cry-baby bottom today!\n                         \n                          MCQUEEN\n           And there's the insult we were\n           missing. Grazie!\n                         \n          THE LIGHTS - CLICK FROM RED TO GREEN ---\n                         \n          THE RACERS TAKE OFF!\n                         \n          EXT. PORTO CORSA - DAY\n                         \n          SHOTS of the racers making the first few turns through the\n          city streets. We PAN to the CASINO DI PORTO CORSA. The Beaux\n          Arts-style architecture towers atop a hill, overlooks the\n          course.\n                         \n          EXT. THE CASINO - MOMENTS LATER\n                         \n          A group of thuggish HUGOS - ugly Eastern European cars - wait\n          impatiently at the front. A LIMOUSINE-STYLE car carrier rolls\n          up to the roundabout.\n                         \n          An esteemed, elderly GREMLIN rolls past with a group of\n          GREMLIN THUGS who usher him into the casino.\n                         \n                          ALEXANDER HUGO\n           Gremlins. Man, those are some ugly\n           cars. Look like someone stole their\n           trunks.\n                         \n          The THUGS all SNICKER.\n                         \n                          HOLLEY\n           Scusatemi, tutti! Signori!\n                         \n          Holley arrives, sporting a decent Italian accent.\n                         \n                          HOLLEY\n           Mio nonno, my grandfather, has\n           broken down. If one of you would\n           help I would be so thankful.\n                         \n          IVAN, AN EASTERN EUROPEAN TOW TRUCK (the one Holley and Finn\n          prepped Mater to impersonate), drives forward.\n                         \n           IVAN THE TOW TRUCK\n           Sounds like you need some \"roadside\n           assistance\".\n                         \n                          ANOTHER HUGO\n           She was talking to me, Ivan.\n           82.\n                         \n                         \n           IVAN THE TOW TRUCK\n           Oh really? Prove it.\n                         \n                          HOLLEY\n           No, no, don't fight over me.\n                         \n          Holley directs her interest toward Ivan.\n                         \n                          HOLLEY\n           Signore Tow Truck, per favore?\n                          CUT TO:\n                         \n          MATER - He watches this from a safe hiding spot around a\n          corner.\n                         \n           FINN (V.O.)\n           Get ready, Mater.\n                          CUT TO:\n                         \n          FINN, at an outdoor cafe on the casino grounds.\n                         \n                          FINN\n           You're on any moment now.\n           CUT BACK TO:\n                         \n          MATER, now looking a bit nervous. He backs out of sight.\n                         \n                          MATER\n           I don't know about this, Finn.\n           What if I screw things up?\n                         \n           FINN (OVER RADIO)\n           Impossible. Just apply the same\n           level of dedication you've been\n           using to play the \"idiot tow truck\"\n           and you'll be fine.\n                         \n                          MATER\n           It's just that them guys look\n           pretty tough and --- Wait, did you\n           say \"idiot\"? Is that how you see\n           me?\n                         \n           FINN (OVER RADIO)\n           That's how everyone sees you. Isn't\n           that the idea? I tell you, that's\n           the genius of it. No one realizes\n           they're being fooled because\n           they're too busy laughing at the\n           fool. Brilliant.\n                         \n          While Finn talks, Mater takes this in. He catches his own\n          reflection in a nearby window. Seems to be seeing himself\n          with new eyes.\n           83.\n                         \n                         \n          ZZZZATTT! Mater jumps at the sound, turns in time to see Ivan\n          SHOCKED UNCONSCIOUS by Holley's ZAPPERS.\n                         \n                          HOLLEY\n           Why aren't you in disguise?\n                         \n                          MATER\n           I, uh---\n                         \n                          HOLLEY\n           Come on, there's no time. Go!\n                         \n                          MATER\n           Okay, okay. Computer: disguise.\n                         \n                          MATER'S COMPUTER\n           Request acknowledged.\n                         \n          EXT. AROUND THE NEXT CORNER - CONTINUOUS\n                         \n          Mater, now disguised as Ivan the Tow Truck, approaches the\n          Hugos. Another LIMO CAR CARRIER arrives.\n                         \n                          ALEXANDER HUGO\n           It's the boss! He is coming!\n                         \n          The carrier parks and the back opens. VICTOR HUGO waits.\n                         \n                          VICTOR HUGO\n           Ivan!\n                         \n          Mater realizes Victor is talking to him. He hops to it.\n                         \n                          VICTOR HUGO\n           Ivan, why do you insult me so by\n           making me wait?\n                         \n          Mater, now with Victor hooked, tows him in the front doors of\n          the casino.\n                         \n          ON FINN - now joined in the cafe by Holley who monitors\n          everything and SEES EVERYTHING MATER SEES on her display.\n                         \n                          HOLLEY\n           He's in.\n                         \n          EXT. RACE COURSE - PORTO CORSA - DAY\n                         \n          McQueen and Francesco battle for first place ---\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           The racers are now making their way\n           around the hairpin, and headed\n           downhill toward the casino bridge.\n           84.\n                         \n                         \n          INT. CASINO - DAY\n                         \n          Cars play craps with FUZZY DICE": null, " slot machines with odometers\n          for jackpot numbers": null, " cigarette girls sell car items.\n                         \n           CIGARETTE GIRL CAR\n           Air Freshener, antenna balls,\n           sparkplugs...\n                         \n          ON MATER - He tows VICTOR. They are flanked on all four\n          corners by Hugo thugs, ala a presidential motorcade. The\n          largess of the interior design seems to finally snap Mater\n          out of his funk.\n                         \n                          MATER\n                          (WIDE-EYED)\n           Wow, this place looks like it's\n           made out of gold.\n                         \n          The Hugos on either side of Mater exchange a look.\n                         \n           HOLLEY (OVER RADIO)\n           That's because it is, Mater. Now,\n           be careful what you say.\n                         \n                          MATER\n           Why is that? What do you mean don't\n           talk to you?\n           (more talking from Holley\n           which we cannot hear)\n           So you want me to stop talking to\n           you. Right now?\n                         \n                          ALEXANDER HUGO\n           You are acting strange today, Ivan.\n                         \n                          MATER\n           I have no idea what you're talking\n           about...\n                         \n          MATER'S P.O.V. - A digital readout isolates the Hugo and\n          starts to scroll reams of information alongside.\n                         \n                          MATER\n           ...Alexander Hugo, aka \"Chop Shop\n           Alex.\"\n                         \n          IN A WIDER SHOT we realize this display is invisible to all\n          but Mater. Some of Alex's other alias' include \"Alexander Hu-\n          Don't Go\" and \"Alexander the Not-So Great.\"\n           85.\n                         \n                         \n                          MATER\n           Hey, you got a lot of aka's, Alex.\n           But I guess that makes sense\n           seeings how you's wanted in France,\n           Germany, the Czech Republic...\n                         \n                          HOLLEY\n           (cutting in to his\n                          DISPLAY)\n           Mater! Stop it!\n                         \n          Alexander Hugo, unaware of Holley's interruption, whispers to\n          Mater as they turn a corner.\n                         \n                          ALEXANDER HUGO\n           Okay, okay. Keep your voice down.\n           You're gonna make me arrested.\n           (to the other Hugos)\n           Don't mess with Ivan today. He's in\n           a bad mood.\n                         \n          EXT. CASINO - DAY\n                         \n          Holley, hearing this, can't believe it.\n                         \n                          FINN\n           He's so good.\n                         \n          INT. CASINO - DAY\n                         \n          Mater tows Victor inside a private room, where inside are the\n          WORLD'S WORST CARS including VLADMIR TRUNKOV, TUBBS PACER and\n          J. CURBY GREMLIN.\n                         \n                          VLADIMIR TRUNKOV\n           Victor!\n                         \n                          TUBBS PACER\n           Hey, Victor!\n                         \n           J. CURBY GREMLIN\n           There you are.\n                         \n                          VLADIMIR TRUNKOV\n           Come in, come in.\n                         \n           J. CURBY GREMLIN\n           Victor Hugo. I'm J. Curby Gremlin,\n           from Detroit. It's good to see you.\n           Now we can start.\n                         \n                          VICTOR HUGO\n           Is the big boss here yet?\n           86.\n                         \n                         \n                          VLADIMIR TRUNKOV\n           No, not yet.\n                         \n                          TUBBS PACER\n           He's supposed to be here any\n           minute.\n                         \n          WHAM! A DOOR is thrown open O.S. Everyone turns, now silent.\n                         \n          ON THE DOOR - It sits open. No one enters.\n                         \n          The room of Lemons watch, nervous.\n                         \n          ON MATER - Nervously watching too.\n                         \n          EXT. CASINO - CONTINUOUS\n                         \n                          FINN\n           Here we go.\n                         \n          INT. PRIVATE ROOM - CASINO - CONTINUOUS\n                         \n          A car finally appears. It's Zundapp.\n                         \n                          PROFESSOR ZUNDAPP\n           Guten Tag!\n                         \n          Everyone looks disappointed.\n                         \n                          TUBBS PACER\n           It's just the Professor.\n                         \n                          VICTOR HUGO\n           Zundapp, when is he coming?\n                         \n                          PROFESSOR ZUNDAPP\n           He's already here.\n                         \n          MONITORS descend from the ceiling. On them, an image of AN\n          ENGINE - the same bloody engine from the photo. But this is a\n          LIVE image. The car is being worked on.\n                         \n                          VOICE\n           Welcome, everyone.\n                         \n          The VOICE is garbled, scrambled. No way to determine who.\n                         \n                          ENGINE VOICE\n           I wish I could be with you on this\n           very special day but... my clutch\n           assembly broke. You know how it is.\n                         \n          The Lemons all nod in understanding.\n           87.\n                         \n                         \n                          TUBBS PACER\n           Been there.\n                         \n           J. CURBY GREMLIN\n           Forget about it.\n                         \n                          VLADIMIR TRUNKOV\n           We know how you feel.\n                         \n          EXT. CASINO\n                         \n                          FINN\n           Descramble that voice!\n                         \n                          HOLLEY\n           (already on it)\n           I'm trying... It's too\n           sophisticated!\n                         \n          INT. PRIVATE ROOM - CASINO - CONTINUOUS\n                         \n                          ENGINE VOICE\n           We are here to celebrate. Today all\n           your hard work pays off. The world\n           turned their backs on cars like us.\n           They stopped manufacturing us,\n           stopped making our parts. The only\n           thing they haven't stopped doing is\n           laughing at us. They've called us\n           terrible names...\n                         \n          On VICTOR HUGO.\n                         \n                          ENGINE VOICE\n           Jalopy. Rustbucket.\n                         \n          On TUBBS PACER.\n                         \n                          ENGINE VOICE\n           Heap. Clunker.\n                         \n          On J. CURBY GREMLIN:\n                         \n                          ENGINE VOICE\n           Junker, beater, wreck.\n                         \n          On ZUNDAPP.\n                         \n                          ENGINE VOICE\n           Rattletrap.\n                         \n          And finally back on the monitor. The ENGINE.\n           88.\n                         \n                         \n                          ENGINE VOICE\n           Lemon. But their insults just give\n           us strength. Because today, my\n           friends...\n                         \n          The monitors switch to LIVE RACE FOOTAGE.\n                         \n                          ENGINE VOICE\n           ...that all ends.\n                         \n          On the VIDEO SCREENS - CARLA VELOSO'S ENGINE BLOWS ---\n                         \n          EXT. RACE COURSE - CONTINUOUS\n                         \n          Veloso swerves, attempts to mitigate a crash ---\n                         \n           DARRELL CARTRIP (V.O.)\n           There's smoke! On the casino\n           bridge!\n                         \n           DAVID HOBBSCAP (V.O.)\n           Oh no.\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           It's Carla Veloso, the Brazilian\n           race car.\n                         \n          She skids into a wall, hard.\n                         \n          EXT. CASINO - CONTINUOUS\n                         \n                          FINN\n           What just happened?\n                         \n                          HOLLEY\n           (analyzing the data)\n           I'm working on it.\n                         \n          INT. PRIVATE ROOM - CASINO - CONTINUOUS\n                         \n          The lemons are CHEERING. Mater is freaked out.\n                         \n                          ENGINE VOICE\n           They laughed at us. But now it's\n           our turn to laugh back.\n                         \n          BOOM! Another racer blows an engine. Mater JUMPS again.\n                         \n          EXT. RACE COURSE - SAME\n                         \n          As the racer smashes into the railing ---\n           89.\n                         \n                         \n           DAVID HOBBSCAP (V.O.)\n           Another crash! It's number nine,\n           Nigel Gearsley.\n                         \n           ENGINE VOICE (V.O.)\n           Embrace your inner lemon! Let it\n           drive you!\n                         \n          EXT. CASINO\n                         \n                          FINN\n           Holley?\n                         \n                          HOLLEY\n           I'm detecting an extremely strong\n           electromagnetic pulse.\n                         \n          Holley replays that last crash. The OUTLINE OF THE BEAM is\n          seen hitting the racer. Holley TRACES THIS to its source ---\n                         \n          --- a WGP CAMERA, which Grem and Acer have pointed at the\n          racers from a tower position.\n                         \n                          HOLLEY\n           Finn, it's the camera!\n                         \n                          FINN\n           Where?\n                         \n                          HOLLEY\n           On the tower.\n                         \n          Finn TAKES OFF, speeding toward Grem and Acer ---\n                         \n           ENGINE VOICE (V.O.)\n           This was meant to be alternative\n           fuel's greatest moment.\n                         \n          EXT. GRANDSTANDS - RACE COURSE - CONTINUOUS\n                         \n          Angry fans knock over cans of Allinol. One drives over an\n          Allinol sign. They're fed up with it.\n                         \n           ENGINE VOICE (V.O.)\n           After today everyone will race back\n           to gasoline.\n                         \n          We RACK FOCUS to reveal another fan as he RIPS an Allinol\n          banner down angrily.\n                         \n          INT. PRIVATE ROOM - CASINO - CONTINUOUS\n                         \n          The video screens are now filled with ONE IMAGE - of the OIL\n          PLATFORMS in the Pacific from the beginning of the movie.\n           90.\n                         \n                         \n                          ENGINE VOICE\n           And we, the owners of the world's\n           largest untapped oil reserve, will\n           become the most powerful cars in\n           the world!\n                         \n          EXT. STREETS OF PORTO CORSA - CONTINUOUS\n                         \n          Finn ducks, weaves, speeds, and pushes his way through\n                         BYSTANDERS ---\n                         \n                          FINN\n           Get out of the way! Andate!\n                         \n          He speeds furiously through town.\n                         \n          EXT. RACE COURSE - PORTO CORSA - CONTINUOUS\n                         \n          McQueen and Francesco FLY PAST US.\n                         \n          INT. PRIVATE ROOM - CASINO\n                         \n                          ENGINE VOICE\n           They will come to us and they will\n           have no choice, `cause they will\n           need us.\n                         \n          ON FINN - He SPEEDS up a road, Grem and Acer visible ahead of\n          him. He LEAPS over the crevasse toward the AMC cousins ---\n                         \n          Suddenly, FINN FREEZES. He's immobilized in mid-air!\n                         \n          He looks up. A CHOPPER with a LARGE MAGNET hovers over him.\n                         \n                          ACER\n                          (TO FINN)\n           We figured you might stop by.\n                         \n           ENGINE VOICE (V.O.)\n           And they will finally respect us.\n           So hold your hoods high. After\n           today you will never again be\n           ashamed of who you are!\n                         \n          Grem and Acer turn back to the camera. They line up Shu\n          Todoroki, who's a bit further along now.\n                         \n                          FINN\n           No!\n                         \n          INT. PRIVATE ROOM - CASINO - CONTINUOUS\n                         \n                          ENGINE VOICE\n           Long live Lemons!\n           91.\n                         \n                         \n          EXT. RACE COURSE\n                         \n          Grem ZAPS THE RACER.\n                         \n          Flames burst from Todoroki. He loses control.\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           Number seven is loose! Shu\n           Todoroki!\n                         \n          Shu takes down three more cars with him and others follow\n          suit. It's a nightmare pileup.\n                         \n          EXT. CASINO - SAME\n                         \n          Holley sees Finn being flown away by the chopper.\n                         \n                          HOLLEY\n           Finn.\n                         \n          EXT. FINISH LINE - PORTO CORSA - CONTINUOUS\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           Bumper to bumper as they approach\n           the finish line.\n                         \n          McQueen NOSES out Francesco for a win, both oblivious to\n          what's just happened.\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           McQueen's the winner, Francesco's\n           second. And they have no idea what\n           happened behind them.\n                         \n                          MCQUEEN\n           Yeah!\n                         \n                          FRANCESCO\n           Dah! This is impossible!\n                         \n                          MCQUEEN\n           That's what I'm talking about.\n           Kachow! Hey, where are all the\n           other cars?\n                         \n                          FRANCESCO\n           What is going on?\n                         \n          They see the pile-up from an overhead monitor. Sirens blare\n          as a MEDIC CHOPPER flies to the scene of the pile-up.\n           92.\n                         \n                         \n                          MCQUEEN\n                          (REALIZES)\n           Oh no.\n                          CUT TO:\n                         \n          MILES AXLEROD - LATER. He's near the casino. He's completely\n          surrounded, 360 degrees, by press. He's drowned out by a\n          blizzard of questions.\n                         \n                          BRENT MUSTANGBURGER\n           Sir Axlerod! Is the final race in\n           London still going to take place?\n                         \n          PULL BACK to reveal we are watching this on monitors in the\n          PRIVATE CASINO ROOM with the Lemonheads, Zundapp and Mater.\n                         \n           MILES AXLEROD (ON TV)\n           I suppose that... Look, \"the show\n           must go on\" as they say. But now is\n           not the time to talk about...\n                         \n           J. CURBY GREMLIN\n           I can't believe this is really\n           happening.\n                         \n                          VLADIMIR TRUNKOV\n           Shh, quiet!\n                         \n           BRENT MUSTANGBURGER (ON TV)\n           And Allinol? Will you require all\n           the racers to still run on Allinol?\n                         \n                          VLADIMIR TRUNKOV\n           Here it comes.\n                         \n          On Miles Axlerod: He's devastated.\n                         \n           MILES AXLEROD (ON TV)\n           I cannot in good conscience\n           continue to risk the lives of any\n           more race cars. The final race will\n           not be run on Allinol.\n                         \n          WILD WHOOPING CHEERS fill the room. Lemonade corks are\n          popped.\n                         \n           BRENT MUSTANGBURGER (ON TV)\n           There you have it. A clearly\n           devastated Sir Miles Axlerod\n           announcing that he will not require\n           the cars to use Allinol for the\n           final race.\n           93.\n                         \n                         \n                          PROFESSOR ZUNDAPP\n           A toast! To the death of Allinol\n           and alternative fuel forever!\n                         \n          EXT. CASINO - CONTINUOUS\n                         \n          Holley is already on the run. Speeding away.\n                         \n                          HOLLEY\n           Mater. Abort the mission. They've\n           got Finn. Get out of there. Get out\n           of there right now!\n                         \n          She turns a corner and STOPS.\n                         \n          Her escape is now blocked by the same HUGO THUGS she tricked\n          before. Another vehicle appears BEHIND HER, LOOMS.\n                         \n           IVAN THE TOW TRUCK\n           How is your grandfather?\n                         \n          INT. PRIVATE ROOM - CASINO - CONTINUOUS\n                         \n          The Lemonheads celebrate, chant \"Long live lemons!\" Mater,\n          scared, turns to leave. He's stopped by ALEXANDER HUGO.\n                         \n                          ALEXANDER HUGO\n           Isn't this a great party, Ivan?\n                         \n                          MATER\n           Oh yeah, it's unbelievable.\n                         \n                          ALEXANDER HUGO\n           You are not leaving, are you?\n                         \n                          MATER\n           Uh, of course I ain't leavin'.\n                         \n           MCQUEEN (O.S.)\n           I'm just in shock like everybody...\n                         \n                          MATER\n           McQueen?\n                         \n          He turns, sees that McQueen is being interviewed on the\n          monitors.\n                         \n           MCQUEEN (ON TV)\n           Crashes are part of racing, I know.\n           But something like that shouldn't\n           ever happen.\n           94.\n                         \n                         \n           DARRELL CARTRIP (ON TV)\n           They're letting you choose your\n           fuel for the final race. Do you\n           have any idea what it's going to\n           be?\n                         \n           MCQUEEN (ON TV)\n           Allinol.\n                         \n          The excitement suddenly DRAINS from the room.\n                         \n                          LEMONHEADS\n           - What?! - Did he just say\n           Allinol? After today?\n                         \n           MCQUEEN (ON TV)\n           My friend Fillmore says the fuel's\n           safe. That's good enough for me. I\n           didn't stand by a friend of mine\n           recently. I'm not gonna make the\n           same mistake twice.\n                         \n          On Mater. He takes this in.\n                         \n           BRENT MUSTANGBURGER (ON TV)\n           So a surprising revelation from\n           Lightning McQueen...\n                         \n          Zundapp is already on the phone with their Big Boss who,\n          based on his angry O.S. voice, sounds ticked off.\n                         \n                          PROFESSOR ZUNDAPP\n           Yes, sir. Of course.\n                         \n          Zundapp hangs up, turns to the room.\n                         \n                          PROFESSOR ZUNDAPP\n           Allinol must be finished for good.\n           McQueen cannot win the last race.\n           Lightning McQueen must be killed.\n                         \n          Mater's eyes open wide.\n                         \n                          MATER\n           No!\n                         \n          Mater backs up, KNOCKING his emergency light against one of\n          the monitors. ZZZZZAT! His holographic disguise flickers away\n          then quickly SCROLLS THROUGH all of his previous disguises,\n          finally revealing rusty old Mater.\n                         \n                          PROFESSOR ZUNDAPP\n           It's the American spy!\n           95.\n                         \n                         \n          The thugs DRAW TERRIFYING WEAPONS.\n                         \n                          MATER\n           Dadgum.\n                         \n                          MATER'S COMPUTER\n           \"Gatling gun\" request acknowledged.\n                         \n          WHIRRRRR! GUNS roll out of Mater on each side.\n                         \n                          MATER\n           Shoot. I didn't mean ---\n                         \n                          MATER'S COMPUTER\n           Request acknowledged.\n                         \n          Mater SPRAYS BULLETS into the crowd.\n                         \n                          VLADIMIR TRUNKOV\n           Get down!\n                         \n                          MATER\n           Whoa!!\n                         \n          The Lemons and Lemonheads hit the deck and RETURN FIRE ---\n                         \n          Mater is THROWN BACKWARD by the force of the guns, back\n          through some double doors and onto a BALCONY.\n                         \n                          MATER\n           Wait wait! I didn't mean that kind\n           of shoot!\n                         \n                          MATER'S COMPUTER\n           Correction acknowledged. Deploying\n           chute.\n                         \n          WHOOM! A PARACHUTE BURSTS out of the back of Mater, he\n          catches air and is YANKED INTO THE SKY!\n                         \n          The Lemonheads watch him float away, amazed.\n                         \n          ON MATER, out of the frying pan but still toasty. He looks\n          around, notices:\n                         \n          LIGHTNING MCQUEEN, far away, leaving the press podium.\n                         \n                          MATER\n           McQueen!\n                         \n          Mater looks down at the harbor, over which he flies. He spots\n          a MOTORBOAT. Mater WHIPS his hook down, steals a ride behind\n          the boat TOWARD MCQUEEN.\n           96.\n                         \n                         \n                          ITALIAN MOTORBOAT\n           Aspetti!\n                         \n          The motorboat isn't happy about this, tries to shake him.\n          Mater is THROWN INTO A \"HOTEL\" sign, then SMASHES down\n          through a Francesco souvenir stand. As he CRASHES onto the\n          ground hard, we SMASH CUT TO ---\n                         \n          EXT. SECURITY CHECKPOINT - WINNERS CIRCLE\n                         \n          --- a barricade. Separating the press from the public,\n          ITALIAN SECURITY TRUCKS stand guard.\n                         \n                          MATER\n           Lemme through! Lemme through!\n                         \n          MATER barrels around a corner. He's now covered in Francesco\n          memorabilia and palm leaves. The word `HOT' now dangles off\n          him like the world's biggest bling. He looks INSANE.\n                         \n                          MATER\n                          (TO SECURITY)\n           You gotta let me in! I gotta get\n           through to warn McQueen!\n                         \n          Security eyes one another. This is serious.\n                         \n                          ITALIAN SECURITY #1\n           You cannot come through here. Back\n           up, signore.\n                         \n                          ITALIAN SECURITY #2\n           (into a walkie-talkie)\n           We have a lunatic at Gate Nove.\n                         \n                          MATER\n           No, listen! I was disguised as a\n           tow truck to infiltrate this\n           Lemonhead meeting and my weapons\n           system misinterperated what I was\n                          SAYING ---\n                         \n                          ITALIAN SECURITY #2\n           I repeat. Lunatic at Gate Nove.\n                         \n          Mater spots McQueen far off in the distance.\n                         \n                          MATER\n           McQueen! McQueen!\n                         \n          JUST OFF THE PRESS STAGE - McQueen is led toward the exit.\n                         \n                          PRESS LIAISON\n           Right this way, signore.\n           97.\n                         \n                         \n           MATER (O.S.)\n                          (DISTANT)\n           McQueen!\n                         \n                          MCQUEEN\n           Mater?\n                         \n          McQueen looks up but can only see A SEA OF VEHICLES,\n          flashbulbs, cameras, TV trucks with those tall satellite\n          antennae things that spindle toward the sky...\n                         \n          BACK AT THE SECURITY BARRICADE - Mater, like a nimble running\n          back, dances around to avoid capture by security.\n                         \n                          MATER\n           McQueen!\n                         \n                          ITALIAN SECURITY #1\n           Back up, sir. Stop moving! Stop!\n                         \n          Mater head fakes them and pushes through, into the crowd ---\n                         \n                          ITALIAN SECURITY #1\n           Oy! Stop! Ferma li!\n                         \n          IN THE CROWD - Mater shoves his way through. He's still far\n          in the back.\n                         \n                          MATER\n           McQueen!\n                         \n                         ON MCQUEEN\n                         \n                          MCQUEEN\n           That really sounded like Mater.\n           Mater?\n                         \n                          PRESS LIAISON\n                          (TO MCQUEEN)\n           Signore...\n                         \n          ON MATER, getting CLOSER...\n                         \n                          MATER\n           McQueen, they're gonna kill you!!\n                         \n          ON MCQUEEN - Okay, he's positive that was his friend, but\n          where is he?\n                         \n                          MCQUEEN\n           Mater?!\n                         \n          McQueen spots a TOW HOOK, moving through the crowd toward\n          him, \"Jaws\"-like.\n           98.\n                         \n                         \n                          MCQUEEN\n           Excuse me.\n                         \n          McQueen disappears into the press crowd.\n                         \n                          PRESS LIAISON\n           No, no, where are you going?\n           Please, Mr. McQueen!\n                         \n          McQueen pushes through the press.\n                         \n                          MCQUEEN\n           Scusi. Mater! Scusi...\n                         \n          McQueen tracks the tow hook, gets closer. He pushes through\n          the last few vehicles ---\n                         \n                          MCQUEEN\n           Mater, I'm so glad to see you. I'm\n           so sorr ---\n                         \n          It's NOT MATER. It's IVAN, the Hugo Thug's tow truck.\n                         \n           IVAN THE TOW TRUCK\n           Lightning McQueen! I am a huge fan.\n                         \n                          MCQUEEN\n                          (CONFUSED)\n           Oh, I'm sorry. I thought I heard---\n                         \n           IVAN THE TOW TRUCK\n           Yes, but that was me. I said, \"You\n           killed out there today.\" You're\n           the best.\n                         \n                          MCQUEEN\n           What? Oh. I mean, thanks.\n                         \n                          PRESS LIAISON\n           Right this way, signore ---\n                         \n          Now the Press Liaison and his assistants are pushing McQueen\n          back in the other direction ---\n                         \n                          MCQUEEN\n           (as he's pulled away)\n           I really thought I heard my friend.\n                         \n          As he's pulled away, press and onlookers start to come\n          between him and Ivan, who hasn't moved.\n           99.\n                         \n                         \n           IVAN THE TOW TRUCK\n                          (TO MCQUEEN)\n           In England you'll be finished. At\n           the finish line.\n                         \n          Ivan is now obscured again.\n                         \n                          MCQUEEN\n           Wait, what?\n                         \n          The ITALIAN PRESS being to swarm.\n                         \n                          PRESS LIAISON\n           Please, the world press is waiting.\n           You come with me, please.\n                         \n          McQueen is pulled back ---\n                         \n          EXT. STREET - PORTO CORSA - MOMENTS LATER\n                         \n          --- just as Mater, now BOUND and with HIS MOUTH TAPED, is\n          pulled away and thrown into the back of a transport vehicle.\n          He lands hard on his side, spits out his TAPE.\n                         \n                          MATER\n           Let me go!\n                         \n                          PROFESSOR ZUNDAPP\n           You actually care about that race\n           car. A pity you didn't warn him in\n           time.\n                         \n          As the doors close on Mater --- PHHHHHSSSSSSTTTTTTT! A\n          thick, noxious gas starts to fill the truck.\n                         \n          On MATER as the knockout gas works its magic. HIS EYES CLOSE.\n                          CUT TO:\n                         \n          BLACK SCREEN.\n                         \n           MATER (V.O.)\n           Idiot? Is that how you see me?\n                         \n           FINN (V.O.)\n           That's how everyone sees you. I\n           tell you, that's the genius of it.\n                         \n          FADE IN on Mater, back at the Casino, eyeing his reflection\n          in the glass window. It's the same moment from before except\n          now we are watching it from a DETACHED, FLOATING PERSPECTIVE.\n           100.\n                         \n                         \n           FINN (OVER RADIO)\n           No one realizes they're being\n           fooled because they're too busy\n           laughing at the fool.\n                         \n          - IN THE KABUKI THEATER IN JAPAN - Again, from before. Mater\n          makes a spectacle of himself, WHOOPING AND HOLLERING in the\n          stands with the face paint on.\n                         \n                          MATER\n           Domo arigato!\n                         \n          McQueen, Fillmore, Guido, Luigi, Sarge and patrons eye Mater,\n          embarrassed and angry.\n                         \n          - IN THE JAPANESE MUSEUM - The moment of Mater banging on the\n          Zen rock garden's glass. Except that now we see all sorts of\n          disappointed and eyebrow raising reactions.\n                         \n                          MATER\n           You done good! You got all the\n           leaves!\n                         \n                          JEFF GORVETTE\n           Check out that tow truck.\n                         \n                          LEWIS HAMILTON\n           I wonder who that guy's with?\n                         \n                          MCQUEEN\n                          (HUMILIATED)\n           Will you guys excuse me just for\n           one little second?\n                         \n          We now REVEAL that this FLOATING, THIRD PERSON PERSPECTIVE is\n          MATER. He's INSIDE his past, watching it from others' points\n          of view. He doesn't like what he sees.\n                         \n          - ON MATER, now at the sushi bar.\n                         \n                          MATER\n           Now that's a scoop of ice cream!\n                         \n          Mater swallows the wasabi with one big bite. He SCREAMS! The\n          sushi bar patrons blanch with revulsion at his wail.\n                         \n          - ON THE FOUNTAIN, as Mater peels into full view of everyone\n          else at the party. As Mater laps up water from a fountain:\n                         \n                          MCQUEEN\n                          (EMBARRASSED)\n           Mater?!\n           101.\n                         \n                         \n          ALL THE RACERS, with FRANCESCO front and center, guffaw at\n          Mater.\n                         \n          - On MCQUEEN, now scolding Mater moments later.\n                         \n                          MATER\n           I never leak oil. Never.\n                         \n                          MCQUEEN\n           Mater, you have to get a hold of\n           yourself. You're making a scene!\n                         \n          - IN MCQUEEN'S PIT GARAGE, after the Japanese race.\n                         \n                          MATER\n           Wait a minute. I didn't screw you\n           up, did I?\n                         \n                          MCQUEEN\n           I lost the race because of you!\n                         \n                          MATER\n           Maybe if I talked to somebody, or---\n                         \n                          MCQUEEN\n           I don't need your help. I don't\n           want your help!\n                         \n          - Now BACK AT THE PARTY, a moment we didn't see before but\n          which presumably happened. Mater is BANGING a ceremonial\n          GONG, to the horror of Japanese guests.\n                         \n                          MATER\n           Bang a gong, get it on!\n                         \n          GONNNNNNG!!! ---\n                         \n          On the PARTYGOERS, RACE CARS, PARTY STAFF - they're all\n          laughing at Mater as McQueen's final words blend in, making a\n                         DISSATISFIED CACOPHONY\n                         \n                          MCQUEEN\n           Listen, this isn't Radiator\n           Springs. This is exactly why I\n           don't bring you along to these\n           things!\n                         \n          Off the GONG at the party ---\n                         \n          INT. BIG BENTLEY - DAY\n                         \n          --- to the GONG of a CLOCK.\n                         \n          CLOSE ON MATER as he OPENS HIS EYES.\n           102.\n                         \n                         \n          All around him, all he sees are GIANT PIECES OF MECHANIZED\n          CLOCKWORK.\n                         \n          HOLLEY and FINN are here too, strapped bumper to bumper in\n          the divots of large clock movements.\n                         \n                          MATER\n           Holley! Finn! Where are we?\n                         \n                          FINN\n           We're in London, Mater. Inside Big\n           Bentley.\n                         \n          EXT. BIG BENTLEY - CONTINUOUS\n                         \n          The BIG HAND finishes ADVANCING one minute. It's 3 PM.\n                         \n          INT. BIG BENTLEY - CONTINUOUS\n                         \n          Suddenly Mater DROPS QUICKLY down toward ---\n                         \n          --- whirring, scary machinery.\n                         \n                          MATER\n           Woaaaah! ---\n                         \n          WHAP! The chain yanks to a STOP.\n                         \n          Mater, instead of being 30 feet from death, is now 20.\n                         \n          Finn and Holley are only a few clicks closer to being crushed\n          themselves. The clock ticks to 3:01.\n                         \n                          MATER\n           This... this is all my fault.\n                         \n                          FINN\n           Don't be a fool, Mater.\n                         \n                          MATER\n           But I am, remember? You said so.\n                         \n                          FINN\n           When did I... Oh. Mater, I was\n           complimenting you on what a good\n           spy you are.\n                         \n                          MATER\n           I'm not a spy!\n                         \n          This echoes throughout the clock.\n           103.\n                         \n                         \n                          MATER\n           I've been trying to tell you that\n           the whole time. I really am just a\n           tow truck.\n                         \n          Finn and Holley take this in.\n                         \n                          HOLLEY\n           Finn, he's not joking.\n                         \n                          FINN\n           I know.\n                         \n                          MATER\n           You were right, Finn. I'm a fool.\n           And what's happened to McQueen is\n           `cause I'm such a big one. This is\n           all my fault.\n                         \n          GREM and ACER arrive on a lift, roll into view on a catwalk.\n                         \n                          GREM\n           Good, you're up!\n                         \n                          ACER\n           And just in time!\n                         \n                          GREM\n           Professor Z wanted you to have a\n           front row seat for the death of\n           Lightning McQueen.\n                         \n                          MATER\n                          (HOPEFUL)\n           He's still alive?\n                         \n          Acer whips a sheet away, revealing the WGP CAMERA, turns it\n          toward the clock face.\n                         \n                          ACER\n           Not for much longer.\n                         \n          He pushes the camera through an open small window, turns it\n          toward the course. Mater DROPS down again ---\n                         \n          FINN and HOLLEY CLICK FORWARD.\n                         \n          EXT. LONDON - DAY\n                         \n          Big Bentley's big hand CLICKS ahead another minute. But we're\n          a bit farther away from it than before.\n                         \n           SALLY (O.S.)\n           We came as soon as you called.\n           104.\n                         \n                         \n          INT. MCQUEEN'S PIT - LONDON\n                         \n          Sally, flanked by Red, Flo and Ramone, are in front of ----\n                         \n          --- McQueen and the rest of the team.\n                         \n                          MCQUEEN\n           I called to talk to Mater. It never\n           occurred to me that he wouldn't be\n           there.\n                         \n                          RAMONE\n           Sheriff is talking to Scotland Yard\n           right now.\n                         \n                          FLO\n           And Sarge is in touch with his\n           friends in the British military.\n                         \n                          SALLY\n           You just need to focus on the race.\n                         \n                          MCQUEEN\n           I know, but Sal, with everything\n           going on I'm not sure I should---\n                         \n          A HORN O.S. Someone's entering the pit. Everyone parts,\n          revealing MILES AXLEROD.\n                         \n                          MCQUEEN\n           Sir Axlerod.\n                         \n                          MILES AXLEROD\n           I'm sorry to interrupt.\n                         \n                          MCQUEEN\n           No, no, it's all right.\n                         \n                          MILES AXLEROD\n           I just wanted to come down here and\n           personally thank you. Because after\n           Italy, I was finished. And then you\n           gave me one last shot.\n                         \n                          MCQUEEN\n           Listen, I ---\n                         \n                          MILES AXLEROD\n           And I probably shouldn't be saying\n           this at all but... I hope you win\n           today. Show the world that they've\n           been wrong about Allinol.\n                         \n          McQueen takes this in. He looks at Sally.\n           105.\n                         \n                         \n                          SALLY\n           Mater would want you to race.\n                         \n                          MCQUEEN\n           All right. For Mater.\n                         \n          EXT. THE STARTING GRID - MOMENTS LATER\n                         \n          TIRES SQUEAL ---\n                         \n          MCQUEEN, FRANCESCO and the other racers PEEL OUT ---\n                         \n          We PAN UP to reveal the LEMONHEADS watching from a VIP box.\n                         \n          EXT. RACE COURSE - LONDON - DAY\n                         \n          McQueen leads Francesco as they approach Big Bentley...\n                         \n          INT. BIG BENTLEY - LONDON - CONTINUOUS\n                         \n                          GREM\n           Here he comes!\n                         \n          Grem turns up the juice to the HIGHEST, DEATH-INDUCING LEVEL.\n                         \n          Holley and Finn watch, helpless. Mater closes his eyes.\n                         \n          Grem ZAPS MCQUEEN.\n                         \n          EXT. RACE COURSE - LONDON\n                         \n          McQueen SPEEDS PAST Big Bentley, unharmed. Oblivious to what\n          was supposed to have just happened.\n                         \n          INT. BIG BENTLEY - LONDON\n                         \n          Zundapp suddenly SQUAWKS over the radio.\n                         \n           PROFESSOR ZUNDAPP (OVER RADIO)\n           What happened!?\n                         \n                          GREM\n           I don't know, Professor.\n                         \n                          ACER\n           What did you do?\n                         \n                          GREM\n                          (TO ACER)\n           I didn't do nothin'. Shh! I'm\n           talking to the Professor---\n                         \n          They're all talking at once and for a moment we cannot\n          understand what is being said.\n           106.\n                         \n                         \n                          ACER\n           You broke it.\n                         \n                          GREM\n           Quiet!\n                          (INTO RADIO)\n           I understand, sir. Yes.\n                         \n          Grem hangs up.\n                         \n                          ACER\n           What'd he say?\n                         \n                          GREM\n           We go to the backup plan.\n                         \n                          MATER\n           Backup plan??\n                         \n                          GREM\n           We snuck a bomb in McQueen's pit!\n                         \n                          ACER\n           The next time he makes a stop,\n           instead of saying \"ka-chow,\" he's\n           gonna go \"ka-boom\"!\n                         \n          They LAUGH. Mater shudders, upset.\n                         \n                          GREM\n           Don't feel bad, tow truck. You\n           couldn't have saved him.\n                         \n                          ACER\n           Oh, wait. You could have!\n                         \n          Grem and Acer laugh. As they board the elevator:\n                         \n                          MATER\n           Dadgum lemons.\n                         \n                          MATER'S COMPUTER\n           Request acknowledged.\n                         \n          Suddenly, Mater's GATLING GUNS rotate out again - a surprise\n          to Mater. But they SPIN IN PLACE, empty.\n                         \n          Grem and Acer just laugh more.\n                         \n                          GREM\n           What, you didn't think we'd take\n           your bullets?\n                         \n          Mater NOTICES SOMETHING.\n           107.\n                         \n                         \n          CLOSE ON WHAT MATER SEES: A small piece of his ropes have\n          been shaved away by the Gatling.\n                         \n          He carefully rotates his guns BACK IN, pretending like he's\n          seen nothing.\n                         \n                          ACER\n           That's right! You got nothin'.\n                         \n                          GREM\n           (as the elevator descends)\n           Who's the lemon now, huh?\n                         \n          They're GONE.\n                         \n                          FINN\n           Nice try, Mater.\n                         \n                          MATER\n           Dadgum!\n                         \n                          MATER'S COMPUTER\n                          REQUEST ACK-\n                         \n          The guns ROTATE OUT AGAIN, SPIN. Mater watches as the\n          spinning barrels SLICE INTO the ropes, do some damage.\n                         \n                          MATER\n           Dadgum! Dadgum! Dadgum!\n                         \n          The COMPUTER responds with each \"dadgum.\" The barrels\n          continue to SPIN, CUTTING THROUGH the ropes.\n                         \n                          MATER\n                          DADGUMDADGUMDADGUMDADGUM ---\n                         \n          PING! The ropes BREAK AWAY and Mater FALLS --- right toward\n          the whirring machinery!\n                         \n                          HOLLEY\n           Mater!\n                         \n          Mater QUICKLY WHIPS his tow cable around, hooks a pipe and\n          tosses himself to the ramp with a heavy THUD. He doesn't\n                         HESITATE:\n                         \n                          MATER\n           I gotta get you all out of there!\n                         \n                          FINN\n           There's no time. McQueen needs your\n           help, Mater.\n           108.\n                         \n                         \n                          MATER\n           But I can't, I'm just a tow truck.\n                         \n                          FINN\n           It's up to you. Go to the pits and\n           get everyone out. You can do that.\n                         \n                          MATER\n           What about you guys?\n                         \n                          FINN\n           We'll be okay.\n                         \n                          HOLLEY\n           Go and get some more dents, Mater.\n                         \n          EXT. BIG BENTLEY - LONDON\n                         \n          Mater SPEEDS out the front door, a bat out of hell ---\n                         \n          INT. BIG BENTLEY - LONDON - SAME\n                         \n          On Finn and Holley, now closer to death.\n                         \n                          HOLLEY\n           So we'll be \"okay\"? Really?\n                         \n                          FINN\n           He wouldn't have left if I'd told\n           him the truth.\n           (re: his death trap)\n           Being killed by a clock. Gives a\n           whole new meaning to \"your time has\n           come.\"\n                         \n          At this mention Holley seems to perk up, gets an idea.\n                         \n                          HOLLEY\n           Time. That's it!\n                         \n          She spies a GEARBOX below them, at least 20 feet down. Holley\n          FIRES HER ELECTROSHOCKERS ---\n                         \n          --- but they miss their target. She recoils them back.\n                         \n                          FINN\n           What are you doing?\n                         \n                          HOLLEY\n           Trying to turn back time. If I can\n           just reverse the polarity...\n                         \n          She FIRES them again. Direct hit!\n           109.\n                         \n                         \n          Holley JUICES the gearbox with HIGH VOLTAGE. The CLOCK STOPS.\n          It reverses itself.\n                         \n          Finn and Holley's wheel now rotates AWAY from danger.\n                         \n                          FINN\n           Good job! Quick thinking, Holley!\n                         \n          EXT. LONDON - CONTINUOUS\n                         \n          BIG BENTLEY, visible from street level, now moves BACKWARDS.\n          Fast. CRANE DOWN TO ---\n                         \n          --- Mater, speeding toward the track, unaware.\n                         \n                          MATER\n           What's everybody on the wrong side\n           of the road for?!\n                         \n          INT. BIG BENTLEY - CONTINUOUS\n                         \n          Finn and Holley are now moving in the opposite direction,\n          toward ANOTHER GEAR! And it's going MUCH FASTER. They're\n          seconds from a crushing death...\n                         \n                          HOLLEY\n           Oh no!\n                         \n                          FINN\n           Drive!\n                         \n          They both DRIVE, fast as they can with FULL FORCE ---\n                         \n                          FINN\n           Burn rubber!!\n                         \n          They drive HARDER, separating bumpers with just enough room\n          for the descending gear to SNAP THEIR ROPES!\n                         \n          Their tires spinning, they both LAUNCH off in opposite\n          directions, LAND HARD on opposing platforms. As Finn squeals\n          around to Holley's side of the clock:\n                         \n                          FINN\n           We've got to get to the course.\n           Calculate the fastest way to ---\n                         \n          Holley pops WINGS out of her side.\n                         \n                          HOLLEY\n           Done.\n           110.\n                         \n                         \n                          FINN\n                          (IMPRESSED)\n           Miss Shiftwell.\n                         \n                          HOLLEY\n           They're standard issue now.\n                         \n                          FINN\n           You kids get all the good hardware.\n                         \n          They turn to leave when they STOP, see SOMETHING. It's an AIR\n          FILTER on the ground.\n                         \n                          HOLLEY\n           Oh no. That's Mater's.\n                         \n                          FINN\n           I knew his escape was too easy.\n                         \n          EXT. BIG BENTLEY - LONDON\n                         \n          Finn BURSTS out the front doors of Big Bentley, speeds off as\n          HOLLEY SMASHES through the clock face, careens into view\n          flying over the traffic ---\n                         \n          INT. PIT ROW - TRACK SIDE - DAY\n                         \n          Mater bursts through the security gate with aplomb, tears\n          through the pits and stops at MCQUEEN'S.\n                         \n                          LUIGI\n           Mater!\n                         \n                          MATER\n           Everybody get out! Get out now!\n           Y'all gotta get out the pits!\n                         \n          The ENTIRE RADIATOR SPRINGS GANG is here.\n                         \n                          MATER\n           Hey, what are you guys doing here?\n                         \n                          SALLY\n           We're here because of you, Mater.\n                         \n                          FLO\n           Is everything okay?\n                         \n                          MATER\n           No! Everything's not okay! There's\n           a bomb in here! Y'all gotta get\n           out! Now!\n           111.\n                         \n                         \n                          EVERYONE\n           - A bomb? - Huh? - Woah.\n                         \n           FINN (OVER RADIO)\n           Mater!\n                         \n           MATER (INTO RADIO)\n           Finn! You're okay!\n                         \n          EXT. LONDON STREETS - CONTINUOUS\n                         \n                          FINN\n           Mater, listen to me. The bomb is on\n           you.\n                         \n          ON HIS REARVIEW DISPLAY: We can see that a BOMB has been\n          detected, anchored to Mater's air filter.\n                         \n                          FINN\n           They knew you'd try to help\n           McQueen. When we were knocked out\n           they planted it in your air filter.\n                         \n          INT. MCQUEEN'S PIT - CONTINUOUS\n                         \n          Mater SNORTS, blowing his air filter cover off. Cross-eyed,\n          Mater sees the explosive device attached to him. He looks up:\n                         \n          An ALLINOL CONTAINER hangs ominously over his head.\n                         \n                          MATER\n           Uh-oh.\n                         \n                          MCQUEEN\n           Mater! There you are!\n                         \n          Mater turns. McQueen enters Pit Row, 100 yards away and\n          closing in FAST.\n                         \n                          MATER\n           Stop right there!\n                         \n                          MCQUEEN\n           Oh man, I've been so worried about\n           you!\n                          CUT TO:\n                         \n          The view of this scene through the window of a luxury box.\n          Reveal Zundapp in the window's reflection. He's watching from\n          inside. He's poised to push a DETONATOR BUTTON.\n                         \n          As Zundapp's front tire approaches the detonator ---\n           112.\n                         \n                         \n          INT. MCQUEEN'S PIT - CONTINUOUS\n                         \n                          MATER\n           Don't come any closer!\n                         \n                          MCQUEEN\n           Are you okay?\n                         \n                          MATER\n           No, I'm not okay. Stay away from\n           me!!\n                         \n          Mater PEELS OUT BACKWARDS, out onto the track.\n                         \n                          MCQUEEN\n           No, wait. Wait!\n                          CUT TO:\n                         \n          PROFESSOR ZUNDAPP - He hesitates, can't believe it.\n                         \n          TV FOOTAGE OF MCQUEEN CHASING MATER\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           Hold everything. A tow truck has\n           just raced onto the track. And he's\n           driving backwards!\n                         \n          IN MCQUEEN'S PIT\n                         \n                          MCQUEEN\n           Mater, wait!\n                         \n          He breezes right through his pit, goes after Mater.\n                         \n           DAVID HOBBSCAP (V.O.)\n           Normally an emergency vehicle on\n           the track means there's been an\n           accident.\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           Wait, wait. Lightning McQueen is\n           chasing him!\n                         \n          EXT. TRACK - DAY\n                         \n          Mater drives up the track. McQueen gains, fast. Because\n          Mater's going backwards, they're face-to-face (but still with\n          some distance between them).\n                         \n                          MCQUEEN\n           Mater, wait!\n           113.\n                         \n                         \n                          MATER\n           Stay back! If you get close to me,\n           you gonna get hurt real bad!\n                         \n                          MCQUEEN\n           I know I made you feel that way\n           before, but none of that matters\n           because we're best friends!\n                          CUT TO:\n                         \n          TV FOOTAGE OF MCQUEEN CHASING MATER\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           And McQueen seems to be having a\n           conversation with the tow truck!\n                         \n           DARRELL CARTRIP (V.O.)\n           I don't know who that truck is,\n           Brent. But I'll tell you what, he's\n           gotta be the world's best backwards\n           driver.\n                         \n          REVEAL ZUNDAPP is watching this footage from his luxury box.\n          The closer McQueen gets to Mater the farther his tire ROLLS\n          onto the detonator. But he holds back ever so slightly so as\n          not to jump the gun.\n                         \n          ON THE TRACK - McQueen gains on Mater.\n                         \n                          MATER\n           McQueen, you don't get it. I'm the\n           bomb!\n                         \n                          MCQUEEN\n           Yes, Mater! You are the bomb!\n           That's what I'm trying to say here.\n           You've always been the bomb! And\n           you'll always be the bomb.\n                         \n                          MATER\n           Stay away!\n                         \n                          MCQUEEN\n           No! Never!\n                         \n          ON ZUNDAPP. He watches as McQueen SPEEDS UP.\n                         \n                          PROFESSOR ZUNDAPP\n           Almost there...\n                         \n          ON MCQUEEN. He's had enough screwing around. Here he comes.\n                         \n                          MCQUEEN\n           I'm not...letting you...\n           114.\n                         \n                         \n          He's going to catch him now.\n                         \n                          MCQUEEN\n           ...get away again!\n                         \n          McQueen JUMPS FORWARD, in an attempt to grab Mater's HOOK ---\n                         \n                          MATER\n                          (TO HIMSELF)\n           Gotta keep away from McQueen.\n                         \n          McQueen hooks Mater with his bumper JUST AS ---\n                         \n                          MATER'S COMPUTER\n           Request acknowledged.\n                         \n          TURBINE ROCKETS slide out of Mater.\n                         \n                          MCQUEEN\n           Oh my gosh!\n                         \n          BAWHOOOOOOM!!!!! Mater JOLTS forward with a rocket blast and\n          disappears, taking McQueen with him.\n                         \n          ON ZUNDAPP. He now freely PUSHES the detonator, but it says\n          \"OUT OF RANGE.\"\n                         \n          Zundapp can't believe it. He FLIPS OUT.\n                         \n          FARTHER UP THE TRACK - Francesco speeds along. ZHWAAAAAP!!!\n          Mater and McQueen ZING PAST HIM with a RED BLUR.\n                         \n                          FRANCESCO\n           What is happening? It's a bad\n           dream.\n                         \n          NOW EVEN FARTHER UP THE TRACK - Mater takes a turn, SMASHES\n          THROUGH A FENCE and skids around a corner out of sight. A\n          white, smoky JET TRAIL is all that remains.\n                         \n          IN MCQUEEN'S PIT - All of Radiator Springs watches the\n          television monitors, dumbfounded.\n                         \n           BRENT MUSTANGBURGER (V.O.)\n           And Lightning McQueen just blasted\n           away, hooked to the now rocket-\n           propelled tow truck.\n                          CUT TO:\n                         \n          EXT. STREETS OF LONDON - DAY\n                         \n          Overhead P.O.V.: Mater and McQueen swerve through the\n          streets.\n           115.\n                         \n                         \n          INT. LUXURY BOX - CONTINUOUS\n                         \n          Zundapp is still furiously hitting the button as Holley drops\n          into view just beyond the glass.\n                         \n          Freaked, Zundapp does a 180 and SMASHES out a plate glass\n          window, lands on a ridiculously large balloon tethered to the\n          ground, and speeds off ---\n                         \n          INT. ADJACENT LUXURY BOX - CONTINUOUS\n                         \n          The LEMONHEADS watch, baffled, as Zundapp drives away.\n                         \n           J. CURBY GREMLIN\n           The Professor's on the run.\n                         \n                          TUBBS PACER\n           Someone's gotta get McQueen.\n                         \n                          VLADIMIR TRUNKOV\n           Get McQueen!!\n                         \n          Grem and Acer are already out the door ---\n                         \n          EXT. SIDE STREET - SAME\n                         \n          Finn speeds into view, in time to see Zundapp turn a corner\n          out of sight.\n                         \n                          FINN\n           Holley. I'll get Zundapp, you help\n           Mater.\n                         \n          EXT. TRACK - SAME\n                         \n          Holley, still in the air, turns ---\n                         \n                          HOLLEY\n           Got it!\n                         \n          FARTHER UP THE TRACK - Holley THUNDERS past Francesco and out\n          of sight.\n                         \n                          FRANCESCO\n           What is happening?!\n                         \n          EXT. STREETS OF LONDON - SAME\n                         \n          Finn screams around a corner, sees ---\n                         \n          --- Professor Zundapp, speeding toward docks along the Thames\n          where a COMBAT SHIP waits.\n           116.\n                         \n                         \n                          COMBAT SHIP\n           Hurry, Professor!\n                         \n          ON ZUNDAPP - With Finn gaining fast, he accelerates. Suddenly\n          --- WHAP!\n                         \n          He's been TETHERED by Finn with tensile cables now attached\n          to his rear end. Zundapp SCREAMS like a little girl.\n                         \n                          FINN\n           Do you really think I'm going to\n           let you float away, Professor?\n                         \n          Finn reels him in. Zundapp spins his wheels, caught.\n                         \n          Suddenly Zundapp miraculously, inconceivably, GAINS TRACTION!\n          Now it's FINN'S WHEELS that are spinning.\n                         \n          ON THE COMBAT SHIP - the ELECTROMAGNET has been turned\n          outward and switched on. He's PULLING ZUNDAPP AND FINN IN\n          with the magnetic force. He pulls out a laser, TARGETS it at\n          Finn's windshield.\n                          CUT TO:\n                         \n          EXT. LONDON STREETS - SAME\n                         \n          Mater, still towing McQueen, rockets around a corner, zips\n          down another street ---\n                         \n                          MATER\n           McQueen, let go!\n                         \n                          MCQUEEN\n           Never!\n                         \n          They pass a Gremlin with a headset.\n                         \n          ON GREM AND ACER - Down another side street. They get this\n          message, take off in the opposite direction.\n                         \n           CUT BACK TO:\n                         \n          EXT. DOCKS NEAR THE THAMES - CONTINUOUS\n                         \n          FINN, tires squealing, loses more and more ground to the\n          boat. Zundapp, the \"rope\" in this tug-of-war, buckles under\n          the tension.\n                         \n                          PROFESSOR ZUNDAPP\n           Give it up, McMissile!\n                         \n          Finn releases a mess of bullets, grenades, and other weaponry\n          into the air ---\n           117.\n                         \n                         \n          THE MAGNET SUCKS it in quickly like a black hole ---\n                         \n          THUNK! It all sticks to the magnet, right next to Finn's\n          bullets. They're BOMBS, GRENADES, ROCKETS and one little\n          detonator with a flashing, beeping light.\n                         \n          Off the boat's RXN ---\n                          CUT TO:\n                         \n          ANOTHER PART OF LONDON, AT STREET LEVEL\n                         \n          KA-BOOOOOOM! A distant explosion (miles away) festoons into\n          the air, visible over the rooftops. Holley suddenly WINGS\n          into view. She sees ---\n                         \n          Mater and McQueen, speeding up the street.\n                         \n                          HOLLEY\n           Mater, stop!\n                         \n                          MATER\n           No way! You could get hurt!\n                         \n          Then she looks over, catches a glimpse of GREM AND ACER,\n          bearing down on them from a side street. They're going to\n          broadside Mater and McQueen.\n                         \n                          HOLLEY\n           Oh no.\n                         \n          ON MATER AND MCQUEEN - They're not aware of the impending\n          impact.\n                         \n          Holley DROPS FROM THE SKY, hits the pavement, SKIDS into the\n          path of the AMCs and DEFLECTS THEM. They FLIP OVER Holley,\n          Finn and McQueen and sail ---\n                         \n          --- INTO A PUB ---\n                         \n          --- where they skid across the room and SLAM into the bar,\n          knocking a ROW OF BEER MUGS to the ground.\n                         \n          IN THE PUB - MOMENTS LATER\n                         \n          Grem and Acer are pulverized by the bar patrons.\n                         \n          EXT. LONDON STREET - MOMENTS LATER\n                         \n          Holley, McQueen and Mater are now stopped.\n                         \n                          HOLLEY\n           Mater, we've got to get that bomb\n           off you.\n           118.\n                         \n                         \n          She's already SCANNING the bomb, working away.\n                         \n                          MCQUEEN\n           Bomb?\n                         \n                          MATER\n           Yeah, they strapped it to me to\n           kill you as a back-up plan.\n                         \n                          MCQUEEN\n           Back-up plan? Mater, who put a bomb\n           on you?\n                         \n           PROFESSOR ZUNDAPP (O.S.)\n           Ahhhhh!\n                         \n          Professor Zundapp suddenly ROLLS to a stop next to (a now\n          totally freaked) McQueen, entangled in grappling hooks care\n                         OF ---\n                         \n          --- Finn, who has him leashed.\n                         \n                          PROFESSOR ZUNDAPP\n                          (TO MCQUEEN)\n           You. Why didn't my death ray kill\n           you?\n                         \n                          MCQUEEN\n           Death ray?\n                         \n                          FINN\n           Turn off the bomb, Zundapp!\n                         \n                          PROFESSOR ZUNDAPP\n           Are you all so dense? It's voice-\n           activated. Everything is voice-\n           activated these days.\n                         \n                          MATER\n           Deactivate! Deactivate!\n                         \n           BOMB'S COMPUTER VOICE\n           Voice denied.\n                         \n          The BOMB suddenly TRANSFORMS into a TIME BOMB, now complete\n          with a countdown mechanism from 4:59... 4:58... Mater GASPS.\n                         \n                          PROFESSOR ZUNDAPP\n           Oops. Did I forget to mention that\n           it can only be disarmed by the one\n           who activated it?\n                         \n          Holley immediately shoves a GUN in Zundapp's grill.\n           119.\n                         \n                         \n                          HOLLEY\n           Say it!\n                         \n                          PROFESSOR ZUNDAPP\n           Deactivate.\n                         \n           BOMB'S COMPUTER VOICE\n           Voice denied.\n                         \n          THE BOMB'S TIMER: It loses a full minute! Goes from 4:48 to\n          3:48 to 3:47... Mater GASPS.\n                         \n                          PROFESSOR ZUNDAPP\n                          (GRINNING)\n           I am not the one who activated it.\n           Would anyone else like to try?\n                         \n          ZZZZZZATTT! Holley shocks him unconscious.\n                         \n                          FINN\n                          (TO HOLLEY)\n           You read my mind.\n                         \n                          HOLLEY\n           He was getting on my nerves.\n                         \n                          MCQUEEN\n           What do we do?\n                         \n           VICTOR HUGO (O.S.)\n           It's very simple.\n                         \n          VICTOR HUGO blocks the entrance to a side street. He's\n          surrounded by Hugo relatives.\n                         \n                          VICTOR HUGO\n           You blow up.\n                         \n          The four streets surrounding them are now blocked by each of\n          the Lemonheads and their families.\n                         \n                          MCQUEEN\n                          (TO MATER)\n           I'm gonna go out on a limb here.\n           These are the guys that want me\n           dead, correct?\n                         \n                          VLADIMIR TRUNKOV\n           It's nothing personal.\n                         \n                          MATER\n           (to the Lemons)\n           Fellers, listen.\n                          (MORE)\n           120.\n                         \n                          MATER (CONT'D)\n           I know what you're going through.\n           Everybody's been laughing at me my\n           whole life too ---\n                         \n          McQueen turns to Mater - he wasn't expecting that.\n                         \n          The Lemons all eye each other, considering Mater's words.\n                         \n                          MATER\n           --- but becoming powerful and rich\n           beyond your wildest dreams ain't\n           gonna make you feel better.\n                         \n           J. CURBY GREMLIN\n           Yeah, but it's worth a shot.\n                         \n          WHOOM!!! He's BROADSIDED by a blast of water from O.S.\n                         \n          It's Red! He's sitting outside an underground entrance,\n          followed by Sally and the rest of the Radiator Springs gang.\n                         \n          ALL OUT WAR ensues between the LEMONS, RADIATOR SPRINGS along\n          with FINN and HOLLEY.\n                         \n          FINN attaches his four-way cable hooks to the thugs and\n          springs high in the air, crushing the four of them together.\n                         \n          HOLLEY SPROUTS her wings, and knocks out two cars on her\n          side.\n                         \n          VARIOUS SHOTS OF RADIATOR SPRINGS KICKING BUTT:\n                         \n          Guido pulls some LEMON tires off with his air gun. In seconds\n          he has a stack of lugnuts next to him.\n                         \n                          GUIDO\n           Pit stop.\n                         \n          The two Pacers' tires all FALL OFF.\n                         \n          Flo hits VLADIMIR TRUNKOV with her high-beams, BLINDING HIM.\n          Sheriff BOOTS him.\n                         \n                          SHERIFF\n           Not today, boys!\n                         \n          Guido pushes away his tireless thug, YELLING AT HIM IN\n          ITALIAN.\n                         \n          Mater KARATE CHOPS lemons, three and four at a time.\n                         \n          Ramone SPRAY PAINTS a lemon's windshield.\n           121.\n                         \n                         \n                          TUBBS PACER\n           Retreat!\n                         \n          A few Lemons turn back the way they came. BLOCKING THEIR PATH\n          are a line of BRITISH MILITARY VEHICLES clad in digital camo,\n          led by SARGE.\n                         \n                          SARGE\n           Thanks for the help, Corporal.\n                         \n                          BRITISH CORPORAL\n           Anything for one of pop's mates.\n                         \n          And in the middle of all of this craziness we CUT TO ---\n                         \n          --- MATER. WRENCH BITS are strewn all around him as Guido\n          tries wrench after wrench to take the bolts off. No dice.\n          Guido gestures wildly, spits Italian a mile a minute.\n                         \n                          MCQUEEN\n           What's he saying?! What's wrong!?\n                         \n                          LUIGI\n           None of his wrenches fit the bolts!\n                         \n          This is a light bulb moment for Mater. He eyes the bolts.\n                         \n                          MATER\n           I get it. I get it! I know what\n           needs to be done.\n                         \n                          MCQUEEN\n           Then do it!\n                         \n                          MATER\n           What? No, I can't do it. Look,\n           nobody takes me seriously. I know\n           that now. This ain't Radiator\n           Springs.\n                         \n                          MCQUEEN\n           Yes it is.\n                         \n          Mater looks at McQueen. It is?\n                         \n                          MCQUEEN\n           You're yourself in Radiator\n           Springs. Be yourself here. And if\n           people aren't taking you seriously,\n           then they need to change. Not you.\n           I know that, because I was wrong\n           before. Now you can do this. You're\n           the bomb.\n           122.\n                         \n                         \n                          MATER\n           Thanks, buddy.\n                         \n                          MCQUEEN\n           No no no, you're the actual bomb.\n           Now let's go!\n                         \n                          MATER\n           Oh, right! Hang on!\n                         \n          Mater HOOKS McQueen and they're off.\n                         \n          They SHOOT PAST FINN, who's in the middle of battling lemons.\n                         \n                          FINN\n           Where's he going?\n                         \n          ON MATER AND MCQUEEN - Flying down a side street.\n                         \n                          MATER\n           Computer!\n                         \n                          MATER'S COMPUTER\n           Yes, Agent Mater.\n                         \n                          MATER\n           I need that thing you done before\n           to get me away from McQueen!\n                         \n                          MATER'S COMPUTER\n           Request acknowledged.\n                         \n          The ROCKET THRUSTERS kick in. They head right for a WALL.\n                         \n                          MCQUEEN\n           Mater...\n                         \n                          MATER\n           Now I need you to do the chute, the\n           second kind not the first!\n                         \n                          MATER'S COMPUTER\n           Deploying chute.\n                         \n          Mater's chute POPS OPEN, catching air and sending Mater and\n          McQueen SAILING INTO THE AIR.\n                         \n          Mater starts to steer them the direction he wants. He and\n          McQueen are FLYING OVER LONDON.\n                         \n          EXT. BALCONY - BUCKINGHAM PALACE - DAY\n                         \n          The QUEEN, her attendants, assorted dignitaries are here.\n           123.\n                         \n                         \n                          QUEEN\n           Who's winning the race?\n                         \n          Mater and McQueen drop from the sky. They land and skid to a\n          halt just before the Queen's guards who DRAW THEIR WEAPONS.\n                         \n                          QUEEN'S GUARD\n           Back up! Back away!\n                         \n                          QUEEN\n                          (STAR-STRUCK)\n           It's Lightning McQueen!\n                         \n                          QUEEN'S GUARDS\n           Get back!\n                         \n                          MCQUEEN\n           No, no, it's okay! Tell them,\n           Mater. Explain.\n                         \n                          MATER\n           Okay! Somebody's been sabotaging\n           the racers and hurting the cars and\n           I know who. Oh wait... Your\n           Majesty.\n                         \n          Mater BOWS to the Queen. In doing so, the TICKING TIME BOMB\n          angles into view. The clock's at T-minus 1:53.\n                         \n                          QUEEN'S GUARDS\n           - Bomb! - It's a bomb! - Everybody\n           down! - Look out!\n                         \n           FINN (O.S.)\n           Hold your fire! He can't disarm it!\n                         \n          Finn dives onto the platform and rolls between the Queen and\n          Mater.\n                         \n                          FINN\n           Mater, I don't know what you're\n           doing but stand down now!\n                         \n                          MATER\n           (aside, to McQueen)\n           This ain't nothing at all like\n           Radiator Springs.\n                         \n                          MCQUEEN\n           Mater, just cut to the chase!\n                         \n                          MATER\n           Okay.\n           124.\n                         \n                         \n          He turns to Miles Axlerod.\n                         \n                          MATER\n           It's him.\n                         \n                          MILES AXLEROD\n           What? Me? You've got to be crazy.\n                         \n          Everyone exchanges confused looks, including Finn and Holley.\n                         \n                          MATER\n           I figured it out when I realized\n           you all attached this ticking time\n           bomb with Whitworth bolts. The same\n           bolts that hold together that old\n           British engine from the photograph.\n           Holley! Show that picture.\n                         \n                          HOLLEY\n           O-kay...\n                         \n          Holley projects the much discussed PHOTO OF THE ENGINE.\n                         \n                          MATER\n           And then I remembered what they say\n           about old British engines - \"If\n           there ain't no oil under `em, there\n           ain't no oil in `em.\"\n                         \n                          MILES AXLEROD\n           What is he talking about?\n                         \n                          MATER\n           It was you leaking oil at the party\n           in Japan. You just blamed it on me.\n                         \n                          MILES AXLEROD\n           Electric cars don't use oil, you\n           twit.\n                         \n                          MATER\n           Then you're faking it. You didn't\n           convert to no electric. We pop that\n           hood we gonna see that engine from\n           that picture right there.\n                         \n          Mater moves toward Miles Axlerod to pop his hood.\n                         \n                          MILES AXLEROD\n           This lorry's crazy. He's going to\n           kill us all!\n                         \n          Miles Axlerod BACKS UP to the edge of the stage.\n           125.\n                         \n                         \n                          MILES AXLEROD\n           Stay away!\n                         \n                          HOLLEY\n           But Sir Axlerod created the race,\n           Mater. Why would he want to hurt\n           anyone?\n                         \n                          MATER\n           To make Allinol look bad so\n           everybody'd go back to using oil. I\n           mean, he said it himself with that\n           disguised voice.\n                         \n                          MILES AXLEROD\n           \"Dee-sguised voice?\" What are you\n           talking about? You're nuts, you\n           are!\n                         \n          The QUEEN'S GUARDS have had ENOUGH. As has the PRINCE.\n                         \n                          PRINCE WHEELIAM\n           This is going nowhere fast. We\n           really should go, Grandmother.\n                         \n                          QUEEN\n           One moment. I'd like to see where\n           this is going.\n                         \n                          FINN\n           Mater, he created Allinol.\n                         \n                          MATER\n           Yeah, but what if he found that\n           huge oil field just as the world\n           was trying to find something else?\n                         \n          Mater sticks his ticking bomb-nose into Miles Axlerod's\n          grill.\n                         \n                          MATER\n           What if he came up with Allinol\n           just to make alternative fuel look\n           bad?\n                         \n                          MILES AXLEROD\n           \"What if?\" You're basing this on a\n           \"What if\"?!\n                         \n                          GUARD\n           Okay, that's it.\n                         \n          And the QUEEN'S GUARDS spirit the Queen and Prince Wheeliam\n          out of there FAST ---\n           126.\n                         \n                         \n                          MILES AXLEROD\n           Wait! Somebody save me! The lorry's\n           crazy!\n                         \n          Now it's just Miles Axlerod, Mater, McQueen, Finn and Holley.\n          Miles Axlerod's back tires slip on the edge of the podium as\n          he is cornered by Mater.\n                         \n                          MILES AXLEROD\n           Keep away, you idiot!\n                         \n          00:00:08...\n                         \n                          FINN\n           Mater!\n                         \n                          HOLLEY\n           Mater!\n                         \n          00:03...00:02...\n                         \n                          MILES AXLEROD\n           Someone do something!\n                         \n          Everyone FLINCHES, DUCKS or DIVES FOR COVER except McQueen,\n          Mater and Axlerod ---\n                         \n                          MILES AXLEROD\n           You're insane, you are!\n           Deactivate!!\n                         \n          The bomb FREEZES at 00:01.\n                         \n           THE BOMB'S COMPUTER VOICE\n           Bomb deactivated. Have a nice day,\n           Sir Axlerod.\n                         \n          General shock all around. Miles Axlerod realizes what he's\n          done, looks terrified. Police surround him.\n                         \n          Mater FLINGS Miles Axlerod's hood open with his hook,\n          revealing AN INTERNAL COMBUSTION ENGINE, oil dripping from\n          all sides. It MATCHES the photo.\n                         \n                          FINN\n           The engine from the photo.\n                         \n                          HOLLEY\n           It's a perfect match!\n                         \n                          MILES AXLEROD\n           How did the tow truck figure it\n           out?\n           127.\n                         \n                         \n                          MCQUEEN\n                          (TO MATER)\n           It's official. You're coming to all\n           my races from now on.\n                         \n                          MATER\n           Now you're talking!\n                         \n          Tire bump.\n                         \n          EXT. BUCKINGHAM PALACE - DAY\n                         \n          A massive crowd packs the adjacent streets and parks.\n                         \n          INT. BUCKINGHAM PALACE - DAY\n                         \n          Mater does the requisite \"silly faces\" in an attempt to break\n          the composure of a Buckingham Palace Guard. It isn't working.\n          McQueen approaches.\n                         \n                          MCQUEEN\n           Mater, let's go. You're on.\n                         \n          INT. QUEEN'S CHAMBER - BUCKINGHAM PALACE - DAY\n                         \n          The Queen sits in attention at the front of the Main\n          Ballroom. As Mater and McQueen approach:\n                         \n                          LORD STEWARD\n           Your Majesty. May I present for the\n           investiture of honorary Knighthood\n           of the British Realm. Tow Mater of\n           Radiator Springs.\n                         \n                          MCQUEEN\n           Go get `em, buddy.\n                         \n          McQueen joins his friends from Radiator Springs. Mater rolls\n          forward. He bows, as if he's practiced it all day.\n                         \n                          QUEEN\n           I hereby dub thee \"Sir Tow Mater.\"\n                         \n          Applause from all around.\n                         \n                          MATER\n                          (LOOKS UP)\n           \"Sir?\" Shoot, you can just call me\n           Mater, Your Majesty. I don't wanna\n           hear none of this \"Sir\" business.\n           By the way, have y'all met each\n           other? Queen? McQueen. McQueen,\n           Queen. McQueen? McMissile.\n                          (MORE)\n           128.\n                         \n                          MATER (CONT'D)\n           McMissile, McQueen. Queen?\n           McMissile.\n                         \n          He continues introducing everyone as we CUT TO ---\n                         \n          EXT. RADIATOR SPRINGS - DAY\n                         \n          The town sign now reads \"WELCOME TO RADIATOR SPRINGS - HOME\n          OF LIGHTNING MCQUEEN AND SIR TOW MATER.\"\n                         \n          EXT. FLO'S - DAY\n                         \n          Cars surround Mater and McQueen. The rest of the Radiator\n          Springs gang is here too, watches. VAN and MINNY are front\n          and center.\n                         \n                          MATER\n           So there I was: rocket jets going\n           full blast, McQueen hanging on for\n           dear life when suddenly them two\n           nasty lemons come out of nowhere,\n           guns drawed. We was goners. But\n           then out of nowhere, this beautiful\n           spy car swoops in from the sky to\n           save us!\n                         \n                          MINNY\n           That's a very entertaining story,\n           young man.\n                         \n                          VAN\n           Oh, Minny, please. Come on, none of\n           this happened. Rocket jets? Flying\n           spy cars?\n                         \n                          HOLLEY\n           No, you're quite right. It does\n           sound a bit far-fetched.\n                         \n          The crowd turns, sees HOLLEY, wings out, swooping in. FINN is\n          right below her, driving up the street.\n                         \n                          MATER\n           Holley! Finn!\n                         \n                          HOLLEY\n           Hello, Mater. It's so nice to see\n           you again.\n                         \n                          MATER\n           What're you doing here?\n           129.\n                         \n                         \n                          FINN\n           Our satellites picked up an urgent\n           communique.\n                         \n                          LUIGI\n           So you got my e-mail.\n                         \n                          MATER\n           Oh, man. Y'all is gonna have a\n           great time. Everybody! This here's\n           Finn McMissile. He's a secret\n           agent.\n                          (WHISPERS)\n           Don't tell nobody. And this is\n           Holley Shiftwell. She's ---\n                         \n                          HOLLEY\n           I'm Mater's girlfriend. It's so\n           nice to meet you all.\n                         \n          Everyone is shocked. Including Mater. Guido's jaw drops.\n                         \n                          LUIGI\n                          (TO MATER)\n           Guido believe you now.\n                         \n                          FLO\n                          (TO HOLLEY)\n           Whoa, honey. You got a nasty dent\n           there.\n                         \n          Indeed, Holley still wears the dent from when she saved Mater\n          from Grem and Acer.\n                         \n                          VAN\n           (already crushing on her)\n           Was that from when you swooped in\n           and saved them in London?\n                         \n                          MINNY\n           Van!\n                         \n                          VAN\n           What? I'm just asking.\n                         \n                          FLO\n                          (TO HOLLEY)\n           Don't you worry, sweet pea. My baby\n           Ramone can get that fixed up for\n           you in no time.\n                         \n                          RAMONE\n           Yeah, sure thing. No problemo. Just\n           let me go get my tools.\n           130.\n                         \n                         \n                          HOLLEY\n           Oh no no. I'm keeping that dent.\n           It's way too valuable.\n                         \n          Mater takes this in.\n                         \n                          LIZZIE\n           A \"valuable\" dent? Oh, she's as\n           crazy as Mater.\n                         \n                          MACK\n           Those two are perfect for each\n           other.\n                         \n                          MCQUEEN\n           You know, there's one thing I still\n           don't get. The bad guys hit me with\n           the beam from the camera, right? So\n           why didn't I, you know...\n                         \n                          MATER\n           Explode in a fiery inferno?\n                         \n                          MCQUEEN\n           Yeah.\n                         \n                          FINN\n           We couldn't figure that one out\n           either.\n                         \n                          HOLLEY\n           Our investigation proved that\n           Allinol was actually gasoline. And\n           Miles Axlerod engineered it so that\n           when it got hit by the beam it\n           would explode.\n                         \n                          MCQUEEN\n           Wait a second. Fillmore, you said\n           my fuel was safe.\n                         \n          McQueen turns to Fillmore. Everyone does.\n                         \n                          FILLMORE\n           If you're implying that I switched\n           out that rotgut excuse for\n           alternative fuel with my all-\n           natural, sustainable, organic\n           biofuel just because I never\n           trusted Axlerod, you're dead wrong,\n           man.\n                          (RE: SARGE)\n           It was him.\n           131.\n                         \n                         \n                          SARGE\n           Once Big Oil, always Big Oil. Man.\n                         \n                          FILLMORE\n           Tree hugger.\n                         \n          EXT. MAIN STREET - LATER\n                         \n          A banner says \"Radiator Springs Grand Prix.\"\n                         \n          SHERIFF rolls up the street.\n                         \n                          SHERIFF\n           The Radiator Springs Grand Prix is\n           about to begin! All spectators\n           clear the starting line!\n                         \n          MCQUEEN heads up Main Street, other racers following.\n                         \n                          LEWIS HAMILTON\n           Man, I can't wait to get rockin'.\n           This is gonna be wicked.\n                         \n                          JEFF GORVETTE\n           Yeah, we should do this every year.\n                         \n                          MCQUEEN\n           I just figured, we never found out\n           who the world's fastest car is.\n           Plus: no press, no trophy. Just\n           racing - the way I like it.\n                         \n                          FRANCESCO\n           Francesco likes it like this too.\n                         \n          McQueen SEES Sally. He and Francesco approach her.\n                         \n                          MCQUEEN\n           Francesco. I'd like you to meet ---\n                         \n                          FRANCESCO\n           Signorina Sally. It is official:\n           Lightning McQueen is the luckiest\n           car in the world.\n                         \n                          SALLY\n                          (SWOONING)\n           Why, thank you ---\n                         \n                          FRANCESCO\n           Which he will have to be to have a\n           chance against Francesco today.\n                         \n          Francesco turns to leave. As he's moving away:\n           132.\n                         \n                         \n                          FRANCESCO\n           See you at the finish line, Mc---\n                         \n          Francesco STOPS.\n                         \n                          FRANCESCO\n           What is that?\n                         \n          McQueen has a new bumper sticker: \"Ka-ciao, Francesco.\"\n                         \n                          MCQUEEN\n           It's just something I had made up\n           for the occasion.\n                         \n                          FRANCESCO\n           Is good, McQueen. Very funny. It\n           was funnier when I did it, but\n           it's very funny. What are you going\n           to do next? Are you going to take\n           off your fenders? Try it. You'll\n           like it.\n                         \n          Francesco leaves. We stay with McQueen and Sally.\n                         \n                          SALLY\n           So he's not so good-looking.\n                         \n                          MCQUEEN\n           Yeah. Nice try.\n                         \n                          SALLY\n           I'm serious.\n                         \n                          MCQUEEN\n           That's why I love you, Sally.\n           (as he leaves)\n           Wish me luck.\n                         \n                          SALLY\n           You don't need it!\n                         \n          He drives off. Flo approaches Sally.\n                         \n                          FLO\n           Mmm-mmm. That Francesco is fine-\n           looking.\n                         \n                          SALLY\n           And those open wheels.\n                         \n                          FLO\n           I'm gonna have to go get myself\n           some coolant.\n           133.\n                         \n                         \n          EXT. MAIN STREET - LATER\n                         \n          The racers at the starting grid. ON THE TRAFFIC LIGHT in the\n          center of town. It goes from RED to GREEN!\n                         \n          The RACERS SPEED OFF, tearing up main street and out of town,\n          blazing past tourists ---\n                         \n          EXT. WILLY'S BUTTE - DAY\n                         \n          As the racers, led by McQueen and Francesco, take the wide,\n          sweeping turn around Willy's Butte we CRANE UP to see MATER,\n          FINN, HOLLEY, and the Radiator Springs gang watching.\n          Everyone CHEERS.\n                         \n                          MATER\n           Go McQueen!! Whoo-hoo!!!\n                         \n          Holley gets an alert.\n                         \n                          HOLLEY\n           Finn, time to go. Siddeley's\n           gassed, geared and ready to fly.\n                         \n          Finn starts to back up.\n                         \n                          MATER\n           You're leaving already?\n                         \n                          FINN\n           We've got another mission, Mater.\n           Just stopped by here to \"pick\n           something up.\"\n                         \n          They both eye Mater, expectantly.\n                         \n                          MATER\n           Something tells me you're not\n           talking about souvenir bumper\n           stickers.\n                         \n                          FINN\n           Her Majesty asked for you\n           personally, Mater.\n                         \n                          MATER\n           But I told you all before. I'm not\n           a spy.\n                         \n                          HOLLEY\n           We know.\n           134.\n                         \n                         \n                          FINN\n           Spy or not, you're still the\n           smartest, most honest chap we've\n           ever met.\n                         \n                          HOLLEY\n           Don't forget massively charming.\n                         \n          Mater looks over at Holley. He looks touched.\n                         \n                          MATER\n           Well, thanks. But as much fun as it\n           was hanging with y'all, this...\n                         \n          He looks over to his friends who watch the race, CHEER\n          MCQUEEN ON.\n                         \n                          MATER\n           This is home.\n                         \n                          HOLLEY\n           That's alright, we understand. But\n           I'll be back. You still owe me that\n           first date.\n                         \n                          FINN\n           If there's ever anything I can do\n           for you, just let me know.\n                         \n                          MATER\n           Well, I sure appreciate that, thank\n           you.\n                          (THINKS)\n           Actually... there is one thing.\n                          CUT TO:\n                         \n          EXT. RADIATOR SPRINGS - MOMENTS LATER\n                         \n          MATER, blazing forward fast.\n                         \n                          MATER\n           Whoo-hoo!!!\n                         \n          He ROCKETS FORWARD, through the whole town. In doing so he\n          GRABS A BROKEN DOWN OTIS, hooking him ---\n                         \n                          OTIS\n           Whoa!!!\n                         \n          --- and TOSSING him right into Ramone's.\n                         \n           OTIS (O.S.)\n           Thanks, Mater!\n           135.\n                         \n                         \n          ON THE \"RACE TRACK\" - Mater flies past ALL the racers,\n          including Francesco ---\n                         \n                          FRANCESCO\n           Impossible!\n                         \n          --- until he approaches MCQUEEN.\n                         \n                          MCQUEEN\n           Mater!?\n                         \n                          MATER\n                          (KEEPING PACE)\n           Check it out. They let me keep the\n           rockets!\n                         \n                          MCQUEEN\n           I'll see you at the finish line,\n           buddy!\n                         \n                          MATER\n           Not if I see you first!\n                         \n          McQueen and Mater peel away from the rest of the racers, lead\n          them off the road and into the dirt for another lap. The two\n          friends are side by side when we FADE OUT.\n                         \n                         \n                          THE END": null}